Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: Last updated: October 17, 2024
ar: آخر تحديث: 17 أكتوبر 2024

source: By using Mysten Labs Testnet software, technologies, tools, and other services (collectively **“Testnet”**), you agree to the general Terms of Service and these additional Testnet Terms of Service (together, the **“Terms”**). If you do not agree, do not participate in Testnet. If you are using Testnet on behalf of an organization, you represent and warrant that you are an authorized representative of that organization and have the authority to bind that business or entity to the Terms.
ar: باستخدام برنامج Mysten Labs على الشبكة التجريبية وتقنياته وأدواته وخدماته الأخرى (يشار إليها مجتمعة باسم "الشبكة التجريبية")، فإنك توافق على شروط الخدمة العامة وشروط خدمة الشبكة التجريبية الإضافية هذه (يشار إليها مجتمعة باسم "الشروط"). إذا كنت لا توافق، فلا تشارك في الشبكة التجريبية. إذا كنت تستخدم الشبكة التجريبية نيابة عن منظمة، فأنت تقر وتضمن أنك ممثل مفوض لهذه المنظمة ولديك السلطة لإلزام هذه الشركة أو الكيان بالشروط.

source: Privacy Policy
ar: سياسة الخصوصية

source: Please review our [Privacy Policy](../legal/privacy.md), which also governs your use of Testnet, for information on how we collect, use and share your information. By using Testnet you agree to be bound by our Privacy Policy.
ar: يرجى مراجعة [سياسة الخصوصية](../legal/privacy.md)، التي تحكم أيضًا استخدامك للشبكة التجريبية، للحصول على معلومات حول كيفية جمع معلوماتك واستخدامها ومشاركتها. باستخدام الشبكة التجريبية، فإنك توافق على الالتزام بسياسة الخصوصية الخاصة بنا.

source: Eligibility Criteria
ar: معايير الأهلية

source: You may use Testnet only if you:
ar: يمكنك استخدام الشبكة التجريبية فقط إذا كنت:

source: Are 18 years or older and capable of forming a binding contract with us.
ar: 18 عامًا أو أكبر وقادر على تشكيل عقد ملزم معنا.

source: Are not otherwise barred from participating in Testnet under applicable law.
ar: لا يتم منعهم من المشاركة في الشبكة التجريبية بموجب القانون المعمول به.

source: We may, at our discretion, introduce new or change existing eligibility criteria or conditions we deem appropriate. Testnet may operate in certain phases, and your participation in any one phase of Testnet does not guarantee that you will be able to participate in any other phases of Testnet.
ar: يجوز لنا ، وفقًا لتقديرنا ، تقديم معايير أو شروط الأهلية الجديدة أو التي نغيرها مناسبة. قد تعمل الشبكة التجريبية في مراحل معينة ، ولا تضمن مشاركتك في أي مرحلة واحدة من الشبكة التجريبية أنك ستتمكن من المشاركة في أي مراحل أخرى من الشبكة التجريبية.

source: Duration
ar: مدة

source: Testnet will commence on the date we prescribe and continue until terminated at our discretion. We may change, discontinue, or wipe, temporarily or permanently, all or any part of Testnet, at any time and without notice at our discretion, including, without limitation, the modification of the presence, amounts, or any other conditions applicable to the Testnet tokens, without any liability to you or other Testnet users. We do not guarantee that Testnet tokens will continue to be offered for any particular length of time and you may not rely upon the continued availability of any Testnet tokens. In the event of the expiration of Testnet, you acknowledge and agree that your access to and use of your Testnet tokens will be removed, and all accrued Testnet tokens will be deleted from the Testnet system. Testnet tokens will not be converted into any future rewards offered by Mysten Labs.
ar: ستبدأ الشبكة التجريبية في تاريخ وصفنا ونستمر حتى إنهاء وفقًا لتقديرنا. يجوز لنا تغيير أو إيقاف أو مسح ، مؤقتًا أو دائمًا ، كل أو أي جزء من الشبكة التجريبية ، في أي وقت ودون إشعار وفقًا لتقديرنا ، بما في ذلك ، على سبيل المثال لا الحصر ، تعديل الوجود أو المبالغ أو أي شروط أخرى تنطبق على الشبكة التجريبية Tokens ، دون أي مسؤولية تجاهك أو غيرهم من مستخدمي الشبكة التجريبية. لا نضمن تقديم الرموز المميزة الشبكة التجريبية لأي مدة زمنية خاصة وقد لا تعتمد على استمرار توافر أي عملات الشبكة التجريبية. في حالة انتهاء انتهاء الشبكة التجريبية ، فإنك تقر وتوافق على أن وصولك إلى عملات الشبكة التجريبية واستخدامها ستتم إزالتها ، وسيتم حذف جميع عملات الشبكة التجريبية المستحقة من نظام الشبكة التجريبية. لن يتم تحويل الشبكة التجريبية Tokens إلى أي مكافآت مستقبلية تقدمها Mysten Labs.

source: Testnet Tokens
ar: عملات الشبكة التجريبية

source: During Testnet you may accumulate Testnet tokens, such as through the Testnet faucet, which are not, and will never convert to or accrue to become Mainnet tokens or any other tokens or virtual assets. Testnet tokens are virtual items with no monetary value. Testnet tokens do not constitute any currency or property of any type and are not redeemable, refundable, or eligible for any fiat or virtual currency or anything else of monetary value, under any circumstances. Testnet tokens are not transferable between users outside of the Testnet, and you may not attempt to sell, trade, or transfer any Testnet tokens outside of the Testnet, or obtain any manner of credit using any Testnet tokens. Any attempt to sell, trade, or transfer any Testnet tokens outside of the Testnet will be null and void.
ar: خلال الشبكة التجريبية، يمكنك تجميع عملات الشبكة التجريبية، مثل تلك التي يتم جمعها من خلال صنبور الشبكة التجريبية، والتي لا يتم تحويلها أو تجميعها لتصبح رموز الشبكة الرئيسية أو أي رموز أخرى أو أصول افتراضية ولن يتم تحويلها أبدًا إلى رموز أو أصول افتراضية. رموز Testnet هي عناصر افتراضية ليس لها قيمة نقدية. لا تشكل عملات الشبكة التجريبية أي عملة أو ممتلكات من أي نوع ولا يمكن استردادها أو استردادها أو أهليتها لأي عملة ورقية أو افتراضية أو أي شيء آخر ذي قيمة نقدية، تحت أي ظرف من الظروف. عملات الشبكة التجريبية غير قابلة للتحويل بين المستخدمين خارج الشبكة التجريبية، ولا يجوز لك محاولة بيع أو تداول أو نقل أي عملات من الشبكة التجريبية خارج الشبكة التجريبية، أو الحصول على أي شكل من أشكال الائتمان باستخدام أي عملات شبكة تجريبية. ستكون أي محاولة لبيع أو تداول أو نقل أي عملات الشبكة التجريبية خارج الشبكة التجريبيةباطلة ولاغية.

source: No Warranty
ar: لا يوجد ضمان

source: Mysten Labs provides the Testnet platform solely as a developer test environment. Testnet is provided "as is" and "with all faults." We make no warranties, express or implied, regarding the reliability, accuracy, performance, or fitness for a particular purpose of the service provided. You accept all risks associated with the use of Testnet and agree that Mysten Labs, its affiliates, and its employees shall not be liable for any damages, whether direct, indirect, incidental, special, consequential, or punitive, arising out of the use or inability to use the service, including but not limited to lost profits, loss of business, or data loss.
ar: يوفر Mysten Labs منصة الشبكة التجريبية فقط كبيئة اختبار المطور. يتم توفير الشبكة التجريبية "كما هو" و "مع كل الأخطاء". لا نقدم أي ضمانات أو صريحة أو ضمنية ، فيما يتعلق بالموثوقية أو الدقة أو الأداء أو اللياقة لغرض معين من الخدمة المقدمة. أنت تقبل جميع المخاطر المرتبطة باستخدام الشبكة التجريبية وتوافق على أن Mysten Labs والشركات التابعة لها وموظفيها لا تتحمل مسؤولية أي أضرار ، سواء كانت مباشرة ، غير مباشرة ، عرضية ، خاصة ، ناتجة عن ذلك AL ، أو العقابية ، الناشئة عن الاستخدام أو عدم القدرة على استخدام الخدمة ، بما في ذلك على سبيل المثال لا الحصر الأرباح المفقودة أو فقدان الأعمال أو فقدان البيانات.

source: No employee or representative of Mysten Labs is authorized to make any warranties or representations beyond those stated in this agreement. Any statements made by employees or representatives of Mysten Labs regarding the service shall not be construed as warranties or representations, and customers agree to indemnify and hold harmless Mysten Labs from any such statements.
ar: لا يُسمح لأي موظف أو ممثل Mysten Labs بتقديم أي ضمانات أو تمثيلات تتجاوز تلك الموضحة في هذه الاتفاقية. لا يجوز تفسير أي بيانات أدلى بها الموظفون أو ممثلي Mysten Labs المتعلقة بالخدمة على أنها ضمانات أو تمثيلات ، ويوافق العملاء على تعويض مختبرات Mysten غير الضارة من أي بيانات من هذا القبيل.

source: Any deficiencies or errors in the Testnet platform shall not constitute a breach of this agreement, and customers agree to waive any right to seek a refund or compensation based on such deficiencies or errors. This "as is, no warranty" provision shall survive the termination or expiration of any other agreements between you and Mysten Labs.
ar: يجب ألا تشكل أي أوجه قصور أو أخطاء في منصة الشبكة التجريبية خرقًا لهذه الاتفاقية ، ويوافق العملاء على التنازل عن أي حق في البحث عن استرداد أو تعويض بناءً على مثل هذه الأوجه أو الأخطاء. هذا "كما هو ، لا يوجد ضمان" يجب أن ينجو من إنهاء أو انتهاء أي اتفاقيات أخرى بينك وبين Mysten Labs.

source: PRIVACY POLICY
ar: سياسة الخصوصية

source: **Last Updated:** June 18, 2024
ar: ** آخر تحديث: ** 18 يونيو 2024

source: This Privacy Policy is designed to help you understand how Mysten Labs, Inc., its subsidiaries and affiliates (collectively called "**Mysten Labs**", "**we**," "**us**," and "**our**") collects, uses, and shares your personal information and to help you understand and exercise your privacy rights in accordance with applicable law. This Policy applies when you use our websites, contact our team members, engage with us on social media or otherwise interact with us.
ar: تم تصميم سياسة الخصوصية هذه لمساعدتك على فهم كيفية شركة Mysten Labs ، Inc. ، وشركاتها التابعة والشركات التابعة لها (تسمى مجتمعة "** Mysten Labs **" ، "** WE ** ،" "** US ** ،" و "و" و "و" و "و" و ". ** لدينا ** ") يجمع ويستخدم ويشارك معلوماتك الشخصية وللمساعدتك في فهم حقوق الخصوصية الخاصة بك وممارسة وفقًا للقانون المعمول به. تنطبق هذه السياسة عند استخدام مواقع الويب الخاصة بنا ، أو الاتصال بأعضاء فريقنا ، أو التعامل معنا على وسائل التواصل الاجتماعي أو التفاعل معنا بطريقة أخرى.

source: [SCOPE](#scope)
ar: [النطاق] ](#scope)

source: [CHANGES TO OUR PRIVACY POLICY](#changes-to-our-privacy-policy)
ar: [تغييرات على سياسة الخصوصية الخاصة بنا](#changes-to-our-privacy-policy)

source: [PERSONAL INFORMATION WE COLLECT](#personal-information-we-collect)
ar: [المعلومات الشخصية التي نجمعها](#المعلومات-الشخصية-التي-نجمعها)

source: [HOW WE USE YOUR INFORMATION](#how-we-use-your-information)
ar: [كيف نستخدم معلوماتك](#how-we-use-your-information)

source: [HOW WE DISCLOSE YOUR INFORMATION](#how-we-disclose-your-information)
ar: [كيف نفصح عن معلوماتك](#how-we-disclose-your-information)

source: [YOUR PRIVACY CHOICES AND RIGHTS](#your-privacy-choices-and-rights)
ar: [خياراتك وحقوقك المتعلقة بالخصوصية](#your-privacy-choices-and-rights)

source: [SECURITY OF YOUR INFORMATION](#security-of-your-information)
ar: [أمان معلوماتك] (#security-of-your-information)

source: [INTERNATIONAL DATA TRANSFERS](#international-data-transfers)
ar: [نقل البيانات الدولية] ](#international-data-transfers)

source: [RETENTION OF PERSONAL INFORMATION](#retention-of-personal-information)
ar: [الاحتفاظ بالمعلومات الشخصية] (#retention-of-personal-information)

source: [SUPPLEMENTAL NOTICE FOR CALIFORNIA RESIDENTS](#supplemental-notice-for-california-residents)
ar: [إشعار تكميلي لسكان كاليفورنيا] (#supplemental-notice-for-california-residents)

source: [SUPPLEMENTAL NOTICE FOR NEVADA RESIDENTS](#supplemental-notice-for-nevada-residents)
ar: [إشعار تكميلي لسكان نيفادا] (#supplemental-notice-for-nevada-residents)

source: [CHILDREN'S INFORMATION](#childrens-information)
ar: [معلومات الأطفال] ](#childrens-information)

source: [THIRD-PARTY'S WEBSITES/APPLICATIONS](#third-party-websitesapplications)
ar: [مواقع/تطبيقات طرف ثالث] (#third-party-websitesapplications)

source: [SUPERVISORY AUTHORITY](#supervisory-authority)
ar: [السلطة الإشرافية] ](#supervisory-authority)

source: [CONTACT US](#contact-us)
ar: [اتصل بنا] (#contact-us)

source: SCOPE
ar: نطاق

source: This Privacy Policy applies to personal information processed by Mysten Labs, including on our websites (the "**Site**"), and other online and offline offerings. The Site, our services and our other online and offline offerings are collectively called the "**Services**." For clarity, the Services do not include the Walrus Protocol or any other decentralized aspect of the Walrus or Sui Blockchain that is not controlled by Mysten Labs due to the decentralized nature of these blockchains.
ar: تنطبق سياسة الخصوصية هذه على المعلومات الشخصية التي تتم معالجتها بواسطة Mysten Labs ، بما في ذلك على مواقع الويب الخاصة بنا ("الموقع ** **") ، وغيرها من العروض عبر الإنترنت وغير المتصلة بالإنترنت. يسمى الموقع وخدماتنا وعروضنا الأخرى عبر الإنترنت وغير المتصلة بالإنترنت مجتمعة "** Services **." للتوضيح ، لا تتضمن الخدمات بروتوكول Walrus أو أي جانب آخر لا مركزي من Walrus أو Sui بلوكتشين الذي لا يتم التحكم فيه بواسطة Mysten Labs بسبب الطبيعة اللامركزية لهذه الحواف.

source: CHANGES TO OUR PRIVACY POLICY
ar: التغييرات في سياسة الخصوصية لدينا

source: We may revise this Privacy Policy from time to time in our sole discretion. If there are any material changes to this Privacy Policy, we will notify you as required by applicable law. You understand and agree that you will be deemed to have accepted the updated Privacy Policy if you continue to use our Services after the new Privacy Policy takes effect.
ar: قد نقوم بمراجعة سياسة الخصوصية هذه من وقت لآخر وفقًا لتقديرنا الخاص. إذا كان هناك أي تغييرات مادية على سياسة الخصوصية هذه ، فسنخطرك كما هو مطلوب بموجب القانون المعمول به. أنت تفهم وتوافق على أنه سيتم اعتبار أنك قد قبلت سياسة الخصوصية المحدثة إذا واصلت استخدام خدماتنا بعد سريان سياسة الخصوصية الجديدة.

source: PERSONAL INFORMATION WE COLLECT
ar: المعلومات الشخصية التي نجمعها

source: The categories of personal information we collect depend on how you interact with us, our Services and the requirements of applicable law. We collect information that you provide to us, information we obtain automatically when you use our Services, and information from other sources such as third-party services and organizations, as described below.
ar: تعتمد فئات المعلومات الشخصية التي نجمعها على كيفية تفاعلك معنا وخدماتنا ومتطلبات القانون المعمول به. نجمع المعلومات التي تقدمها لنا ، والمعلومات التي نحصل عليها تلقائيًا عند استخدام خدماتنا ، ومعلومات من مصادر أخرى مثل خدمات ومنظمات الطرف الثالث ، كما هو موضح أدناه.

source: A. **Information You Provide to Us Directly**
ar: A. ** المعلومات التي تقدمها لنا مباشرة **

source: We may collect the following personal information that you provide to us.
ar: قد نجمع المعلومات الشخصية التالية التي تقدمها لنا.

source: **Account Creation**. We may collect information if you create an account with us, such as your name, username, email address, or password.
ar: ** إنشاء الحساب **. يجوز لنا جمع المعلومات إذا قمت بإنشاء حساب معنا ، مثل اسمك أو اسم المستخدم أو عنوان البريد الإلكتروني أو كلمة المرور.

source: **Wallet and Transaction Information.** In order to engage in transactions on the Services, you may need to provide us or our third-party payment processors with access to or information about your digital wallet. We will never ask you for or collect your private keys.
ar: ** معلومات المحفظة والمعاملات. ** من أجل المشاركة في المعاملات على الخدمات ، قد تحتاج إلى تزويدنا أو معالجات الدفع بجهة خارجية مع محفظتك الرقمية. لن نطلب منك أبدًا أو جمع مفاتيحك الخاصة.

source: **Other Transactions**. We may collect personal information and details associated with your activities on our Services, including to deliver you your rewards associated with your use of the Services.
ar: ** المعاملات الأخرى **. يجوز لنا جمع المعلومات الشخصية والتفاصيل المرتبطة بأنشطتك على خدماتنا ، بما في ذلك لتقديم مكافآتك المرتبطة باستخدام الخدمات.

source: **Your Communications with Us**. We may collect personal information, such as email address when you request information about our Services, register for our newsletter or marketing promotions, request customer or technical support, apply for a job or otherwise communicate with us.
ar: ** اتصالاتك معنا **. يجوز لنا جمع المعلومات الشخصية ، مثل عنوان البريد الإلكتروني عندما تطلب معلومات حول خدماتنا ، أو التسجيل في النشرة الإخبارية أو الترويج التسويقي ، أو طلب الدعم الفني أو الدعم الفني ، أو التقدم للحصول على وظيفة أو التواصل معنا بطريقة أخرى.

source: **Interactive Features**. We and others who use our Services may collect personal information that you submit or make available through our interactive features (e.g., via the Mysten Labs community, commenting functionalities, forums, blogs, and social media pages). Any personal information you provide on the public sections of these features will be considered "public," unless otherwise required by applicable law, and is not subject to the privacy protections referenced herein.
ar: ** الميزات التفاعلية **. قد نقوم نحن والآخرين الذين يستخدمون خدماتنا بجمع المعلومات الشخصية التي تقدمها أو توفرها من خلال ميزاتنا التفاعلية (على سبيل المثال ، عبر مجتمع Mysten Labs ، وظائف التعليق ، المنتديات ، المدونات ، وصفحات الوسائط الاجتماعية). سيتم اعتبار أي معلومات شخصية تقدمها على الأقسام العامة من هذه الميزات "علنية" ، ما لم يطلب الأمر خلاف ذلك بموجب القانون المعمول به ، ولا يخضع لحماية الخصوصية المشار إليها هنا.

source: **Surveys**. We may contact you to participate in surveys. If you decide to participate, you may be asked to provide certain information which may include personal information.
ar: ** الدراسات الاستقصائية **. قد نتصل بك للمشاركة في الدراسات الاستقصائية. إذا قررت المشاركة ، فقد يُطلب منك تقديم معلومات معينة قد تتضمن معلومات شخصية.

source: **Sweepstakes, Giveaways or Contests**. We may collect personal information you provide for any sweepstakes, giveaways or contests that we offer. In some jurisdictions, we are required to publicly share information of sweepstakes and contest winners.
ar: ** اليانصيب ، الهبات أو المسابقات **. يجوز لنا جمع المعلومات الشخصية التي تقدمها لأي اليانصيب أو الهبات أو المسابقات التي نقدمها. في بعض الولايات القضائية ، يتعين علينا مشاركة المعلومات علنًا عن الفائزين بالمسابقة والفائزين.

source: **Events.** We may collect personal information from individuals when we attend or host conferences, trade shows, and other events.
ar: ** الأحداث. ** قد نجمع معلومات شخصية من الأفراد عندما نحضر أو ​​نستضيف المؤتمرات والمعارض التجارية وغيرها من الأحداث.

source: **Business Development and Strategic Partnerships.** We may collect personal information from individuals and third parties to assess and pursue potential business opportunities.
ar: ** تطوير الأعمال والشراكات الاستراتيجية. ** يجوز لنا جمع المعلومات الشخصية من الأفراد والأطراف الثالثة لتقييم ومتابعة فرص العمل المحتملة.

source: **Job Applications.** We may post job openings and opportunities on our Services. If you reply to one of these postings by submitting your application, CV and/or cover letter to us, we will collect and use this information to assess your qualifications.
ar: ** تطبيقات الوظائف. ** قد ننشر فرص الوظائف والفرص في خدماتنا. إذا قمت بالرد على أحد هذه المنشورات عن طريق تقديم طلبك أو السيرة الذاتية و/أو خطاب التغطية إلينا ، فسنقوم بجمع هذه المعلومات ونستخدمها لتقييم مؤهلاتك.

source: B. **Information Collected Automatically**
ar: B. ** المعلومات التي تم جمعها تلقائيًا **

source: We may collect personal information automatically when you use our Services:
ar: يجوز لنا جمع المعلومات الشخصية تلقائيًا عند استخدام خدماتنا:

source: **Automatic Data Collection**. We may collect certain information automatically when you use our Services, such as your Internet protocol (IP) address, user settings, MAC address, cookie identifiers, mobile carrier, mobile advertising and other unique identifiers, browser or device information, location information (including approximate location derived from IP address), Internet service provider, and metadata about the content you provide. We may also automatically collect information regarding your use of our Services, such as pages that you visit before, during and after using our Services, information about the links you click, the types of content you interact with, the frequency and duration of your activities, and other information about how you use our Services.
ar: ** جمع البيانات التلقائي **. يجوز لنا جمع معلومات معينة تلقائيًا عند استخدام خدماتنا ، مثل عنوان بروتوكول الإنترنت (IP) ، وإعدادات المستخدم ، وعنوان MAC ، ومعرفات ملفات تعريف الارتباط ، وشركات الهاتف المحمول ، والإعلانات المحمولة ، ومعرفات الفريدة الأخرى ، ومتصفح أو معلومات الجهاز ، ومعلومات الموقع (بما في ذلك الموقع التقريبي المستمد من عنوان IP) ومزود خدمة الإنترنت والبيانات الوصفية حول المحتوى الذي تقدمه. يجوز لنا أيضًا جمع المعلومات تلقائيًا ز استخدامك لخدماتنا ، مثل الصفحات التي تزورها قبل وبعد استخدام خدماتنا ، ومعلومات حول الروابط التي تنقر عليها ، وأنواع المحتوى الذي تتفاعل معه ، وتواتر ومدة أنشطتك ، وغيرها من المعلومات حول كيفية يمكنك استخدام خدماتنا.

source: **Cookies, Pixel Tags/Web Beacons, and Other Technologies**. We, as well as third parties that provide content, advertising, or other functionality on our Services, may use cookies, pixel tags, local storage, and other technologies ("**Technologies**") to automatically collect information through your use of our Services.
ar: ** ملفات تعريف الارتباط وعلامات البيكسل/منارات الويب والتقنيات الأخرى **. نحن ، بالإضافة إلى أطراف ثالثة توفر المحتوى أو الإعلان أو غيرها من الوظائف على خدماتنا ، قد نستخدم ملفات تعريف الارتباط وعلامات البكسل والتخزين المحلي والتقنيات الأخرى ("** Technologies **") لجمع المعلومات تلقائيًا من خلال استخدامك لـ خدماتنا.

source: **Cookies**. Cookies are small text files placed in device browsers that store preferences and facilitate and enhance your experience.
ar: ** ملفات تعريف الارتباط **. ملفات تعريف الارتباط هي ملفات نصية صغيرة موضوعة في متصفحات الأجهزة التي تخزن التفضيلات وتسهيل تجربتك وتعزيزها.

source: **Pixel Tags/Web Beacons**. A pixel tag (also known as a web beacon) is a piece of code embedded in our Services that collects information about engagement on our Services. The use of a pixel tag allows us to record, for example, that a user has visited a particular web page or clicked on a particular advertisement. We may also include web beacons in e-mails to understand whether messages have been opened, acted on, or forwarded.
ar: **علامات البكسل/إشارات الويب**. علامة البكسل (المعروفة أيضًا باسم إشارة الويب) هي جزء من التعليمات البرمجية المضمنة في خدماتنا والتي تجمع معلومات حول التفاعل مع خدماتنا. يتيح لنا استخدام علامة البكسل تسجيل، على سبيل المثال، أن المستخدم قد زار صفحة ويب معينة أو نقر على إعلان معين. قد نقوم أيضًا بتضمين إشارات الويب في رسائل البريد الإلكتروني لفهم ما إذا كانت الرسائل قد تم فتحها أو التصرف فيها أو إعادة توجيهها.

source: Our uses of these Technologies fall into the following general categories:
ar: تستخدم استخداماتنا لهذه التقنيات في الفئات العامة التالية:

source: **Operationally Necessary**. This includes Technologies that allow you access to our Services, applications, and tools that are required to identify irregular website behavior, prevent fraudulent activity, improve security, or allow you to make use of our functionality;
ar: ** ضروري من الناحية التشغيلية **. يتضمن ذلك التقنيات التي تتيح لك الوصول إلى خدماتنا وتطبيقاتنا وأدواتنا المطلوبة لتحديد سلوك موقع الويب غير المنتظم ، أو منع النشاط الاحتيالي ، أو تحسين الأمان ، أو السماح لك بالاستفادة من وظائفنا ؛

source: **Performance-Related**. We may use Technologies to assess the performance of our Services, including as part of our analytic practices to help us understand how individuals use our Services (_see Analytics below_);
ar: ** المتعلق بالأداء **. قد نستخدم التقنيات لتقييم أداء خدماتنا ، بما في ذلك كجزء من ممارساتنا التحليلية لمساعدتنا على فهم كيفية استخدام الأفراد خدماتنا (_See Analytics أدناه_) ؛

source: **Functionality-Related**. We may use Technologies that allow us to offer you enhanced functionality when accessing or using our Services. This may include identifying you when you sign into our Services or keeping track of your specified preferences, interests, or past items viewed;
ar: ** المتعلقة بالوظيفة **. قد نستخدم التقنيات التي تسمح لنا بتقديم وظائف محسّنة عند الوصول أو استخدام خدماتنا. قد يشمل ذلك تحديد هويتك عند تسجيل الدخول إلى خدماتنا أو تتبع تفضيلاتك أو اهتماماتك المحددة أو العناصر السابقة التي يتم عرضها ؛
