Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: **Advertising- or Targeting-Related**. We may use first party or third-party Technologies to deliver content, including ads relevant to your interests, on our Services or on third-party websites.
ar: ** الإعلان- أو الاستهداف المرتبط **. قد نستخدم تقنيات الطرف الأول أو الطرف الثالث لتقديم المحتوى ، بما في ذلك الإعلانات ذات الصلة بمصالحك ، أو على خدماتنا أو على مواقع الطرف الثالث.

source: _See "[Your Privacy Choices and Rights](#your-privacy-choices-and-rights)" below to understand your choices regarding these Technologies._
ar: _See "[خياراتك وحقوقك المتعلقة بالخصوصية] (#your-privacy-choices-and-rights) أدناه لفهم اختياراتك فيما يتعلق بهذه التقنيات.._

source: **Analytics**. We may use our Technologies and other third-party tools to process analytics information on our Services. These technologies allow us to process usage data to better understand how our website and web-related Services are used, and to continually improve and personalize our Services. Some of our analytics partners include:
ar: ** التحليلات **. قد نستخدم تقنياتنا وأدوات الطرف الثالث الأخرى لمعالجة معلومات التحليلات حول خدماتنا. تتيح لنا هذه التقنيات معالجة بيانات الاستخدام لفهم كيفية استخدام موقعنا وخدماتنا المتعلقة بالمواقع بشكل أفضل ، وتحسين خدماتنا وتخصيصها باستمرار. بعض شركاء التحليلات لدينا تشمل:

source: **Google Analytics**. For more information about how Google uses your data (including for its own purposes, e.g., for profiling or linking it to other data), please visit [Google Analytics' Privacy Policy](http://www.google.com/policies/privacy/partners/). To learn more about how to opt-out of Google Analytics' use of your information, please click [here](http://tools.google.com/dlpage/gaoptout).
ar: **Google Analytics**. لمزيد من المعلومات حول كيفية استخدام Google لبياناتك (بما في ذلك لأغراضها الخاصة، على سبيل المثال، لإنشاء ملف تعريف أو ربطها ببيانات أخرى)، يُرجى زيارة [سياسة خصوصية Google Analytics](http://www.google.com/policies/privacy/partners/). لمعرفة المزيد حول كيفية إلغاء الاشتراك في استخدام Google Analytics لمعلوماتك، يُرجى النقر [هنا](http://tools.google.com/dlpage/gaoptout).

source: **LinkedIn Analytics**. For more information, please visit [LinkedIn Analytics' Privacy Policy](https://www.linkedin.com/legal/privacy-policy). To learn more about how to opt-out of LinkedIn's use of your information, please click [here](https://www.linkedin.com/help/linkedin/answer/62931?trk=microsites-frontend_legal_privacy-policy&lang=en).
ar: ** LinkedIn Analytics **. لمزيد من المعلومات ، يرجى زيارة [سياسة الخصوصية LinkedIn Analytics] (https://www.linkedin.com/legal/privacy-policy). لمعرفة المزيد حول كيفية إلغاء الاشتراك في استخدام LinkedIn لمعلوماتك ، يرجى النقر فوق [هنا] (https://www.linkedin.com/help/linkedin/answer/62931؟trk=microsites-frontend_legal_privacy-policy&lang=en) .

source: **Facebook Connect**. For more information, please visit Facebook's [Data Policy](https://www.facebook.com/policy.php?ref=pf). You can object to the collection of your data by Facebook pixel, or to the use of your data for the purpose of displaying Facebook ads by contacting the following address while logged into your Facebook account: https://www.facebook.com/settings?tab=ads.
ar: ** Facebook Connect **. لمزيد من المعلومات ، يرجى زيارة Facebook [سياسة البيانات] (https://www.facebook.com/policy.php؟ref=PF). يمكنك الاعتراض على مجموعة بياناتك عن طريق Pixel على Facebook ، أو إلى استخدام بياناتك لغرض عرض إعلانات Facebook عن طريق الاتصال بالعنوان التالي أثناء تسجيل الدخول إلى حسابك على Facebook: https://www.facebook.com/settings ؟ علامة التبويب = الإعلانات.

source: **Mixpanel**. For more information about Mixpanel, please visit [Mixpanel's Privacy Policy](https://mixpanel.com/legal/privacy-policy/).
ar: ** mixpanel **. لمزيد من المعلومات حول Mixpanel ، يرجى زيارة [سياسة خصوصية Mixpanel] (https://mixpanel.com/legal/privacy-policy/).

source: **Social Media Platforms**. Our Services may contain social media buttons, such as Discord, Twitter, Instagram, TikTok, Youtube, and Telegram, which might include widgets such as the "share this" button or other interactive mini programs. These features may collect your IP address and which page you are visiting on our Services and may set a cookie to enable the feature to function properly. Your interactions with these platforms are governed by the privacy policy of the company providing it.
ar: ** منصات التواصل الاجتماعي **. قد تحتوي خدماتنا على أزرار وسائل التواصل الاجتماعي ، مثل Discord و Twitter و Instagram و Tiktok و YouTube و Telegram ، والتي قد تتضمن أجهزة واجهة المستخدم مثل الزر "مشاركة هذا" أو غيرها من البرامج المصغرة التفاعلية. قد تجمع هذه الميزات عنوان IP الخاص بك والصفحة التي تزورها في خدماتنا وقد تقوم بتعيين ملف تعريف ارتباط لتمكين الميزة من العمل بشكل صحيح. تخضع تفاعلاتك مع هذه المنصات لسياسة خصوصية الشركة التي توفرها.

source: C. **Information Collected from Other Sources**
ar: C. ** المعلومات التي تم جمعها من مصادر أخرى **

source: **Third-Party Sources.** We may obtain information about you from other sources, including through third-party services and organizations. For example, if you access our Services through a third-party application, such as an app store, a third-party login service, or a social networking site, we may collect information about you from that third-party application that you have made available via your privacy settings.
ar: ** مصادر الطرف الثالث. ** قد نحصل على معلومات عنك من مصادر أخرى ، بما في ذلك من خلال خدمات ومنظمات الطرف الثالث. على سبيل المثال ، إذا قمت بالوصول إلى خدماتنا من خلال تطبيق طرف ثالث ، مثل متجر التطبيقات ، أو خدمة تسجيل الدخول إلى الطرف الثالث ، أو موقع التواصل الاجتماعي ، فقد نجمع معلومات عنك من هذا التطبيق الثالث الذي قدمته متاح عبر إعدادات الخصوصية الخاصة بك.

source: **Referrals, Sharing and Other Features**. Our Services may offer various tools and functionalities that allow you to provide information about your friends through our referral service; third parties may also use these services to upload information about you. Our referral services may also allow you to forward or share certain content with a friend or colleague, such as an email inviting your friend to use our Services. Please only share with us contact information of people with whom you have a relationship (e.g., relative, friend, neighbor, or co-worker).
ar: ** الإحالات والمشاركة والميزات الأخرى **. قد تقدم خدماتنا أدوات ووظائف مختلفة تتيح لك تقديم معلومات عن أصدقائك من خلال خدمة الإحالة الخاصة بنا ؛ قد تستخدم أطراف ثالثة هذه الخدمات لتحميل المعلومات عنك. قد تسمح لك خدمات الإحالة الخاصة بنا أيضًا بإعادة توجيه محتوى معين أو مشاركته مع صديق أو زميل ، مثل بريد إلكتروني يدعو صديقك إلى استخدام خدماتنا. يرجى مشاركة معلومات الاتصال معنا فقط من الأشخاص الذين لديك علاقة (على سبيل المثال ، قريب أو صديق أو جار أو زميل في العمل).

source: HOW WE USE YOUR INFORMATION
ar: كيف نستخدم معلوماتك

source: We use your information for a variety of business purposes, including to provide our Services, for administrative purposes, and to market our products and Services, as described below.
ar: نستخدم معلوماتك لمجموعة متنوعة من أغراض العمل ، بما في ذلك تقديم خدماتنا ، وأغراضنا الإدارية ، وتسويق منتجاتنا وخدماتنا ، كما هو موضح أدناه.

source: A. **Provide Our Services**
ar: A. ** تقديم خدماتنا **

source: We use your information to fulfill our contract with you and provide you with our Services and perform our contract with you, such as:
ar: نستخدم معلوماتك لإنجاز عقدنا معك ونزودك بخدماتنا وأداء عقدنا معك ، مثل:

source: Managing your information and accounts;
ar: إدارة معلوماتك وحساباتك ؛

source: Providing access to certain areas, functionalities, and features of our Services;
ar: توفير الوصول إلى بعض المناطق والوظائف وميزات خدماتنا ؛

source: Answering requests for customer or technical support;
ar: رد طلبات الدعم الفني للعميل أو الدعم الفني ؛

source: Communicating with you about your account, activities on our Services, and policy changes;
ar: التواصل معك حول حسابك وأنشطتك على خدماتنا وتغييرات السياسة ؛

source: Processing information about your wallet to facilitate transfers via the Services;
ar: معالجة المعلومات حول محفظتك لتسهيل عمليات النقل عبر الخدمات ؛

source: Processing applications if you apply for a job, we post on our Services; and
ar: معالجة الطلبات إذا تقدمت بطلب للحصول على وظيفة ، فإننا ننشر على خدماتنا ؛ و

source: Allowing you to register for events.
ar: يسمح لك بالتسجيل في الأحداث.

source: B. **Administrative Purposes**
ar: B. ** الأغراض الإدارية **

source: We use your information for our legitimate interest, such as:
ar: نستخدم معلوماتك لمصلحتنا المشروعة ، مثل:

source: Pursuing our legitimate interests such as direct marketing, research and development (including marketing research), network and information security, and fraud prevention;
ar: متابعة اهتماماتنا المشروعة مثل التسويق المباشر والبحث والتطوير (بما في ذلك أبحاث التسويق) وأمن الشبكة والمعلومات والوقاية من الاحتيال ؛

source: Detecting security incidents, protecting against malicious, deceptive, fraudulent or illegal activity, and prosecuting those responsible for that activity;
ar: اكتشاف الحوادث الأمنية ، والحماية من النشاط الخبيث أو الخادع أو الاحتيالي أو غير القانوني ، ومحاكمة المسؤولين عن هذا النشاط ؛

source: Measuring interest and engagement in our Services;
ar: قياس الاهتمام والمشاركة في خدماتنا ؛

source: Improving, upgrading or enhancing our Services;
ar: تحسين أو ترقية أو تعزيز خدماتنا ؛

source: Developing new products and Services;
ar: تطوير منتجات وخدمات جديدة ؛

source: Ensuring internal quality control and safety;
ar: ضمان مراقبة الجودة الداخلية والسلامة ؛

source: Authenticating and verifying individual identities;
ar: مصادقة الهويات الفردية والتحقق منها ؛

source: Debugging to identify and repair errors with our Services;
ar: تصحيح الأخطاء لتحديد وإصلاح الأخطاء مع خدماتنا ؛

source: Auditing relating to interactions, transfers and other compliance activities;
ar: التدقيق المتعلق بالتفاعلات والتحويلات وغيرها من أنشطة الامتثال ؛

source: Sharing information with third parties as needed to provide the Services;
ar: مشاركة المعلومات مع أطراف ثالثة حسب الحاجة لتقديم الخدمات ؛

source: Enforcing our agreements and policies; and
ar: إنفاذ اتفاقياتنا وسياساتنا ؛ و

source: Other uses as required to comply with our legal obligations.
ar: استخدامات أخرى كما هو مطلوب للامتثال لالتزاماتنا القانونية.

source: C. **Marketing and Advertising our Products and Services**
ar: C. ** التسويق والإعلان عن منتجاتنا وخدماتنا **

source: We may use personal information to tailor and provide you with content and advertisements. We may provide you with these materials as permitted by applicable law. Some of the ways we may market to you include email campaigns, custom audiences advertising, and "interest-based" or "personalized advertising," including through cross-device tracking.
ar: قد نستخدم المعلومات الشخصية لتخصيصك وتزويدك بالمحتوى والإعلانات. قد نوفر لك هذه المواد كما يسمح بموجب القانون المعمول به. تتضمن بعض الطرق التي قد نقوم بتسويقها لك حملات البريد الإلكتروني وإعلانات الجماهير المخصصة و "الإعلانات القائمة على الفائدة" أو "الإعلانات الشخصية" ، بما في ذلك من خلال تتبع الجهاز.

source: If you have any questions about our marketing practices or if you would like to opt out of the use of your personal information for marketing purposes, you may contact us at any time as set forth in "[Contact Us](#contact-us)" below.
ar: إذا كانت لديك أي أسئلة حول ممارساتنا التسويقية أو إذا كنت ترغب في إلغاء استخدام معلوماتك الشخصية لأغراض التسويق، فيمكنك الاتصال بنا في أي وقت على النحو المبين في "[اتصل بنا](#contact-us)" أدناه.

source: D. **With Your Consent**
ar: D. ** بموافقتك **

source: We may use personal information for other purposes that are clearly disclosed to you at the time you provide personal information or with your consent.
ar: قد نستخدم المعلومات الشخصية لأغراض أخرى يتم الكشف عنها بوضوح لك في الوقت الذي تقدم فيه معلومات شخصية أو بموافقتك.

source: E. **Other Purposes**
ar: E. ** أغراض أخرى **

source: We also use your information for other purposes as requested by you or as permitted by applicable law.
ar: نستخدم أيضًا معلوماتك لأغراض أخرى حسب طلبك أو على النحو المسموح به بموجب القانون المعمول به.

source: **Automated Decision Making**. We may engage in automated decision making, including profiling. Mysten Labs's processing of your personal information will not result in a decision based solely on automated processing that significantly affects you unless such a decision is necessary as part of a contract we have with you, we have your consent, or we are permitted by law to engage in such automated decision making. If you have questions about our automated decision making, you may contact us as set forth in "[Contact Us](#contact-us)" below.
ar: **اتخاذ القرارات آليًا**. يجوز لنا المشاركة في اتخاذ القرارات آليًا، بما في ذلك إنشاء ملفات تعريف شخصية. لن تؤدي معالجة Mysten Labs لمعلوماتك الشخصية إلى اتخاذ قرار يعتمد فقط على المعالجة الآلية التي تؤثر عليك بشكل كبير ما لم يكن مثل هذا القرار ضروريًا كجزء من عقد بيننا وبينك، أو حصلنا على موافقتك، أو يسمح لنا القانون بالمشاركة في اتخاذ مثل هذا القرار الآلي. إذا كانت لديك أسئلة حول اتخاذنا للقرار الآلي، فيمكنك الاتصال بنا على النحو المبين في "[اتصل بنا](#contact-us)" أدناه.

source: **De-identified and Aggregated Information.** We may use personal information and other information about you to create de-identified and/or aggregated information, such as de-identified demographic information, de-identified location information, information about the device from which you access our Services, or other analyses we create.
ar: ** المعلومات غير المحددة والمجمعة. ** قد نستخدم المعلومات الشخصية وغيرها من المعلومات عنك لإنشاء معلومات غير محددة و/أو مجمعة ، مثل المعلومات الديموغرافية غير المحددة ، ومعلومات الموقع غير المحدد ، والمعلومات حول الجهاز التي يمكنك الوصول إليها من خدماتنا ، أو التحليلات الأخرى التي ننشئها.

source: HOW WE DISCLOSE YOUR INFORMATION
ar: كيف نكشف عن معلوماتك

source: We disclose your information to third parties for a variety of business purposes, including to provide our Services, to protect us or others, or in the event of a major business transaction such as a merger, sale, or asset transfer, as described below.
ar: نحن نكشف عن معلوماتك إلى أطراف ثالثة لمجموعة متنوعة من أغراض العمل ، بما في ذلك تقديم خدماتنا ، أو حمايتنا أو غيرها ، أو في حالة وجود معاملة تجارية رئيسية مثل الاندماج أو البيع أو نقل الأصول ، كما هو موضح أدناه.

source: A. **Disclosures to Provide our Services**
ar: A. ** الإفصاح لتقديم خدماتنا **

source: The categories of third parties with whom we may share your information are described below.
ar: يتم وصف فئات الأطراف الثالثة التي قد نشاركها في معلوماتك أدناه.

source: **Notice Regarding Use of Blockchain.** Transactions on the Services will be conducted via Blockchain. Information about your transfers will be provided to a Blockchain and may be accessible to third parties due to the public nature of the Blockchain. Because entries to a Blockchain are, by their nature, public, and because it may be possible for someone to identify you through your pseudonymous, public wallet address using external sources of information, any transaction you enter onto the Blockchain could possibly be used to identify you, or information about you.
ar: ** إشعار بخصوص استخدام بلوكتشين. ** سيتم إجراء المعاملات على الخدمات عبر بلوكتشين. سيتم توفير معلومات حول التحويلات الخاصة بك إلى بلوكتشين وقد تكون في متناول أطراف ثالثة بسبب الطبيعة العامة لـ بلوكتشين. نظرًا لأن الإدخالات إلى بلوكتشين هي ، بطبيعتها ، علنًا ، ولأنه قد يكون من الممكن لشخص ما أن يعرّفك من خلال عنوان محفظة عامة ، فإن أي معاملة تدخلها في الكتلة. يمكن استخدام kchain لتحديد هويتك ، أو معلومات عنك.

source: **Other Users of the Services and Parties You Transact With.** Some of your personal information may be visible to other users of the Services (e.g., information featured on generally accessible parts of your profile; usernames of other Mysten Labs Services users). In addition, to complete transfers via the Services, we will need to share some of your personal information with the party that you are transacting with.
ar: ** المستخدمين الآخرين للخدمات والأطراف التي تتعامل معها. . بالإضافة إلى ذلك ، لإكمال عمليات النقل عبر الخدمات ، سنحتاج إلى مشاركة بعض معلوماتك الشخصية مع الطرف الذي تتعامل معه.

source: **Third Party Websites and Applications.** You may choose to share personal information or interact with third-party websites and/or third-party applications, including, but not limited to, third-party electronic wallet extensions. Once your personal information has been shared with a third-party website or a third-party application, it will also be subject to such third party's privacy policy. We encourage you to closely read each third-party website or third-party application privacy policy before sharing your personal information or otherwise interacting with them. Please note that we do not control, and we are not responsible for the third-party website's or the third-party application's processing of your personal information.
ar: ** مواقع الويب والتطبيقات من الجهات الخارجية. ** يمكنك اختيار مشاركة المعلومات الشخصية أو التفاعل مع مواقع الويب الخاصة بالأطراف الثالثة و/أو تطبيقات الطرف الثالث ، بما في ذلك ، على سبيل المثال لا الحصر ، امتدادات المحفظة الإلكترونية من طرف ثالث. بمجرد مشاركة معلوماتك الشخصية مع موقع إلكتروني من طرف ثالث أو طلب طرف ثالث ، فإنها ستخضع أيضًا لسياسة الخصوصية للطرف الثالث. نحن نشجعك على قراءة كل موقع ويب ثالث أو عن كثب أو سياسة خصوصية طلب الطرف الثالث مشاركة معلوماتك الشخصية أو التفاعل معهم بطريقة أخرى. يرجى ملاحظة أننا لا نتحكم ، ونحن لسنا مسؤولين عن معالجة تطبيق الطرف الثالث أو معالجة طلبك الشخصية لمعلوماتك الشخصية.

source: **Service Providers**. We may share your personal information with our third-party service providers who use that information to help us provide our Services. This includes service providers that provide us with IT support, hosting, customer service, and related services.
ar: ** مقدمي الخدمات **. قد نشارك معلوماتك الشخصية مع مقدمي خدمات الطرف الثالث الذين يستخدمون هذه المعلومات لمساعدتنا في تقديم خدماتنا. ويشمل ذلك مزودي الخدمات الذين يوفرون لنا دعم تكنولوجيا المعلومات والاستضافة وخدمة العملاء والخدمات ذات الصلة.

source: **Business Partners**. We may share your personal information with business partners to provide you with a product or service you have requested. We may also share your personal information to business partners with whom we jointly offer products or services.
ar: ** شركاء الأعمال **. قد نشارك معلوماتك الشخصية مع شركاء الأعمال لتزويدك بمنتج أو خدمة طلبتها. قد نشارك أيضًا معلوماتك الشخصية مع شركاء الأعمال الذين نقدم معهم منتجات أو خدمات مشتركة.

source: **Affiliates**. We may share your personal information with members of our corporate family.
ar: ** الشركات التابعة **. قد نشارك معلوماتك الشخصية مع أفراد أسرتنا في الشركات.

source: **Other Users/Website Visitors**. As described above in "[Personal Information We Collect](#personal-information-we-collect)," our Services allow you to share your profile and/or User Content with other users or publicly, including to those who do not use our Services.
ar: ** المستخدمين الآخرين/زوار موقع الويب **. كما هو موضح أعلاه في "[المعلومات الشخصية التي نجمعها](#personal-information-we-collect),تتيح لك خدماتنا مشاركة ملف التعريف الخاص بك و/أو محتوى المستخدم مع مستخدمين آخرين أو علنًا ، بما في ذلك أولئك الذين لا يستخدموننا خدمات.

source: **Advertising Partners**. We may share your personal information with third-party advertising partners. These third-party advertising partners may set Technologies and other tracking tools on our Services to collect information regarding your activities and your device (e.g., your IP address, cookie identifiers, page(s) visited, location, time of day). These advertising partners may use this information (and similar information collected from other services) for purposes of delivering personalized advertisements to you when you visit digital properties within their networks. This practice is commonly referred to as "interest-based advertising" or "personalized advertising."
ar: ** شركاء الإعلان **. قد نشارك معلوماتك الشخصية مع شركاء الإعلان عن الطرف الثالث. قد يقوم شركاء الإعلان من الطرف الثالث بتعيين تقنيات وأدوات تتبع أخرى على خدماتنا لجمع المعلومات المتعلقة بأنشطتك وجهازك (على سبيل المثال ، عنوان IP الخاص بك ، معرفات ملفات تعريف الارتباط ، الصفحة (الصفحات) التي تمت زيارتها ، الموقع ، الوقت من اليوم). قد يستخدم شركاء الإعلانات هذه المعلومات (والمعلومات المماثلة التي تم جمعها من الخدمات الأخرى) لأغراض تقديم Personaliz إعلانات ED لك عند زيارة الخصائص الرقمية داخل شبكاتها. يشار إلى هذه الممارسة عادة باسم "الإعلان القائم على الفائدة" أو "الإعلانات الشخصية".

source: **APIs/SDKs**. We may use third-party application program interfaces ("**APIs**") and software development kits ("**SDKs**") as part of the functionality of our Services. For more information about our use of APIs and SDKs, please contact us as set forth in "[Contact Us](#contact-us)" below.
ar: **واجهات برمجة التطبيقات/مجموعات تطوير البرامج**. يجوز لنا استخدام واجهات برمجة تطبيقات الطرف الثالث ("**واجهات برمجة التطبيقات**") ومجموعات تطوير البرامج ("**مجموعات تطوير البرامج**") كجزء من وظائف خدماتنا. لمزيد من المعلومات حول استخدامنا لواجهات برمجة التطبيقات ومجموعات تطوير البرامج، يرجى الاتصال بنا كما هو موضح في "[اتصل بنا](#contact-us)" أدناه.

source: B. **Disclosures to Protect Us or Others**
ar: B. ** الإفصاح لحمايتنا أو الآخرين **

source: We may access, preserve, and disclose any information we store associated with you to external parties if we, in good faith, believe doing so is required or appropriate to: comply with law enforcement or national security requests and legal process, such as a court order or subpoena; protect your, our, or others' rights, property, or safety; enforce our policies or contracts; collect amounts owed to us; or assist with an investigation or prosecution of suspected or actual illegal activity.
ar: يجوز لنا الوصول إلى أي معلومات نتواصل معها ، والاحتفاظ بها ، والكشف عنها ، إذا كنا ، بحسن نية ، نؤدي إلى ذلك مطلوب أو مناسبًا: الامتثال لطلبات إنفاذ القانون أو أمنية الأمن القومي والإجراءات القانونية ، مثل المحكمة طلب أو استدعاء ؛ حماية حقوقك أو حقوقنا أو الممتلكات أو السلامة الخاصة بنا ؛ فرض سياساتنا أو عقودنا ؛ جمع المبالغ المستحقة لنا ؛ أو المساعدة في التحقيق أو مقاضاة النشاط غير القانوني المشتبه به أو الفعلي.

source: C. **Disclosure in the Event of Merger, Sale, or Other Asset Transfers**
ar: C. ** الكشف في حالة الاندماج أو البيع أو غيرها من عمليات نقل الأصول **

source: If we are involved in a merger, acquisition, financing due diligence, reorganization, bankruptcy, receivership, purchase or sale of assets, or transition of service to another provider, your information may be sold or transferred as part of such a transaction, as permitted by law and/or contract.
ar: إذا كنا متورطين في عملية اندماج ، أو الاستحواذ ، أو تمويل العناية الواجبة ، أو إعادة التنظيم ، أو الإفلاس ، أو الحراسة القضائية ، أو شراء أو بيع الأصول ، أو انتقال الخدمة إلى مزود آخر ، يمكن بيع معلوماتك أو نقلها كجزء من هذه الصفقة ، كما هو مسموح بها بموجب القانون و/أو العقد.

source: YOUR PRIVACY CHOICES AND RIGHTS
ar: خيارات وحقوق الخصوصية الخاصة بك

source: **Your Privacy Choices**. The privacy choices you may have about your personal information are determined by applicable law and are described below.
ar: ** خيارات الخصوصية الخاصة بك **. يتم تحديد خيارات الخصوصية التي قد تكون لديك حول معلوماتك الشخصية بموجب القانون المعمول به ويتم وصفها أدناه.
