Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: The reader then sends a request to the storage nodes for the shards corresponding to the blob ID and waits for <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.8889em;vertical-align:-0.1944em;"></span><span class="mord mathnormal" style="margin-right:0.10764em;">f</span><span class="mspace" style="margin-right:0.2222em;"></span><span class="mbin">+</span><span class="mspace" style="margin-right:0.2222em;"></span></span><span class="base"><span class="strut" style="height:0.6444em;"></span><span class="mord">1</span></span></span></span> to respond. Sufficient requests are sent in parallel to ensure low latency for reads.
ar: يقوم القارئ بعد ذلك بإرسال طلب إلى عقد التخزين للتشجيعات المقابلة لمعرف كتلة البيانات وينتظر <span class = "katex" "base"> <span class = "strut" style = "height: 0.8889em ؛ align-align: -0.1944em ؛"> </span> <span class = "mord mathnormal" style = "margin-right: 0.10764em ، "style =" الهامش اليمين: 0.2222 ؛ "> </span> </span> <span c lass = "base"> <span class = "strut" style = "الارتفاع: 0.64444 ؛"> </span> <span class = "mord"> 1 </span> </span> </span> </ span> للرد. يتم إرسال الطلبات الكافية بالتوازي لضمان انخفاض الكمون للقراءات.

source: The reader authenticates the slivers returned with the blob ID, reconstructs the blob, and decides whether the contents are a valid blob or inconsistent.
ar: يقوم القارئ بإصدار الشظايا التي يتم إرجاعها بمعرف كتلة البيانات ، ويعيد بناء الكتلة ، ويقرر ما إذا كانت المحتويات عبارة عن كتلة البيانات صالحة أو غير متسقة.

source: Optionally, for a cache, the result is cached and can be served without reconstruction until it is evicted from the cache. Requests for the blob to the cache return the blob contents, or a proof that the blob is inconsistently encoded.
ar: اختياريا ، بالنسبة لذاكرة التخزين المؤقت ، يتم تخزين النتيجة مؤقتًا ويمكن تقديمها دون إعادة الإعمار حتى يتم طردها من ذاكرة التخزين المؤقت. تُرجع طلبات الكتلة إلى ذاكرة التخزين المؤقت محتويات كتلة البيانات ، أو دليل على تشفير الكتلة بشكل غير متسق.

source: Challenge mechanism for storage attestation
ar: آلية التحدي لإثبات التخزين

source: During an epoch, a correct storage node challenges all shards to provide symbols for blob slivers past PoA:
ar: خلال حقبة زمنية معينة، تتحدى عقدة تخزين صحيحة جميع الشظايا لتوفير رموز لشرائح الكتلة التي تتخطى PoA:

source: The list of available blobs for the epoch is determined by the sequence of Sui events up to the past epoch. Inconsistent blobs are not challenged, and a record proving this status can be returned instead.
ar: يتم تحديد قائمة الكتل المتاحة للعصر من خلال تسلسل أحداث Sui حتى العصر الماضي. لا يتم الطعن في الكتل غير المتسقة، ويمكن إرجاع سجل يثبت هذه الحالة بدلاً من ذلك.

source: A challenge sequence is determined by providing a seed to the challenged shard. The sequence is then computed based both on the seed **and** the content of each challenged blob ID. This creates a sequential read dependency.
ar: يتم تحديد تسلسل التحدي من خلال توفير بذرة للشظية التي تم تحديها. ثم يتم حساب التسلسل بناءً على كل من البذرة ومحتوى كل معرف كتلة البيانات تم تحديها. يؤدي هذا إلى إنشاء اعتماد قراءة متسلسل.

source: The response to the challenge provides the sequence of shard contents for the blob IDs in a timely manner.
ar: توفر الاستجابة للتحدي تسلسل محتويات الشظايا لمعرفات الكائن في الوقت المناسب.

source: The challenger node uses thresholds to determine whether the challenge was passed, and reports the result on chain.
ar: تستخدم عقدة التحدي عتبات لتحديد ما إذا كان التحدي قد تم اجتيازه، وتقوم بإبلاغ النتيجة على السلسلة.

source: The challenge/response communication is authenticated.
ar: تم التحقق من صحة اتصال التحدي/الاستجابة.

source: Challenges provide some reassurance that the storage node can actually recover shard data in a probabilistic manner, avoiding storage nodes getting payment without any evidence they might retrieve shard data. The sequential nature of the challenge and some reasonable timeout also ensures that the process is timely.
ar: توفر التحديات بعض الطمأنينة بأن عقدة التخزين يمكنها بالفعل استرداد بيانات الشظايا بطريقة احتمالية، مما يتجنب حصول عقد التخزين على الدفع دون أي دليل على أنها قد تسترد بيانات الشظايا. كما تضمن الطبيعة المتسلسلة للتحدي وبعض مهلة الانتظار المعقولة أن العملية تتم في الوقت المناسب.

source: Walrus assurance and security properties
ar: خصائص التأمين والأمن لـ Walrus

source: The properties below hold true subject to the assumption that for all storage epochs 2/3 of shards are operated by storage nodes that faithfully and correctly follow the Walrus protocol.
ar: تظل الخصائص أدناه صحيحة بشرط أن يكون ثلثا الشظايا في جميع عصور التخزين يتم تشغيلها بواسطة عقد تخزين تتبع بروتوكول Walrus بأمانة ودقة.

source: As described [before](./encoding.md), each blob is encoded into slivers using an erasure code and a blob ID is cryptographically derived. For a given blob ID there is a **point of availability (PoA)** and an **availability period**, observable through an event on the Sui chain.
ar: كما هو موضح [قبل](./encoding.md)، يتم ترميز كل كتلة بيانات إلى قطع صغيرة باستخدام كود مسح ويتم استنباط معرف كتلة البيانات تشفيريًا. بالنسبة لمعرف كتلة معين، هناك **نقطة توفر (PoA)** و**فترة توفر**، يمكن ملاحظتها من خلال حدث على سلسلة Sui.

source: The following properties relate to the PoA:
ar: الخصائص التالية تتعلق بنقطة التوفر (PoA):

source: After the PoA, for a blob ID, any correct user that performs a read within the availability period will eventually terminate and get a value <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.22222em;">V</span></span></span></span> which is either the blob contents <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.13889em;">F</span></span></span></span> or `None`.
ar: بعد نقطة التوفر، بالنسبة لمعرف كتلة البيانات، سيتم في النهاية إنهاء أي مستخدم صحيح يقوم بالقراءة خلال فترة التوفر وسيحصل على القيمة <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.22222em;">V</span></span></span></span> والتي تكون إما محتويات كتلة البيانات <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span></span></span> أو `None`.

source: After the PoA, if two correct users perform a read and get <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.22222em;">V</span></span></span></span> and <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.7519em;"></span><span class="mord"><span class="mord mathnormal" style="margin-right:0.22222em;">V</span><span class="msupsub"><span class="vlist-t"><span class="vlist-r"><span class="vlist" style="height:0.7519em;"><span style="top:-3.063em;margin-right:0.05em;"><span class="pstrut" style="height:2.7em;"></span><span class="sizing reset-size6 size3 mtight"><span class="mord mtight"><span class="mord mtight">′</span></span></span></span></span></span></span></span></span></span></span></span>, respectively, then <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.22222em;">V</span><span class="mspace" style="margin-right:0.2778em;"></span><span class="mrel">=</span><span class="mspace" style="margin-right:0.2778em;"></span></span><span class="base"><span class="strut" style="height:0.7519em;"></span><span class="mord"><span class="mord mathnormal" style="margin-right:0.22222em;">V</span><span class="msupsub"><span class="vlist-t"><span class="vlist-r"><span class="vlist" style="height:0.7519em;"><span style="top:-3.063em;margin-right:0.05em;"><span class="pstrut" style="height:2.7em;"></span><span class="sizing reset-size6 size3 mtight"><span class="mord mtight"><span class="mord mtight">′</span></span></span></span></span></span></span></span></span></span></span></span>.
ar: بعد نقطة التوفر، إذا قام مستخدمان صحيحان بالقراءة وحصلا على <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.22222em;">V</span></span></span></span> و<span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.7519em;"></span><span class="mord"><span class="mord mathnormal" style="margin-right:0.22222em;">V</span><span class="msupsub"><span class="vlist-t"><span class="vlist-r"><span class="vlist" style="height:0.7519em;"><span style="top:-3.063em;margin-right:0.05em;"><span class="pstrut" style="height:2.7em;"></span><span class="sizing reset-size6 size3 mtight"><span class="mord mtight"><span class="mord mtight">′</span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span>، على التوالي، ثم <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.22222em;">V</span><span class="mspace" style="margin-right:0.2778em;"></span><span class="mrel">=</span><span class="mspace" style="margin-right:0.2778em;"></span></span><span class="base"><span class="strut" style="height:0.7519em;"></span><span class="mord"><span class="mord mathnormal" style="margin-right:0.22222em;">V</span><span class="msupsub"><span class="vlist-t"><span class="vlist-r"><span class="vlist" style="height:0.7519em;"><span style="top:-3.063em;margin-right:0.05em;"><span class="pstrut" style="height:2.7em;"></span><span class="sizing reset-size6 size3 mtight"><span class="mord "متوترة"><span class="mord mtight">′</span></span></span></span></span></span></span></span></span></span></span></span></span></span>.

source: A correct user with an appropriate storage resource can always perform store for a blob <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.13889em;">F</span></span></span></span> with a blob ID and advance the protocol until the PoA.
ar: يمكن للمستخدم الصحيح الذي يحتوي على مورد تخزين مناسب دائمًا إجراء متجر لـ كتلة البيانات <span class = "katex"> <span class = "katex-html" aria-hidden = "true"> <span class = "base"> <span class = "strut" style = "الارتفاع: 0.68333 ؛"> </span> <span class = "mord mathnormal" style = "margin-right: 0.13889 ؛ span> </span> مع معرف كتلة البيانات ودفع البروتوكول حتى POA.

source: A read after the PoA for a blob <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.13889em;">F</span></span></span></span> stored by a correct user, will result in <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6833em;"></span><span class="mord mathnormal" style="margin-right:0.13889em;">F</span></span></span></span>.
ar: قراءة بعد poa for a كتلة البيانات <span class = "katex"> <span class = "katex-html" aria-hidden = "true" "الارتفاع: 0.68333 ؛"> </span> <span class = "mord mathnormal" style = "margin-right: 0.13889em ؛ بواسطة مستخدم صحيح ، سوف يؤدي إلى <span class = "katex"> <span class = "katex-html" aria-hidden = "true"> <span class = "base"> <span class = "strut" style = "الارتفاع: 0.68333 ؛"> </span> <span class = "mord mathnormal" style = "margin-right: 0.13889em ؛"> f </ span> </span> </span> </span>.

source: Some assurance properties ensure the correct internal processes of Walrus storage nodes. For the purposes of defining these, an **inconsistency proof** proves that a blob ID was stored by a user that incorrectly encoded a blob.
ar: تضمن بعض خصائص التأكيد العمليات الداخلية الصحيحة لعقد تخزين Walrus. لأغراض تعريفها ، يثبت إثبات ** عدم الاتساق ** أنه تم تخزين معرف كتلة البيانات من قبل مستخدم قام بتشفير كتلة البيانات بشكل غير صحيح.

source: After the PoA and for a blob ID stored by a correct user, a storage node is always able to recover the correct slivers for its shards for this blob ID.
ar: بعد POA ولمعرف كتلة البيانات المخزن من قبل مستخدم صحيح ، تكون عقدة التخزين قادرة دائمًا على استعادة الشظايا الصحيحة لشرائحها لمعرف كتلة البيانات هذا.

source: After the PoA, if a correct storage node cannot recover a sliver, it can produce an inconsistency proof for the blob ID.
ar: بعد POA ، إذا لم تتمكن عقدة التخزين الصحيحة من استعادة القطعة الصغيرة ، فيمكنها إنتاج دليل على عدم الاتساق لمعرف كتلة البيانات.

source: If a blob ID is stored by a correct user, an inconsistently proof cannot be derived for it.
ar: إذا تم تخزين معرف كتلة البيانات بواسطة مستخدم صحيح ، فلا يمكن اشتقاق دليل غير متسق.

source: A read by a correct user for a blob ID for which an inconsistency proof may exist returns `None`.
ar: قراءة من قبل مستخدم صحيح لمعرف كتلة البيانات الذي قد يكون هناك دليل على عدم الاتساق له "لا شيء".

source: Note that there is no delete operation and a blob ID past the PoA will be available for the full availability period.
ar: لاحظ أنه لا توجد عملية حذف وأن معرف كتلة البيانات بعد POA سيكون متاحًا لفترة التوفر الكامل.

source: ```admonish tip title="Rule of thumb" Before the PoA it is the responsibility of a client to ensure the availability of a blob and its upload to Walrus. After the PoA it is the responsibility of Walrus as a system to maintain the availability of the blob as part of its operation for the full availability period remaining. Emission of the event corresponding to the PoA for a blob ID attests its availability. ```
ar: `` `tip title title =" قاعدة الإبهام " قبل POA ، تقع على عاتق العميل ضمان توفر الكتلة و تحميل إلى Walrus. بعد POA ، تقع على عاتق Walrus كنظام الحفاظ على توفر الكتلة كجزء من تشغيلها لفترة التوفر الكامل المتبقية. انبعاث الحدث المقابل لـ POA لمعرف كتلة البيانات يشهد توفره. `` `

source: In this document, we left out details of the following features:
ar: في هذا المستند ، تركنا تفاصيل الميزات التالية:

source: **Shard transfer and recovery upon storage epoch change:** The encoding scheme used in Walrus has been designed to allow for highly efficient recovery in case of shard failures. A storage node attempting to recover slivers only needs to get data of the same magnitude as the missing data to reconstruct them.
ar: ** نقل الشظية واستردادها عند تغيير عصر التخزين: ** تم تصميم مخطط التشفير المستخدم في Walrus للسماح بالشفاء الفعال للغاية في حالة فشل الشظية. تحتاج عقدة التخزين التي تحاول استرداد الشظايا فقط إلى الحصول على بيانات من نفس الحجم مثل البيانات المفقودة لإعادة بنائها.

source: **Details of light clients that can be used to sample availability:** Individual clients may sample the certified blobs from Sui metadata and sample the availability of some slivers that they store. On-chain bounties may be used to retrieve these slivers for missing blobs.
ar: ** تفاصيل العملاء الخفيفين الذين يمكن استخدامهم لعينة التوافر: ** يمكن للعملاء الفرديين أخذ عينات من الكتل المعتمدة من بيانات التعريف SUI وتجربة توافر بعض الشظايا التي يخزنونها. يمكن استخدام المكافآت الموجودة على السلسلة لاسترداد هذه الشظايا للنقاط المفقودة.

source: At this stage of the project, our Walrus code is not yet public. Instead, we provide a pre-compiled `walrus` client binary for macOS (Intel and Apple CPUs) and Ubuntu, which supports different usage patterns (see [the next chapter](./interacting.md)). This chapter describes the [prerequisites](#prerequisites), [installation](#installation), and [configuration](#configuration) of the Walrus client.
ar: في هذه المرحلة من المشروع، لم يتم نشر كود Walrus الخاص بنا بعد. بدلاً من ذلك، نقدم ملف ثنائي لعميل `walrus` مُجمَّع مسبقًا لنظام macOS (معالجات Intel وApple) وUbuntu، والذي يدعم أنماط استخدام مختلفة (انظر [الفصل التالي](./interacting.md)). يصف هذا الفصل [المتطلبات الأساسية](#prerequisites) و[التثبيت](#installation) و[التكوين](#configuration) لعميل Walrus.

source: Prerequisites: Sui wallet and Testnet SUI
ar: المتطلبات الأساسية: على المحفظة و الشبكة التجريبية على

source: ```admonish tip title="Quick wallet setup" If you just want to set up a new SUI wallet for Walrus, you can skip this section and use the `walrus generate-sui-wallet` command after [installing Walrus](#installation). In that case, make sure to set the `wallet_config` parameter in the [Walrus configuration](#advanced-configuration-optional) to the newly generated wallet. ```
ar: ```admonish tip title="إعداد المحفظة السريع" إذا كنت تريد فقط إعداد محفظة SUI جديدة لـ Walrus، يمكنك تخطي هذا القسم واستخدام الأمر `walrus generate-sui-wallet` بعد [تثبيت Walrus](#installation). في هذه الحالة، تأكد من تعيين معلمة `wallet_config` في [Walrus configuration](#advanced-configuration-optional) للمحفظة التي تم إنشاؤها حديثًا. ```

source: Interacting with Walrus requires a valid Sui Testnet wallet with some amount of SUI tokens. The normal way to set this up is via the Sui CLI; see the [installation instructions](https://docs.sui.io/guides/developer/getting-started/sui-install) in the Sui documentation.
ar: يتطلب التفاعل مع Walrus محفظة Sui واختيار الشبكة التجريبية مع بعض عملات Sui. الطريقة العادية لإعداد هذا هو عبر SUI CLI ؛ راجع [تعليمات التثبيت] (https://docs.sui.io/guides/developer/getting-started/sui-install) في وثائق SUI.

source: After installing the Sui CLI, you need to set up a Testnet wallet by running `sui client`, which prompts you to set up a new configuration. Make sure to point it to Sui Testnet, you can use the full node at `https://fullnode.testnet.sui.io:443` for this. See [here](https://docs.sui.io/guides/developer/getting-started/connect) for further details.
ar: بعد تثبيت Sui CLI، تحتاج إلى إعداد محفظة الشبكة التجريبية من خلال تشغيل `sui client`، الذي يطالبك بإعداد تكوين جديد. تأكد من توجيهه إلى شبكة Sui التجريبية ، يمكنك استخدام العقدة الكاملة على `https://fullnode.testnet.sui.io:443` لهذا الغرض. راجع [هنا](https://docs.sui.io/guides/developer/getting-started/connect) لمزيد من التفاصيل.

source: If you already have a Sui wallet configured, you can directly set up the Testnet environment (if you don't have it yet),
ar: إذا كان لديك بالفعل محفظة Sui مُهيأة، فيمكنك إعداد بيئة الشبكة التجريبية مباشرةً (إذا لم تكن لديك بعد)،

source: and switch the active environment to it:
ar: وتبديل البيئة النشطة إليها:

source: After this, you should get something like this (everything besides the `testnet` line is optional):
ar: بعد ذلك، يجب أن تحصل على شيء مثل هذا (كل شيء باستثناء سطر `الشبكة التجريبية` اختياري):

source: ```terminal $ sui client envs ╭──────────┬─────────────────────────────────────┬────────╮ │ alias │ url │ active │ ├──────────┼─────────────────────────────────────┼────────┤ │ devnet │ https://fullnode.devnet.sui.io:443 │ │ │ localnet │ http://127.0.0.1:9000 │ │ │ testnet │ https://fullnode.testnet.sui.io:443 │ * │ │ mainnet │ https://fullnode.mainnet.sui.io:443 │ │ ╰──────────┴─────────────────────────────────────┴────────╯ ```
ar: ```terminal $ sui client envs ╭───────────┬─ ... ─────────╮ │ الاسم المستعار │ عنوان URL │ نشط │ ├──────────┼─────────────── ──────────────────┼────────┤ │ شبكة المطور │ https://fullnode.devnet.sui.io:443 │ │ │ الشبكة المحلية │ http://127.0.0.1:9000 │ │ │ الشبكة التجريبية │ https://fullnode.testnet.sui.io:443 │ * │ │ الشبكة الرئيسية │ https://fullnode.mainnet.sui.io:443 │ │ ╰──────────┴───────────────── ──────────────────┴────────╯ ```

source: Finally, make sure you have at least one gas coin with at least 1 SUI. You can obtain one from the Testnet faucet:
ar: أخيرًا ، تأكد من أن لديك عملة غاز واحدة على الأقل مع 1 SUI. يمكنك الحصول على عملة من صنبور الشبكة التجريبية:

source: After some seconds, you should see your new SUI coins:
ar: بعد بضع ثوان ، يجب أن ترى عملات Sui الجديدة:

source: The system-wide wallet will be used by Walrus if no other path is specified. If you want to use a different Sui wallet, you can specify this in the [Walrus configuration file](#configuration) or when [running the CLI](./interacting.md).
ar: سيتم استخدام المحفظة على مستوى النظام بواسطة Walrus إذا لم يتم تحديد أي مسار آخر. إذا كنت تريد استخدام محفظة Sui مختلفة، يمكنك تحديد ذلك في [ملف تكوين Walrus](#configuration) أو عند [تشغيل CLI](./interacting.md).

source: Installation
ar: تثبيت

source: We currently provide the `walrus` client binary for macOS (Intel and Apple CPUs), Ubuntu, and Windows:
ar: نحن نقدم حاليًا "عميل Walrus` العميل" لـ MacOS (Intel و Apple Cpus) و Ubuntu و ويندوز:

source: OS
ar: نظام التشغيل

source: CPU
ar: وحدة المعالجة المركزية

source: Ubuntu
ar: أوبونتو

source: Intel 64bit
ar: إنتل 64 بت

source: [`ubuntu-x86_64`](https://storage.googleapis.com/mysten-walrus-binaries/walrus-testnet-latest-ubuntu-x86_64)
ar: [`أوبونتو-x86_64`](https://storage.googleapis.com/mysten-walrus-binaries/شبكة-اختبار-أوبونتو-x86_64-الأحدث)

source: Intel 64bit (generic)
ar: Intel 64bit (عام)

source: [`ubuntu-x86_64-generic`](https://storage.googleapis.com/mysten-walrus-binaries/walrus-testnet-latest-ubuntu-x86_64-generic)
ar: [`أوبونتو-x86_64-عام`](https://storage.googleapis.com/mysten-walrus-binaries/walrus-testnet-latest-ubuntu-x86_64-generic)

source: MacOS
ar: ماكوس

source: Apple Silicon
ar: آبل سيليكون

source: Windows
ar: ويندوز

source: ```admonish title="Windows" We now offer a pre-built binary also for Windows. However, most of the remaining instructions assume a UNIX-based system for the directory structure, commands, etc. If you use Windows, you may need to adapt most of those. ```
ar: `` `exmonish title =" windows " نحن نقدم الآن ملفًا ثنائيًا تم بناؤه مسبقًا أيضًا لنظام ويندوز. ومع ذلك ، تفترض معظم التعليمات المتبقية نظام قائم على UNIX لهيكل الدليل والأوامر وما إلى ذلك إذا كنت تستخدم ويندوز ، فقد تحتاج إلى ذلك تكييف معظم هؤلاء. `` `

source: You can download the latest build from our Google Cloud Storage (GCS) bucket (correctly setting the `$SYSTEM` variable):
ar: يمكنك تنزيل أحدث البناء من دلو Google Cloud Storage (GCS) (تعيين متغير `$ system` بشكل صحيح):

source: # set this to your system: ubuntu-x86_64, ubuntu-x86_64-generic, macos-x86_64, macos-arm64, windows-x86_64.exe
ar: # قم بتعيين هذا على نظامك: Ubuntu-X86_64 ، Ubuntu-X86_64-Generic ، MacOS-X86_64 ، MacOS-ARM64 ، ويندوز-X86_64.exe

source: On Ubuntu, you should generally use the `ubuntu-x86_64` version. However, this is incompatible with old hardware and certain virtualized environments (throwing an "Illegal instruction (core dumped)" error); in these cases you can use the `ubuntu-x86_64-generic` version.
ar: على Ubuntu ، يجب عليك عمومًا استخدام إصدار "Ubuntu-X86_64". ومع ذلك ، فإن هذا لا يتوافق مع الأجهزة القديمة وبعض البيئات الافتراضية (رمي "تعليمات غير قانونية (ملقاة)") ؛ في هذه الحالات ، يمكنك استخدام إصدار `ubuntu-x86_64-generic’.

source: To be able to run it simply as `walrus`, move the binary to any directory included in your `$PATH` environment variable. Standard locations are `/usr/local/bin/`, `$HOME/bin/`, or `$HOME/.local/bin/`.
ar: لتكون قادرًا على تشغيلها ببساطة كـ "Walrus" ، نقل الثنائي إلى أي دليل مدرج في متغير بيئة "مسار $" الخاص بك. المواقع القياسية هي `/usr/local/bin/` أو `$ home/bin/` أو `$ home/.local/bin/`.
