Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: If you have any questions about our privacy practices or this Privacy Policy, or to exercise your rights as detailed in this Privacy Policy, please contact us at:
ar: إذا كانت لديك أي أسئلة حول ممارسات الخصوصية الخاصة بنا أو سياسة الخصوصية هذه ، أو لممارسة حقوقك على النحو المفصل في سياسة الخصوصية هذه ، فيرجى الاتصال بنا على:

source: Mysten Labs, Inc. Attn: Privacy Group 379 University Ave, #200 Palo Alto, CA 94301 [privacy@mystenlabs.com](mailto:privacy@mystenlabs.com) +1 (408) 384-8237
ar: Mysten Labs ، Inc. ATTN: مجموعة الخصوصية 379 University Ave ، #200 بالو ألتو ، كاليفورنيا 94301 [privacy@mystenlabs.com] (mailto: privacy@mystenlabs.com) +1 (408) 384-8237
