Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: IMPORTANT NOTICE REGARDING ARBITRATION FOR U.S. CUSTOMERS: WHEN YOU AGREE TO THESE TERMS YOU ARE AGREEING (WITH LIMITED EXCEPTION) TO RESOLVE ANY DISPUTE BETWEEN YOU AND MYSTEN LABS THROUGH BINDING, INDIVIDUAL ARBITRATION RATHER THAN IN COURT. PLEASE REVIEW CAREFULLY SECTION XIV “DISPUTE RESOLUTION” BELOW FOR DETAILS REGARDING ARBITRATION.
ar: إشعار مهم فيما يتعلق بالتحكيم للعملاء الأمريكيين: عندما توافق على هذه الشروط ، فإنك توافق (باستثناء محدود) على حل أي نزاع بينك وبين Mysten Labs من خلال التحكيم الفردي الملزم بدلاً من المحكمة. يرجى مراجعة القسم الرابع عشر بعناية "حل النزاعات" أدناه للحصول على تفاصيل بشأن التحكيم.

source: I. Privacy Policy
ar: 1. سياسة الخصوصية

source: Please review our [Privacy Policy](../legal/privacy.md), which also governs your use of the Services, for information on how we collect, use and share your information. By using the Services you agree to be bound by our Privacy Policy.
ar: يرجى مراجعة [سياسة الخصوصية] (../legal/privacy.md)، التي تحكم أيضًا استخدامك للخدمات، للحصول على معلومات حول كيفية جمع معلوماتك واستخدامها ومشاركتها. باستخدام الخدمات، فإنك توافق على الالتزام بسياسة الخصوصية الخاصة بنا.

source: II. Eligibility
ar: الثاني. الأهلية

source: You may use the Services only if you are 18 years or older and capable of forming a binding contract with Mysten Labs, and not otherwise barred from using the Services under applicable law, including applicable U.S. and non-U.S. export control and trade sanctions laws.
ar: لا يجوز لك استخدام الخدمات إلا إذا كنت تبلغ من العمر 18 عامًا أو أكبر وقادرة على تكوين عقد ملزم مع Mysten Labs ، ولا تمنع من استخدام الخدمات بموجب القانون المعمول به ، بما في ذلك قوانين مراقبة التصدير والتصدير في الولايات المتحدة.

source: III. Walrus Sites
ar: ثالثا. مواقع Walrus

source: The Services allow you access website resources (“**Stored Objects**”) that are stored in the Walrus Store and linked by the Sui blockchain. In providing the Services, Mysten Labs provides you with a means to access the Stored Objects, but Mysten Labs does not process the Stored Objects directly. Mysten Labs has no responsibility to screen or moderate Stored Objects accessible via the Services. Stored Objects are developed by people over whom Mysten Labs exercises no control. The Services may provide you with access to Stored Objects that some people find objectionable, inappropriate, or offensive. We assume no responsibility for the content of Stored Objects accessed through the Services.
ar: تتيح لك الخدمات الوصول إلى موارد موقع الويب ("** كتلةات مخزنة **") التي يتم تخزينها في متجر Walrus وربطها Sui بلوكتشين. في توفير الخدمات ، توفر لك Mysten Labs وسيلة للوصول إلى الكائنات المخزنة ، لكن Mysten Labs لا تعالج الكائنات المخزنة مباشرة. لا تتحمل Mysten Labs مسؤولية الشاشة أو الكائنات المخزنة المعتدلة التي يمكن الوصول إليها عبر الخدمات. يتم تطوير الأشياء المخزنة من قبل الأشخاص الذين يمارس Mysten Labs أي سيطرة. قد الخدمات العلاقات العامة OVIDE مع إمكانية الوصول إلى الأشياء المخزنة التي يجدها بعض الأشخاص مرفوضين أو غير لائقين أو مسيئين. نحن نتحمل أي مسؤولية عن محتوى الكائنات المخزنة التي يتم الوصول إليها من خلال الخدمات.

source: IV. Service Conditions and Disclaimers
ar: رابعا. شروط الخدمة وإخلاء المسئولية

source: <u>Fees</u>. We may charge fees for some or part of the Services we make available to you. We reserve the right to change those fees at any time, in our sole and absolute discretion.
ar: <u> الرسوم </u>. قد نقوم بفرض رسوم على بعض أو جزء من الخدمات التي نقدمها لك. نحن نحتفظ بالحق في تغيير هذه الرسوم في أي وقت ، وفقًا لتقديرنا المطلق.

source: <u>Acknowledgment of Certain Risks; Disclaimers</u>. Mysten Labs disclaims any and all responsibility or liability for the accuracy, content, completeness, legality, reliability, or operability or availability of information or material accessed via the Services. Mysten Labs disclaims any responsibility for the deletion, failure to store, misdelivery, or untimely delivery of any information or material. Mysten Labs disclaims any responsibility for any harm resulting from accessing any information or material on any blockchain through the Services. YOU UNDERSTAND AND AGREE THAT YOU DOWNLOAD OR OTHERWISE OBTAIN MATERIAL OR DATA THROUGH THE USE OF THE SERVICES AT YOUR OWN DISCRETION AND RISK AND THAT YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGES TO YOUR COMPUTER SYSTEM OR LOSS OF DATA THAT RESULTS IN THE DOWNLOAD OF SUCH MATERIAL OR DATA.
ar: <u> شكر وتقدير بعض المخاطر ؛ إخلاء المسئولية </u>. تتنصل Mysten Labs من أي وجميع المسؤولية أو المسؤولية عن دقة أو محتوى أو اكتمال أو شرعية أو موثوقية أو قابلية التشغيل أو توافر المعلومات أو المواد التي يتم الوصول إليها عبر الخدمات. تتخلى Mysten Labs عن أي مسؤولية عن الحذف ، أو الفشل في تخزين أو تسليم الخاطئ أو تسليم أي معلومات أو مواد. تتخلى Mysten Labs عن أي مسؤولية عن أي ضرر ناتج عن الوصول إلى أي معلومات N أو المواد على أي بلوكتشين من خلال الخدمات. أنت تفهم وتوافق على أنك تقوم بتنزيل أو الحصول على مواد أو بيانات أخرى من خلال استخدام الخدمات وفقًا لتقديرك ومخاطرك وأنك ستكون مسؤولاً فقط عن أي أضرار لنظام الكمبيوتر الخاص بك أو فقدان البيانات التي تؤدي إلى تنزيل مثل هذا المواد أو البيانات.

source: The Services could be impacted by one or more regulatory inquiries or regulatory actions, which could impede or limit the ability of Mysten Labs to continue to make its proprietary software, and thus, could impede or limit your ability to continue to use the Services.
ar: يمكن أن تتأثر الخدمات بواحد أو أكثر من الاستفسارات التنظيمية أو الإجراءات التنظيمية ، والتي يمكن أن تعوق أو تحد من قدرة Mysten Labs على الاستمرار في جعل برامجها الملكية ، وبالتالي ، يمكن أن تعوق أو تحد من قدرتك على الاستمرار في استخدام الخدمات.

source: You understand that the Walrus Store and Sui blockchain (and all other networks with which the Services may be compatible) remain under development, which creates technological and security risks when using the Services in addition to uncertainty relating to Digital Assets and transactions therein. You acknowledge that the cost of transacting on the Sui blockchain is variable and may increase at any time, thereby impacting any activities taking place on the Sui blockchain, which may result in price fluctuations or increased prices for using the Services.
ar: أنت تفهم أن متجر Walrus و Sui بلوكتشين (وجميع الشبكات الأخرى التي قد تكون بها الخدمات متوافقة) قيد التطوير ، مما يخلق مخاطر تكنولوجية وأمنية عند استخدام الخدمات بالإضافة إلى عدم اليقين المتعلقة بالأصول الرقمية والمعاملات الموجودة فيها. أنت تقر بأن تكلفة المعالجة على sui بلوكتشين متغيرة وقد تزيد في أي وقت ، مما يؤثر على أي أنشطة تحدث على sui بلوكتشين ، مما قد يؤدي إلى العلاقات العامة تقلبات الجليد أو زيادة الأسعار لاستخدام الخدمات.

source: The Services are provided to you "as-is" and "with all faults." We make no warranties or representations regarding the functionality, quality, or fitness for a particular purpose of the Services. By using the Services, you acknowledge and agree to the following:
ar: يتم تقديم الخدمات لك "كما هو" و "مع كل الأخطاء". لا نقدم أي ضمانات أو تمثيلات فيما يتعلق بوظائف أو جودة أو اللياقة لغرض معين من الخدمات. باستخدام الخدمات ، فإنك تقر وتوافق على ما يلي:

source: Mysten Labs disclaims all warranties, whether express, implied, or statutory, including but not limited to any warranties of merchantability, non-infringement, and fitness for a particular purpose.
ar: تتنصل Mysten Labs من جميع الضمانات ، سواء كانت صريحة أو ضمنية أو قانونية ، بما في ذلك على سبيل المثال لا الحصر ، أي ضمانات من القابلية للتسويق ، وعدم التعبير ، واللياقة لغرض معين.

source: Mysten Labs does not guarantee that the Services will be free from errors, bugs, or interruptions in service, including failed transactions for which you have paid associated gas fees. Any use of the Services is at your own risk.
ar: لا تضمن Mysten Labs أن تكون الخدمات خالية من الأخطاء أو الأخطاء أو الانقطاعات في الخدمة ، بما في ذلك المعاملات الفاشلة التي دفعت لها رسوم الغاز المرتبطة بها. أي استخدام للخدمات على مسؤوليتك الخاصة.

source: Mysten Labs shall not be liable for any direct, indirect, incidental, special, or consequential damages, whether arising from the use of the Services or any inability to use the Services, even if Mysten Labs has been advised of the possibility of such damages.
ar: لن تكون Mysten Labs مسؤولة عن أي أضرار مباشرة أو غير مباشرة أو عرضية أو خاصة أو تبعية ، سواء كانت ناشئة عن استخدام الخدمات أو أي عدم القدرة على استخدام الخدمات ، حتى لو تم إخطار Mysten Labs بإمكانية حدوث هذه الأضرار.

source: It is your responsibility to evaluate the accuracy, completeness, and usefulness of any information, content, or data provided by the Services.
ar: تقع على عاتقك مسؤولية تقييم دقة أي معلومات أو محتوى أو بيانات أو بيانات مقدمة من الخدمات.

source: Mysten Labs is under no obligation to provide support, maintenance, updates, or fixes for the Services.
ar: لا يلتزم Mysten Labs بتوفير الدعم أو الصيانة أو التحديثات أو الإصلاحات للخدمات.

source: Mysten Labs is not obligated to correct or address any errors, defects, or issues identified in the Services.
ar: Mysten Labs غير ملزم بتصحيح أو معالجة أي أخطاء أو عيوب أو مشكلات محددة في الخدمات.

source: Mysten Labs may change, update, or discontinue the Services at any time without notice.
ar: يجوز لـ Mysten Labs تغيير الخدمات أو تحديثها أو توقفها في أي وقت دون إشعار.

source: Your use of the Services indicates your acceptance of the risk associated with its use.
ar: يشير استخدامك للخدمات إلى قبولك للمخاطر المرتبطة باستخدامه.

source: V. Ownership
ar: خامسا الملكية

source: We grant you a limited, non-exclusive, revocable, non-transferable, non-sublicensable license to use the Services, only as authorized in these Terms. We reserve all rights not expressly granted to you in these Terms. The Services are protected by copyright, trademark, patent, and other laws of the United States and other countries. We own all rights, title, interest in and to the Services and all copies of the Services. These Terms do not grant you any rights to our trademarks or service marks.
ar: نمنحك ترخيصًا محدودًا ، غير حصري ، قابل للإلغاء ، غير قابل للتحويل ، غير قابل للتجزئة لاستخدام الخدمات ، فقط كما هو معتمد في هذه الشروط. نحن نحتفظ بجميع الحقوق التي لم تمنح لك صراحة في هذه الشروط. يتم حماية الخدمات من قبل حقوق الطبع والنشر والعلامات التجارية والبراءات وقوانين أخرى للولايات المتحدة ودول أخرى. نحن نمتلك جميع الحقوق والعنوان والاهتمام بالخدمات وجميع نسخ الخدمات. لا تمنحك هذه الشروط أي حقوق لعلاماتنا التجارية أو علامات الخدمة.

source: You may submit feedback, comments, or ideas about the Services (“**Ideas**”). Submitting Ideas is entirely voluntary, and we will be free to use such Ideas as we see fit and without any obligation to you.
ar: يمكنك تقديم ملاحظات أو تعليقات أو أفكار حول الخدمات ("** الأفكار **"). يعد تقديم الأفكار طوعية تمامًا ، وسنكون حراً في استخدام الأفكار التي نراها مناسبة ودون أي التزام تجاهك.

source: VI. General Prohibitions and Mysten Labs’s Enforcement Rights.
ar: السادس. المحظورات العامة وحقوق إنفاذ Mysten Labs.

source: You agree not to do any of the following:
ar: أنت توافق على عدم القيام بأي مما يلي:

source: Use, display, mirror or frame the Services or any individual element within the Services, Mysten Labs’s name, any Mysten Labs trademark, logo or other proprietary information, or the layout and design of any page or form contained on a page, without Mysten Labs’s express written consent;
ar: استخدام أو عرض أو عكس أو تأطير الخدمات أو أي عنصر فردي داخل الخدمات ، أو اسم Mysten Labs ، أو أي علامة تجارية Mysten Labs ، أو شعار أو معلومات خاصة أخرى ، أو تخطيط وتصميم أي صفحة أو نموذج موجود على صفحة ، بدون Mysten Labs صريح موافقة كتابية ؛

source: Access, tamper with, or use non-public areas of the Services, Mysten Labs’s computer systems, or the technical delivery systems of Mysten Labs’s providers;
ar: الوصول أو العبث مع أو استخدام المناطق غير العامة للخدمات أو أنظمة كمبيوتر Mysten Labs ، أو أنظمة التوصيل الفني لمقدمي Mysten Labs ؛

source: Attempt to probe, scan or test the vulnerability of any Mysten Labs system or network or breach any security or authentication measures;
ar: محاولة التحقيق أو مسح أو اختبار ضعف أي نظام Mysten Labs أو شبكة أو خرق أي تدابير أمان أو مصادقة ؛

source: Avoid, bypass, remove, deactivate, impair, descramble or otherwise circumvent any technological measure implemented by Mysten Labs or any of Mysten Labs’s providers or any other third party (including another user) to protect the Services;
ar: تجنب أو الالتفاف أو إزالة أو إلغاء تنشيط أو إضعاف أو تجاهل أو التحايل على أي مقياس تكنولوجي تنفذه Mysten Labs أو أي من مزودي Mysten Labs أو أي طرف ثالث آخر (بما في ذلك مستخدم آخر) لحماية الخدمات ؛

source: Attempt to access or search the Services or download content from the Services using any engine, software, tool, agent, device or mechanism (including spiders, robots, crawlers, data mining tools or the like) other than the software and/or search agents provided by Mysten Labs or other generally available third-party web browsers;
ar: حاول الوصول إلى الخدمات أو البحث عن المحتوى أو تنزيل المحتوى من الخدمات باستخدام أي محرك أو برنامج أو أداة أو وكيل أو جهاز أو آلية (بما في ذلك العناكب أو الروبوتات أو الزحف أو أدوات تعدين البيانات أو ما شابه) بخلاف البرنامج و/أو وكلاء البحث توفرها Mysten Labs أو غيرها من متصفحات الويب الخاصة بجهات خارجية متوفرة بشكل عام ؛

source: Send any unsolicited or unauthorized advertising, promotional materials, email, junk mail, spam, chain letters or other form of solicitation;
ar: أرسل أي إعلانات غير مرغوب فيها أو غير مصرح بها ، مواد ترويجية ، بريد إلكتروني ، بريد غير مرغوب فيه ، بريد غيرجة ، رسائل السلسلة أو أي شكل آخر من أشكال التماس ؛

source: Use any meta tags or other hidden text or metadata utilizing a Mysten Labs trademark, logo URL or product name without Mysten Labs’s express written consent;
ar: استخدم أي علامات meta أو نصًا آخر خفيًا أو بيانات تعريف باستخدام علامة تجارية Mysten Labs أو عنوان URL أو اسم المنتج بدون موافقة كتابية صريحة لـ Mysten Labs ؛

source: Use the Services, or any portion thereof, for any commercial purpose or for the benefit of any third party or in any manner not permitted by these Terms;
ar: استخدم الخدمات ، أو أي جزء منها ، لأي غرض تجاري أو لصالح أي طرف ثالث أو بأي طريقة لا تسمح بها هذه الشروط ؛

source: Forge any TCP/IP packet header or any part of the header information in any email or newsgroup posting, or in any way use the Services to send altered, deceptive or false source-identifying information;
ar: قم بتخزين أي رأس حزمة TCP/IP أو أي جزء من معلومات الرأس في أي بريد إلكتروني أو مجموعة أخبار ، أو بأي حال من الأحوال ، استخدم الخدمات لإرسال معلومات محددة أو خادع أو تحديد المصدر ؛

source: Attempt to decipher, decompile, disassemble or reverse engineer any of the software used to provide the Services;
ar: محاولة فك تشفير أو تفكيك أو تفكيك أو عكس هندسة أي من البرامج المستخدمة لتوفير الخدمات ؛

source: Interfere with, or attempt to interfere with, the access of any user, host or network, including, without limitation, sending a virus, overloading, flooding, spamming, or mail-bombing the Services;
ar: تتداخل مع أو محاولة التدخل في الوصول إلى أي مستخدم أو مضيف أو شبكة ، بما في ذلك ، على سبيل المثال لا الحصر ، إرسال فيروس أو التحميل الزائد أو الفيضانات أو البريد العشوائي أو القمع عبر البريد ؛

source: Collect or store any personally identifiable information from the Services from other users of the Services without their express permission;
ar: جمع أو تخزين أي معلومات تعريف شخصية من الخدمات من مستخدمين آخرين للخدمات دون إذن صريح ؛

source: Impersonate or misrepresent your affiliation with any person or entity;
ar: انتحال شخصية أو تحريف انتمارك إلى أي شخص أو كيان ؛

source: Violate any applicable law or regulation; or
ar: انتهاك أي قانون أو لائحة سارية ؛ أو

source: Encourage or enable any other individual to do any of the foregoing. Mysten Labs is not obligated to monitor access to or use of the Services or to review or edit any content. However, we have the right to do so for the purpose of operating the Services, to ensure compliance with these Terms and to comply with applicable law or other legal requirements. We reserve the right, but are not obligated, to remove or disable access to any content, at any time and without notice, including, but not limited to, if we, at our sole discretion, consider it objectionable or in violation of these Terms.
ar: تشجيع أو تمكين أي فرد آخر من القيام بأي مما تقدم. لا يلزم Mysten Labs مراقبة الوصول إلى الخدمات أو استخدامها أو مراجعة أو تحرير أي محتوى. ومع ذلك ، لدينا الحق في القيام بذلك لغرض تشغيل الخدمات ، وضمان الامتثال لهذه الشروط والامتثال للقانون المعمول به أو المتطلبات القانونية الأخرى. نحن نحتفظ بالحق ، لكننا غير ملتزمون ، بإزالة أو تعطيل الوصول إلى أي محتوى ، في أي وقت ودون إشعار ، بما في ذلك ، ولكن ليس ليمي TED ، إذا كنا ، وفقًا لتقديرنا الخاص ، نعتبره مرفوضًا أو في انتهاك لهذه المصطلحات.

source: We have the right to investigate violations of these Terms or conduct that affects the Services. We may also consult and cooperate with law enforcement authorities to prosecute users who violate the law.
ar: لدينا الحق في التحقيق في انتهاكات هذه الشروط أو السلوك الذي يؤثر على الخدمات. يجوز لنا أيضًا استشارة ونتعاون مع سلطات إنفاذ القانون لمحاكمة المستخدمين الذين ينتهكون القانون.

source: VII. DMCA/Copyright Policy
ar: 7. سياسة حقوق الطبع والنشر/قانون الألفية الرقمية

source: Mysten Labs respects copyright law and expects its users to do the same. It is Mysten Labs’ policy to terminate in appropriate circumstances users who repeatedly infringe or are believed to be repeatedly infringing the rights of copyright holders.
ar: تحترم Mysten Labs قانون حقوق الطبع والنشر ويتوقع من مستخدميها أن يفعلوا الشيء نفسه. إنها سياسة Mysten Labs هي إنهاء المستخدمين في الظروف المناسبة الذين ينتهكون مرارًا وتكرارًا أو يعتقدون أنهم ينتهكون حقوق أصحاب حقوق الطبع والنشر مرارًا وتكرارًا.

source: VIII. Sanctions
ar: الثامن. العقوبات

source: Without limiting the foregoing, you may not download or use the Services if (i) you are in, under the control of, or a national or resident of Cuba, Iran, North Korea, Syria or any other country subject to United States embargo, or if you are on the U.S. Treasury Department's Specially Designated Nationals List or the U.S. Commerce Department's Denied Persons List, Unverified List, or Entity List; or (ii) you intend to supply any Services to Cuba, Iran, North Korea, Sudan or Syria or any other country subject to United States embargo (or a national or resident of one of these countries), or to a person on the Specially Designated Nationals List, Denied Persons List, Unverified List, or Entity List.
ar: دون الحد من ما سبق ، لا يجوز لك تنزيل الخدمات أو استخدامها إذا كنت (1) (I) ، تحت سيطرة أو وطني أو مقيم في كوبا أو إيران أو كوريا الشمالية أو سوريا أو أي دولة أخرى تخضع للولايات المتحدة ، أو إذا كنت في قائمة مواطني وزارة الخزانة الأمريكية المعينة خصيصًا أو قائمة الأشخاص الذين تم رفضهم في وزارة التجارة الأمريكية أو قائمة القائمة غير المحددة أو الكيانات ؛ أو (2) تنوي تقديم أي خدمات إلى كوبا أو إيران أو كوريا الشمالية أو السودان أو سوريا أو أي ج. يخضع Ountry مع حظر الولايات المتحدة (أو مواطن أو مقيم في أحد هذه البلدان) ، أو إلى شخص في قائمة المواطنين المعينين خصيصًا أو قائمة الأشخاص الذين تم رفضهم أو قائمة القائمة أو الكيانات.

source: IX. Termination
ar: التاسع. إنهاء

source: We may suspend or terminate your access to and use of the Services, including suspending access to or terminating your account, at our sole discretion, at any time and without notice to you. You may cancel your account, if you have one, at any time by removing the Wallet web browser extension and ceasing any and all use of the Services. Upon any termination, discontinuation or cancellation of the Services or your account, the following Sections will survive: VIII and IX- XV
ar: يجوز لنا تعليق أو إنهاء وصولك إلى الخدمات واستخدامها ، بما في ذلك تعليق الوصول إلى حسابك أو إنهاءه ، وفقًا لتقديرنا الخاص ، في أي وقت ودون إشعار لك. يمكنك إلغاء حسابك ، إذا كان لديك حساب ، في أي وقت عن طريق إزالة امتداد متصفح الويب Wallet وتوقف أي استخدام للخدمات. عند أي إنهاء أو إيقاف أو إلغاء الخدمات أو حسابك ، ستبقى الأقسام التالية: الثامن والتاسعة السادس عشر

source: X. Warranty Disclaimers
ar: العاشر. ضمان إخلاء المسئولية

source: THE SERVICES ARE PROVIDED “AS IS,” WITHOUT WARRANTY OF ANY KIND. WITHOUT LIMITING THE FOREGOING, WE EXPLICITLY DISCLAIM ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT AND NON-INFRINGEMENT, AND ANY WARRANTIES ARISING OUT OF COURSE OF DEALING OR USAGE OF TRADE. We make no warranty that the Services will meet your requirements, will function as intended, will be free from bugs or errors, or be available on an uninterrupted, secure, or error-free basis. We make no warranty regarding the quality, accuracy, timeliness, truthfulness, completeness or reliability of any information or content on the Services. We may modify or terminate the Services at any time, with or without notice to you.
ar: يتم تقديم الخدمات "كما هي" دون ضمان من أي نوع. دون الحد من ما سبق ، فإننا نتنازل صراحة عن أي ضمانات ضمنية ضمنية للتسويق ، والملاءمة لغرض معين ، والتمتع الهادئ وعدم التعبير ، وأي ضمانات تنشأ بالطبع من التعامل أو استخدام التجارة. لا نقدم أي ضمان بأن الخدمات ستلبي متطلباتك أو ستعمل على النحو المقصود أو ستكون خالية من الأخطاء أو الأخطاء ، أو تكون متاحة على أساس دون انقطاع أو آمن أو خالٍ من الأخطاء. لا نقدم أي ضمان فيما يتعلق بجودة أو دقة أو توقيت أو صدق أو اكتمال أو موثوقية أي معلومات أو محتوى على الخدمات. يجوز لنا تعديل أو إنهاء الخدمات في أي وقت ، مع أو بدون إشعار لك.

source: XI. Indemnity
ar: الحادي عشر. التعويض

source: You will indemnify and hold Mysten Labs and its officers, directors, employees and agents, harmless from and against any claims, disputes, demands, liabilities, damages, losses, and costs and expenses, including, without limitation, reasonable legal and accounting fees arising out of or in any way connected with (a) your access to or use of the Services, (b) your User Content, or (c) your violation of these Terms.
ar: ستقوم بتعويض معامل Mysten ومسؤولينها ومديريها وموظفيها ووكلاءها ، غير ضار من أي مطالبات ، ومواجهة ، ومتطلبات ، وخصوم ، والأضرار ، والخسائر ، والتكاليف والنفقات ، بما في ذلك ، دون قيود ، رسوم قانونية ومحاسبة معقولة. خارج أو بأي طريقة مرتبطة بـ (أ) وصولك إلى الخدمات أو استخدامها ، (ب) محتوى المستخدم الخاص بك ، أو (ج) انتهاكك لهذه المصطلحات.

source: XII. Limitation of Liability
ar: الثاني عشر. الحد من المسؤولية

source: TO THE MAXIMUM EXTENT PERMITTED BY LAW, NEITHER MYSTEN LABS NOR ITS SERVICE PROVIDERS INVOLVED IN CREATING, PRODUCING, OR DELIVERING THE SERVICES WILL BE LIABLE FOR ANY INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES, OR DAMAGES FOR LOST PROFITS, LOST REVENUES, LOST SAVINGS, LOST BUSINESS OPPORTUNITY, LOSS OF DATA OR GOODWILL, SERVICE INTERRUPTION, COMPUTER DAMAGE OR SYSTEM FAILURE OR THE COST OF SUBSTITUTE SERVICES OF ANY KIND ARISING OUT OF OR IN CONNECTION WITH THESE TERMS OR FROM THE USE OF OR INABILITY TO USE THE SERVICES, WHETHER BASED ON WARRANTY, CONTRACT, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR ANY OTHER LEGAL THEORY, AND WHETHER OR NOT MYSTEN LABS OR ITS SERVICE PROVIDERS HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGE, EVEN IF A LIMITED REMEDY SET FORTH HEREIN IS FOUND TO HAVE FAILED OF ITS ESSENTIAL PURPOSE.
ar: إلى أقصى حد يسمح به القانون ، لن يكون Mysten Labs ولا مقدمي الخدمات المشاركين في إنشاء أو إنتاج أو تقديم الخدمات مسؤولة عن أي أضرار عرضية أو خاصة أو مثالية أو تبعية أو أضرار من أجل الأرباح المفقودة ، أو الإيرادات المفقودة ، ، فرصة العمل المفقودة ، فقدان البيانات أو النوايا الحسنة ، انقطاع الخدمة ، تلف الكمبيوتر أو فشل النظام أو تكلفة الخدمات البديلة من أي نوع ينشأ عن هذه المصطلحات أو من استخدام أو عدم القدرة على استخدام الخدمات ، سواء استنادًا إلى الضمان أو العقد أو الضرر (بما في ذلك الإهمال) ، أو مسؤولية المنتج أو أي نظرية قانونية أخرى ، وما إذا كان قد تم إبلاغ مختبرات Mysten أو لمقدمي خدماتها باحتمال حدوث مثل هذا الضرر ، حتى لو تم العثور على علاج محدود من الوصف هنا قد فشل في الغرض الأساسي.
