Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: As part of the Testnet release of Walrus, the documentation and Move Smart contracts have been updated, and can be found in the [`walrus-docs` repository](https://github.com/MystenLabs/walrus-docs).
ar: كجزء من إصدار Testnet من Walrus، تم تحديث الوثائق وعقود Move الذكية، ويمكن العثور عليها في مستودع [`walrus-docs`](https://github.com/MystenLabs/walrus-docs).

source: New Walrus Sites features
ar: ميزات مواقع Walrus الجديدة

source: With the move to Walrus Testnet, Walrus Sites have also been updated! The new features in this update greatly increase the flexibility, speed, and security of Walrus Sites. Developers can now specify client-side routing rules, and add custom HTTP headers to the portals' responses for their site, expanding the possibilities for what Walrus Sites can do.
ar: مع الانتقال إلى شبكة Walrus التجريبية ، تم أيضًا تحديث مواقع Walrus! تزيد الميزات الجديدة في هذا التحديث بشكل كبير من المرونة والسرعة والأمن لمواقع Walrus. يمكن للمطورين الآن تحديد قواعد التوجيه من جانب العميل ، وإضافة رؤوس HTTP مخصصة إلى استجابات البوابات لموقعهم ، وتوسيع إمكانيات ما يمكن أن تفعله مواقع Walrus.

source: Migrate now to take advantage of these new features! The old Walrus Sites, based on Walrus Devnet, will still be available for a short time. However, Devnet will be wiped soon (as described below), so it is recommended to migrate as soon as possible.
ar: ترحيل الآن للاستفادة من هذه الميزات الجديدة! ستظل مواقع Walrus القديمة ، التي تستند إلى Walrus شبكة المطور ، متاحة لفترة قصيرة. ومع ذلك ، سيتم القضاء على شبكة المطور قريبًا (كما هو موضح أدناه) ، لذلك يوصى بالترحيل في أقرب وقت ممكن.

source: Discontinuation of Walrus Devnet
ar: إيقاف شبكة Walrus للمطور

source: The previous Walrus Devnet instance is now deprecated and **will be shut down after 2024-10-31**. All data stored on Walrus Devnet (including Walrus Sites) will no longer be accessible at that point. You need to re-upload all data to Walrus Testnet if you want it to remain accessible. Walrus Sites also need to be migrated.
ar: تم الآن إهمال مثيل Walrus شبكة المطور السابق وسيتم إيقاف ** بعد 2024-10-31 **. لن تكون جميع البيانات المخزنة على Walrus شبكة المطور (بما في ذلك مواقع Walrus) متاحة في تلك المرحلة. تحتاج إلى إعادة تحميل جميع البيانات إلى شبكة Walrus التجريبية إذا كنت تريد أن تظل متاحة. مواقع Walrus تحتاج أيضا إلى هجرة.

source: Walrus supports operations to store and read blobs, and to prove and verify their availability. It ensures content survives storage nodes suffering Byzantine faults and remains available and retrievable. It provides APIs to access the stored content over a CLI, SDKs and over web2 HTTP technologies, and supports content delivery infrastructures like caches and content distribution networks (CDNs).
ar: يدعم Walrus العمليات لتخزين وقراءة الكتل ، وإثبات وتوافرها والتحقق منها. إنه يضمن بقاء المحتوى البقاء على قيد الحياة في العقد التخزين التي تعاني من أخطاء بيزنطية وتظل متاحة وقابلة للاسترداد. يوفر واجهات برمجة التطبيقات للوصول إلى المحتوى المخزن عبر CLI و SDKs و Web2 HTTP Technologies ، ويدعم البنية التحتية لتسليم المحتوى مثل ذاكرة التخزين المؤقت وشبكات توزيع المحتوى (CDNS).

source: Under the hood, storage cost is a small fixed multiple of the size of blobs (around 5x). Advanced erasure coding keeps the cost low, in contrast to the full replication of data traditional to blockchains, such as the >100x multiple for data stored in Sui objects. As a result, storage of much bigger resources (up to several GiB) is possible on Walrus at substantially lower cost than on Sui or other blockchains. Because encoded blobs are stored on all storage nodes, Walrus also provides superior robustness than designs with a small amount of replicas storing the full blob.
ar: تحت الغطاء ، تكلفة التخزين هي مضاعف ثابت صغير من حجم الكتل (حوالي 5x). يحافظ ترميز المحو المتقدم على التكلفة المنخفضة ، على عكس النسخ المتماثل الكامل للبيانات التقليدية إلى الحظر ، مثل> 100x متعددة للبيانات المخزنة في كتلةات SUI. نتيجة لذلك ، يمكن تخزين الموارد الأكبر بكثير (حتى عدة GIB) على Walrus بتكلفة أقل بكثير من SUI أو غيرها من بلوكتشينs. نظرًا لأن الكتل المشفرة يتم تخزينها على جميع عقد التخزين ، فإن Walrus يوفر أيضًا R R. obustness من التصميمات مع كمية صغيرة من النسخ المتماثلة تخزين الكتلة الكاملة.

source: Walrus uses the Sui chain for coordination and payments. Available storage is represented as Sui objects that can be acquired, owned, split, merged, and transferred. Storage space can be tied to a stored blob for a period of time, with the resulting Sui object used to prove availability on chain in smart contracts, or off chain using light clients.
ar: يستخدم Walrus سلسلة SUI للتنسيق والمدفوعات. يتم تمثيل التخزين المتاح ككتلةات SUI التي يمكن الحصول عليها وامتلاكها وتقسيمها ودمجها ونقلها. يمكن ربط مساحة التخزين بكتلة مخزنة لفترة من الزمن ، مع استخدام كتلة البيانات SUI الناتج لإثبات توفر السلسلة في العقود الذكية ، أو السلسلة الخارجية باستخدام العملاء الخفيف.

source: The [next chapter](./overview.md) discusses the above operations relating to storage, retrieval, and availability in detail.
ar: يناقش [الفصل التالي] (./ Overview.md) العمليات المذكورة أعلاه المتعلقة بالتخزين والاسترجاع والتوافر بالتفصيل.

source: In the future, we plan to include in Walrus some minimal governance to allow storage nodes to change between storage epochs. Walrus is also compatible with periodic payments for continued storage. We also plan to implement storage attestation based on challenges to get confidence that blobs are stored or at least available. Walrus also allows light nodes that store small parts of blobs to get rewards for proving availability and assisting recovery. We will cover these topics in later documents. We also provide details of the encoding scheme in a separate document.
ar: في المستقبل، نخطط لتضمين بعض الحوكمة البسيطة في Walrus للسماح لعقد التخزين بالتغيير بين عصور التخزين. كما يتوافق Walrus مع المدفوعات الدورية للتخزين المستمر. كما نخطط لتطبيق إثبات التخزين بناءً على التحديات للحصول على الثقة في تخزين الكتل أو توفرها على الأقل. كما يسمح Walrus للعقد الخفيفة التي تخزن أجزاء صغيرة من الكتل بالحصول على مكافآت لإثبات التوافر والمساعدة في الاسترداد. سنغطي هذه الموضوعات في مستندات لاحقة. كما نقدم تفاصيل مخطط التشفير في مستند منفصل.

source: Non-objectives
ar: أهداف لا تسعى إليها Walurs

source: There are a few things that Walrus explicitly is not:
ar: هناك بعض الأشياء التي لا يوجد فيها Walrus بشكل صريح:

source: Walrus does not reimplement a CDN that might be geo-replicated or have less than tens of milliseconds of latency. Instead, it ensures that traditional CDNs are usable and compatible with Walrus caches.
ar: لا يعيد Walrus أن يعرض CDN الذي قد يتم تكراره جغرافيًا أو يحتوي على أقل من عشرات المللي ثانية من الكمون. بدلاً من ذلك ، يضمن أن CDN التقليدية قابلة للاستخدام ومتوافق مع ذاكرة التخزين المؤقت للوهن.

source: Walrus does not re-implement a full smart contracts platform with consensus or execution. It relies on Sui smart contracts when necessary, to manage Walrus resources and processes including payments, storage epochs, and so on.
ar: لا يقوم Walrus بإعادة تنفيذ نظام أساسي للعقود الذكية الكاملة مع الإجماع أو التنفيذ. يعتمد على عقود SUI الذكية عند الضرورة ، لإدارة موارد وعمليات Walrus بما في ذلك المدفوعات ، وعصر التخزين ، وما إلى ذلك.

source: Walrus supports storage of any blob, including encrypted blobs. However, Walrus itself is not the distributed key management infrastructure that manages and distributed encryption or decryption keys to support a full private storage eco-system. It can, however, provide the storage layer for such infrastructures.
ar: يدعم Walrus تخزين أي كتلة البيانات ، بما في ذلك الكتل المشفرة. ومع ذلك ، فإن Walrus نفسها ليست البنية التحتية للإدارة الرئيسية الموزعة التي تدير وتوزيع مفاتيح التشفير أو فك التشفير لدعم نظام Eco-Syo-Syo System الخاص بالكامل. ومع ذلك ، يمكن أن يوفر طبقة التخزين لهذه البنى التحتية.

source: Use cases
ar: حالات الإستخدام

source: App builders may use Walrus in conjunction with any L1 or L2 blockchains to build experiences that require large amounts of data to be stored in a decentralized manner and possibly certified as available:
ar: يمكن لمنشئي التطبيقات استخدام Walrus بالاشتراك مع أي بلوكتشين من الطبقة الأولى أو الثانية لبناء تجارب تتطلب تخزين كميات كبيرة من البيانات بطريقة لامركزية وربما يتم اعتمادها على أنها متاحة:

source: **Storage of media for NFT or dApps:** Walrus can directly store and serve media such as images, sounds, sprites, videos, other game assets, and so on. This is publicly available media that is accessed using HTTP requests at caches to create multimedia dApps.
ar: ** تخزين الوسائط لـ NFT أو التطبيقات اللامركزية: ** يمكن للوكر تخزين وتقديم الوسائط مباشرة مثل الصور والأصوات والعفاريت ومقاطع الفيديو وأصول اللعبة الأخرى وما إلى ذلك. هذه الوسائط المتاحة للجمهور التي يتم الوصول إليها باستخدام طلبات HTTP في ذاكرة التخزين المؤقت لإنشاء تطبيقات لامركزية متعددة الوسائط.

source: **AI related use cases:** Walrus can store clean data sets of training data, datasets with a known and verified provenance, models, weights and proofs of correct training for AI models. It can also store and ensure the availability of an AI model output.
ar: ** حالات الاستخدام ذات الصلة من الذكاء الاصطناعى: ** يمكن Walrus تخزين مجموعات بيانات نظيفة لبيانات التدريب ومجموعات البيانات مع مصدر معروف ومتحقق من النماذج والأوزان والبراهين للتدريب الصحيح لنماذج الذكاء الاصطناعى. يمكنه أيضًا تخزين وضمان توفر ناتج نموذج الذكاء الاصطناعي.

source: **Storage of long term archival of blockchain history:** Walrus can act as a lower-cost decentralized store to store blockchain history. For Sui, this can include sequences of checkpoints with all associated transaction and effects content, as well as historic snapshots of the blockchain state, code, or binaries.
ar: ** تخزين الأرشيف على المدى الطويل لتاريخ بلوكتشين: ** يمكن أن يكون Walrus بمثابة متجر لا مركزي منخفض التكلفة لتخزين تاريخ بلوكتشين. بالنسبة لـ SUI ، يمكن أن يشمل ذلك تسلسلات من نقاط الفحص مع جميع محتوى المعاملات والآثار المرتبطة به ، وكذلك لقطات تاريخية لحالة بلوكتشين أو الكود أو الثنائيات.

source: **Support availability for L2s:** Walrus allows parties to certify the availability of blobs, as required by L2s that need data to be stored and be attested as available to all. This may also include availability of extra audit data such as validity proofs, zero knowledge proofs of correct execution or large fraud proofs.
ar: **توفر الدعم لشبكات الطبقات الثانية:** يسمح Walrus للأطراف بإثبات توفر الكتل، كما هو مطلوب من قبل شبكات الطبقات الثانية التي تحتاج إلى تخزين البيانات والتحقق من توفرها للجميع. قد يتضمن هذا أيضًا توفر بيانات تدقيق إضافية مثل إثباتات الصلاحية أو إثباتات عدم المعرفة للتنفيذ الصحيح أو إثباتات الاحتيال الكبيرة.

source: **Support a fully decentralized web experience:** Walrus can host fully decentralized web experiences, including all resources (such as js, css, html, media). These can not only provide content, but also host the UX of dApps to enable applications with fully decentralized front end and back ends on chain. Walrus puts the full "web" into web3.
ar: **دعم تجربة ويب لامركزية بالكامل:** يمكن لـ Walrus استضافة تجارب ويب لامركزية بالكامل، بما في ذلك جميع الموارد (مثل js وcss وhtml والوسائط). لا يمكنها فقط توفير المحتوى، بل يمكنها أيضًا استضافة تجربة المستخدم للتطبيقات اللامركزية لتمكين التطبيقات ذات الواجهة الأمامية والخلفية اللامركزية بالكامل على السلسلة. تضع Walrus "الويب" الكامل في web3.

source: **Support subscription models for media:** Creators can store encrypted media on Walrus and only provide access via decryption keys to parties that have paid a subscription fee or have paid for content. Walrus provides the storage, encryption and decryption needs to happen off the system.
ar: **دعم نماذج الاشتراك للوسائط:** يمكن للمبدعين تخزين الوسائط المشفرة على Walrus وتوفير الوصول عبر مفاتيح فك التشفير فقط للأطراف التي دفعت رسوم اشتراك أو دفعت مقابل المحتوى. يوفر Walrus احتياجات التخزين والتشفير وفك التشفير اللازمة للعمل خارج النظام.

source: System overview
ar: نظرة عامة على النظام

source: This chapter provides an overview of the [architecture](./architecture.md) and [encoding mechanisms](./encoding.md) of the Walrus system.
ar: يوفر هذا الفصل نظرة عامة على [بنية] (./ architecture.md) و [آليات التشفير] (./ charsing.md) لنظام Walrus.

source: Use the [glossary](../glossary.md) as a reference for many of the bolded terms used in this documentation.
ar: استخدم [Glossary] (../ Glossary.md) كمرجع للعديد من المصطلحات الجريئة المستخدمة في هذه الوثائق.

source: Basic architecture and security assumptions
ar: افتراضات أساسية في الهندسة المعمارية والأمن

source: The key actors in the Walrus architecture are the following:
ar: الجهات الفاعلة الرئيسية في بنية Walrus هي ما يلي:

source: **Users** through **clients** want to store and read **blobs** identified by their **blob ID**.
ar: يرغب **المستخدمون** من خلال **العملاء** في تخزين وقراءة **العناصر** التي تم تحديدها من خلال **معرف كتلة البيانات** الخاص بهم.

source: These actors are ready to pay for service when it comes to writes and non-best-effort reads. Users also want to prove the **availability** of a blob to third parties without the cost of sending or receiving the full blob.
ar: هذه الجهات الفاعلة مستعدة لدفع ثمن الخدمة عندما يتعلق الأمر بالكتابة والقراءات غير الأكثر جهد. يرغب المستخدمون أيضًا في إثبات ** توافر ** من الأطراف إلى أطراف ثالثة دون تكلفة إرسال أو استلام كتلة البيانات الكاملة.

source: Users might be malicious in various ways: they might not want to pay for services, prove the availability of unavailable blobs, modify/delete blobs without authorization, try to exhaust resources of storage nodes, and so on.
ar: قد يكون المستخدمون ضارين بطرق مختلفة: قد لا يرغبون في دفع ثمن الخدمات ، وإثبات توفر الكتل غير المتوفرة ، وتعديل/حذف الكتل دون إذن ، ومحاولة استنفاد موارد العقد التخزين ، وما إلى ذلك.

source: **Storage nodes** hold one or many **shards** within a **storage epoch**.
ar: ** عقد التخزين ** عقد واحد أو العديد من ** شرائح ** ضمن عصر التخزين ** **.

source: Each blob is erasure-encoded into many **slivers**. Slivers from each stored blob become part of all shards. A shard at any storage epoch is associated with a storage node that actually stores all slivers of the shard and is ready to serve them.
ar: يتم تشفير كل كتلة البيانات عن طريق المسح إلى العديد من **الشظايا**. تصبح الشظايا من كل كتلة البيانات مخزنة جزءًا من جميع الشظايا. ترتبط الشظية في أي عصر تخزين بعقدة تخزين تخزن بالفعل جميع شظايا الشظية وتكون جاهزة لخدمتها.

source: A Sui smart contract controls the assignment of shards to storage nodes within **storage epochs**, and Walrus assumes that more than 2/3 of the shards are managed by correct storage nodes within each storage epoch. This means that Walrus must tolerate up to 1/3 of the shards managed by Byzantine storage nodes (approximately 1/3 of the storage nodes being Byzantine) within each storage epoch and across storage epochs.
ar: يتحكم عقد Sui الذكي في تخصيص الشظايا لعقد التخزين ضمن **عصور التخزين**، ويفترض Walrus أن أكثر من 2/3 من الشظايا يتم إدارتها بواسطة عقد تخزين صحيحة ضمن كل عصر تخزين. وهذا يعني أن Walrus يجب أن يتحمل ما يصل إلى 1/3 من الشظايا التي تديرها عقد تخزين Byzantine (حوالي 1/3 من عقد التخزين هي بيزنطي) ضمن كل عصر تخزين وعبر عصور التخزين.

source: All clients and storage nodes operate a blockchain client (specifically on Sui), and mediate payments, resources (space), mapping of shards to storage nodes, and metadata through blockchain smart contracts. Users interact with the blockchain to acquire storage resources and upload certificates for stored blobs. Storage nodes listen to the blockchain events to coordinate their operations.
ar: تعمل جميع العملاء وعقد التخزين على تشغيل عميل بلوكتشين (على وجه التحديد على SUI) ، والتوسط في المدفوعات والموارد (المساحة) ورسم خرائط الشظايا لعقد التخزين والبيانات الوصفية من خلال العقود الذكية بلوكتشين. يتفاعل المستخدمون مع بلوكتشين لاكتساب موارد التخزين وتحميل شهادات الكتل المخزنة. تستمع عقد التخزين إلى أحداث بلوكتشين لتنسيق عملياتها.

source: Walrus supports any additional number of optional infrastructure actors that can operate in a permissionless way:
ar: يدعم Walrus أي عدد إضافي من الجهات الفاعلة في البنية التحتية الاختيارية التي يمكنها العمل بطريقة بدون أذونات:

source: **Aggregators** are clients that reconstruct blobs from slivers and make them available to users over traditional web2 technologies (such as HTTP). They are optional in that end users may reconstruct blobs directly or run a local aggregator to perform Walrus reads over web2 technologies locally.
ar: **المجمعون** عبارة عن عملاء يعيدون بناء الكتل من أجزاء صغيرة ويجعلونها متاحة للمستخدمين عبر تقنيات الويب 2 التقليدية (مثل HTTP). وهي اختيارية حيث يمكن للمستخدمين النهائيين إعادة بناء الكتل بشكل مباشر أو تشغيل مجمع محلي لأداء قراءات Walrus عبر تقنيات الويب 2 محليًا.

source: **Caches** are aggregators with additional caching functionality to decrease latency and reduce load on storage nodes. Such cache infrastructures may also act as CDNs, split the cost of blob reconstruction over many requests, be better connected, and so on. A client can always verify that reads from such infrastructures are correct.
ar: **ذاكرات التخيزن المؤقتة** عبارة عن مجمعات ذات وظائف تخزين مؤقت إضافية لتقليل زمن الوصول وتقليل الحمل على عقد التخزين. قد تعمل مثل هذه البنى التحتية للذاكرة المؤقتة أيضًا كشبكات توصيل المحتوى، وتقسيم تكلفة إعادة بناء الكائن على العديد من الطلبات، وتكون متصلة بشكل أفضل، وما إلى ذلك. يمكن للعميل دائمًا التحقق من صحة القراءات من هذه البنى التحتية.

source: **Publishers** are clients that help end users store a blob using web2 technologies, using less bandwidth and custom logic.
ar: **الناشرون** هم عملاء يساعدون المستخدمين النهائيين على تخزين كائن باستخدام تقنيات web2، باستخدام نطاق ترددي أقل ومنطق مخصص.

source: In effect, they receive the blob to be published over traditional web2 protocols (like HTTP) and run the Walrus store protocol on the end user's behalf. This includes encoding the blob into slivers, distributing the slivers to storage nodes, collecting storage-node signatures and aggregating them into a certificate, as well as all other on-chain actions.
ar: في الواقع، يتلقون الكائن المراد نشره عبر بروتوكولات الويب 2 التقليدية (مثل HTTP) ويشغلون بروتوكول تخزين Walrus نيابة عن المستخدم النهائي. ويتضمن هذا ترميز الكائن إلى أجزاء صغيرة، وتوزيع الأجزاء الصغيرة على عقد التخزين، وجمع توقيعات عقد التخزين وتجميعها في شهادة، بالإضافة إلى جميع الإجراءات الأخرى على السلسلة.

source: They are optional in that a user can directly interact with Sui and the storage nodes to store blobs. An end user can always verify that a publisher performed their duties correctly by checking that an event associated with the **[point of availability](./properties.md)** for the blob exists on chain and then either performing a read to see if Walrus returns the blob or encoding the blob and comparing the result to the blob ID in the certificate.
ar: إنها اختيارية حيث يمكن للمستخدم التفاعل مباشرة مع Sui وعقد التخزين لتخزين الكائنات. يمكن للمستخدم النهائي دائمًا التحقق من قيام الناشر بأداء واجباته بشكل صحيح من خلال التحقق من وجود حدث مرتبط بـ **[نقطة التوفر](./properties.md)** للكائن على السلسلة ثم إجراء قراءة لمعرفة ما إذا كان Walrus يعيد كتلة البيانات أو تشفير كتلة البيانات ومقارنة النتيجة بمعرف الكائن في الشهادة.

source: Aggregators, publishers, and end users are not considered trusted components of the system, and they might deviate from the protocol arbitrarily. However, some of the security properties of Walrus only hold for honest end users that use honest intermediaries (caches and publishers). Walrus provides a means for end users to audit the correct operation of both caches and publishers.
ar: لا يعتبر المجمعون والناشرين والمستخدمين النهائيين مكونات موثوقة للنظام ، وقد ينحرفون عن البروتوكول بشكل تعسفي. ومع ذلك ، فإن بعض خصائص الأمن في Walrus لا تملك إلا للمستخدمين النهائيين الصادقين الذين يستخدمون الوسطاء الصادقين (ذاكرة التخزين المؤقت والناشرين). يوفر Walrus وسيلة للمستخدمين النهائيين لتدقيق التشغيل الصحيح لكل من ذاكرة التخزين المؤقت والناشرين.

source: Encoding, overheads, and verification
ar: التشفير والنفقات العامة والتحقق

source: The following list summarizes the basic encoding and cryptographic techniques used in Walrus:
ar: تلخص القائمة التالية تقنيات التشفير والتشفير الأساسية المستخدمة في Walrus:

source: An [erasure code](https://en.wikipedia.org/wiki/Erasure_code) encode algorithm takes a blob, splits it into a number <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6944em;"></span><span class="mord mathnormal" style="margin-right:0.03148em;">k</span></span></span></span> of symbols, and encodes it into <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.5782em;vertical-align:-0.0391em;"></span><span class="mord mathnormal">n</span><span class="mspace" style="margin-right:0.2778em;"></span><span class="mrel">\></span><span class="mspace" style="margin-right:0.2778em;"></span></span><span class="base"><span class="strut" style="height:0.6944em;"></span><span class="mord mathnormal" style="margin-right:0.03148em;">k</span></span></span></span> symbols in such a way that a subset of these <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.4306em;"></span><span class="mord mathnormal">n</span></span></span></span> symbols can be used to reconstruct the blob.
ar: تأخذ خوارزمية ترميز [رمز المحو] (https://en.wikipedia.org/wiki/Erasure_code) كتلة، وتقسمها إلى عدد <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6944em;"></span><span class="mord mathnormal" style="margin-right:0.03148em;">k</span></span></span></span></span> من الرموز، وترميزها إلى <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.5782em;vertical-align:-0.0391em;"></span><span class="mord mathnormal">n</span><span class="mspace" style="margin-right:0.2778em;"></span><span class="mrel">\></span><span class="mspace" style="margin-right:0.2778em;"></span></span><span class="base"><span class="strut" style="height:0.6944em;"></span><span class="mord mathnormal" style="margin-right:0.03148em;">k</span></span></span></span> رمزًا بطريقة يمكن من خلالها استخدام مجموعة فرعية من هذه الرموز <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.4306em;"></span><span class="mord mathnormal">n</span></span></span></span> لإعادة بناء الكتلة.

source: Walrus uses a highly efficient erasure code and selects <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6944em;"></span><span class="mord mathnormal" style="margin-right:0.03148em;">k</span></span></span></span> such that a third of symbols can be used to reconstruct the blob by the decode algorithm.
ar: يستخدم Walrus كود مسح عالي الكفاءة ويختار <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6944em;"></span><span class="mord mathnormal" style="margin-right:0.03148em;">k</span></span></span></span> بحيث يمكن استخدام ثلث الرموز لإعادة بناء الكتلة بواسطة خوارزمية فك التشفير.

source: The encoding is _systematic_, meaning that some storage nodes hold part of the original blob, allowing for fast random-access reads.
ar: التشفير هو _systematic_ ، مما يعني أن بعض عقد التخزين تحمل جزءًا من الكتلة الأصلية ، مما يسمح بقراءات الوصول العشوائي السريع.

source: All encoding and decoding operations are deterministic, and encoders have no discretion about it.
ar: جميع عمليات التشفير والفك تشفير هي حتمية ، ولا يتمتع الترميزات بسلطة تقديرية حول هذا الموضوع.
