Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: Blob and storage objects
ar: كتلةات الكتلة والتخزين

source: Walrus blobs are represented as Sui objects of type `Blob`. A blob is first registered, indicating that the storage nodes should expect slivers from a Blob ID to be stored. Then a blob is certified, indicating that a sufficient number of slivers have been stored to guarantee the blob's availability. When a blob is certified, its `certified_epoch` field contains the epoch in which it was certified.
ar: يتم تمثيل الكتلات من Walrus كأشياء SUI من النوع "كتلة البيانات". يتم تسجيل كتلة البيانات لأول مرة ، مما يشير إلى أن عقد التخزين يجب أن تتوقع أن يتم تخزين الشظايا من معرف كتلة البيانات. ثم يتم اعتماد الكتلة ، مما يشير إلى أنه تم تخزين عدد كاف من الشظايا لضمان توفر كتلة البيانات. عندما يتم اعتماد كتلة البيانات ، يحتوي حقل `certified_حقبة` على الحقبة التي تم اعتمادها.

source: A `Blob` object is always associated with a `Storage` object, reserving enough space for a long enough period for the blob's storage. A certified blob is available for the period the underlying storage resource guarantees storage.
ar: يرتبط كتلة البيانات "كتلة البيانات" دائمًا بكتلة "تخزين" ، ويحتفظ بمساحة كافية لفترة طويلة بما يكفي لتخزين الكتلة. تتوفر كتلة البيانات معتمدة للفترة التي يضمن مورد التخزين الأساسي تخزينها.

source: Concretely, `Blob` and `Storage` objects have the following fields, which can be read through the Sui SDKs:
ar: بشكل ملموس ، تحتوي كتلةات "كتلة البيانات" و "التخزين" على الحقول التالية ، والتي يمكن قراءتها من خلال sdks sdks:

source: ```move /// The blob structure represents a blob that has been registered to with some storage, /// and then may eventually be certified as being available in the system. public struct Blob has key, store { id: UID, registered_epoch: u32, blob_id: u256, size: u64, encoding_type: u8, // Stores the epoch first certified. certified_epoch: option::Option<u32>, storage: Storage, // Marks if this blob can be deleted. deletable: bool, } /// Reservation for storage for a given period, which is inclusive start, exclusive end. public struct Storage has key, store { id: UID, start_epoch: u32, end_epoch: u32, storage_size: u64, } ```
ar: تحرك /// تمثل بنية كتلة البيانات كتلة البيانات تم تسجيلها مع بعض التخزين ، /// ثم قد يتم اعتمادها في النهاية على أنها متوفرة في النظام. يحتوي كتلة البيانات كتلة البيانات العام على مفتاح ، متجر { ID: UID ، registered_حقبة: u32 ، كتلة البيانات_id: u256 ، الحجم: U64 ، التشفير_type: u8 ، // يخزن الحقبة المعتمدة لأول مرة. certified_حقبة: الخيار :: الخيار <U32> ، التخزين: التخزين ، // علامات إذا كان يمكن حذف هذه الكتلة. حذف: منطقي ، } /// الحجز لـ Stor العمر لفترة معينة ، وهي بداية شاملة ، نهاية حصرية. تخزين الهيكل العام يحتوي على مفتاح ، متجر { ID: UID ، start_حقبة: u32 ، end_حقبة: u32 ، Storage_Size: U64 ، } `` `

source: All fields of `Blob` and `Storage` objects can be read using the expected functions:
ar: يمكن قراءة جميع مجالات كتلةات "كتلة البيانات" و "التخزين" باستخدام الوظائف المتوقعة:

source: ```move // Blob functions public fun blob_id(b: &Blob): u256; public fun size(b: &Blob): u64; public fun erasure_code_type(b: &Blob): u8; public fun registered_epoch(self: &Blob): u32; public fun certified_epoch(b: &Blob): &Option<u32>; public fun storage(b: &Blob): &Storage; ... // Storage functions public fun start_epoch(self: &Storage): u32; public fun end_epoch(self: &Storage): u32; public fun storage_size(self: &Storage): u64; ... ```
ar: تحرك // وظائف كتلة البيانات متعة عامة كتلة البيانات_id (b: & كتلة البيانات): u256 ؛ حجم المرح العام (ب: & كتلة البيانات): u64 ؛ Public Fun Erasure_code_type (B: & كتلة البيانات): U8 ؛ المرح العام register_حقبة (Self: & كتلة البيانات): U32 ؛ Public Fun Certified_حقبة (b: & كتلة البيانات): & eboty <u32> ؛ تخزين المرح العام (ب: & كتلة البيانات): & storage ؛ ... // وظائف التخزين المتعة العامة start_حقبة (الذات: وتخزين): U32 ؛ المتعة العامة end_حقبة (الذات: وتخزين): U32 ؛ Storage_size Public Fun (Self: & Storage): U64 ؛ ... `` `

source: Events
ar: الأحداث

source: When a blob is first registered, a `BlobRegistered` event is emitted that informs storage nodes that they should expect slivers associated with its Blob ID. Eventually when the blob is certified, a `BlobCertified` is emitted containing information about the blob ID and the epoch after which the blob will be deleted. Before that epoch the blob is guaranteed to be available.
ar: عندما يتم تسجيل الكتلة لأول مرة ، يتم تنبعث حدث "كتلةregistered" الذي يقوم بإبلاغ عقد التخزين التي يجب أن يتوقعوا شرائح مرتبطة بمعرف كتلة البيانات الخاص به. في النهاية عندما يتم اعتماد الكتلة ، يتم تنبعث من "كتلةcertified" يحتوي على معلومات حول معرف كتلة البيانات والحقبة التي سيتم بعدها حذف الكتلة. قبل ذلك الحقبة ، يتم ضمان أن تكون الكتلة متاحة.

source: ```move /// Signals that a blob with metadata has been registered. public struct BlobRegistered has copy, drop { epoch: u32, blob_id: u256, size: u64, encoding_type: u8, end_epoch: u32, deletable: bool, // The object id of the related `Blob` object object_id: ID, } /// Signals that a blob is certified. public struct BlobCertified has copy, drop { epoch: u32, blob_id: u256, end_epoch: u32, deletable: bool, // The object id of the related `Blob` object object_id: ID, // Marks if this is an extension for explorers, etc. is_extension: bool, } ```
ar: تحرك /// إشارات إلى أن الكتلة مع البيانات الوصفية قد تم تسجيلها. البنية العامة كتلةregistered لديها نسخة ، إسقاط { العصر: U32 ، كتلة البيانات_id: u256 ، الحجم: U64 ، التشفير_type: u8 ، end_حقبة: u32 ، حذف: منطقي ، // معرف كتلة البيانات كتلة البيانات "كتلة البيانات" ذي الصلة Object_id: معرف ، } /// إشارات إلى أن الكتلة معتمدة. الهيكل العام كتلةcertified لديه نسخة ، إسقاط { العصر: U32 ، كتلة البيانات_id: u256 ، end_حقبة: u32 ، حذف: منطقي ، // معرف الكتلة من "الكتلة" ذات الصلة هدف Object_id: معرف ، // علامات إذا كان هذا امتدادًا للمستكشفين ، إلخ. is_extension: Bool ، } `` `

source: The `BlobCertified` event with `deletable` set to false and an `end_epoch` in the future indicates that the blob will be available until this epoch. A light client proof that this event was emitted for a blob ID constitutes a proof of availability for the data with this blob ID.
ar: يشير حدث "كتلةcertified" مع "حذف" إلى خطأ و "end_حقبة" في المستقبل يشير إلى أن الكتلة ستكون متاحة حتى هذه الحقبة. يشكل دليل على عميل الضوء على أن هذا الحدث معرف كتلة البيانات يشكل دليلًا على توافر البيانات باستخدام معرف كتلة البيانات هذا.

source: When a deletable blob is deleted, a `BlobDeleted` event is emitted:
ar: عندما يتم حذف كتلة البيانات حذف ، ينبعث حدث "كتلةdeleted":

source: ```move /// Signals that a blob has been deleted. public struct BlobDeleted has copy, drop { epoch: u32, blob_id: u256, end_epoch: u32, // The object ID of the related `Blob` object. object_id: ID, // If the blob object was previously certified. was_certified: bool, } ```
ar: تحرك /// الإشارات التي تم حذفها. البنية العامة كتلةdeleted لديها نسخة ، إسقاط { العصر: U32 ، كتلة البيانات_id: u256 ، end_حقبة: u32 ، // معرف الكتلة لكتلة "كتلة` ذي الصلة". Object_id: معرف ، // إذا تم اعتماد كتلة البيانات كتلة البيانات سابقًا. was_certified: Bool ، } `` `

source: The `InvalidBlobID` event is emitted when storage nodes detect an incorrectly encoded blob. Anyone attempting a read on such a blob is guaranteed to also detect it as invalid.
ar: ينبعث حدث `invalidكتلةid` عندما تكتشف عقد التخزين كتلة البيانات مشفرة بشكل غير صحيح. أي شخص يحاول قراءة على مثل هذه الكتلة مضمونة لاكتشافها على أنها غير صالحة.

source: ```move /// Signals that a BlobID is invalid. public struct InvalidBlobID has copy, drop { epoch: u32, // The epoch in which the blob ID is first registered as invalid blob_id: u256, } ```
ar: تحرك /// إشارات إلى أن كتلةid غير صالح. الهيكل العام غير invalidكتلةid لديه نسخة ، إسقاط { العصر: u32 ، // الحقبة التي يتم فيها تسجيل معرف كتلة البيانات لأول مرة على أنها غير صالحة كتلة البيانات_id: u256 ، } `` `

source: System level events such as `EpochChangeStart` and `EpochChangeDone` indicate transitions between epochs. And associated events such as `ShardsReceived`, `EpochParametersSelected`, and `ShardRecoveryStart` indicate storage node level events related to epoch transitions, shard migrations and epoch parameters.
ar: تشير الأحداث على مستوى النظام مثل `EpochChangeStart` و`EpochChangeDone` إلى الانتقالات بين العصور. وتشير الأحداث المرتبطة مثل `ShardsReceived` و`EpochParametersSelected` و`ShardRecoveryStart` إلى أحداث على مستوى عقدة التخزين تتعلق بانتقالات العصور وترحيلات الشظايا ومعلمات العصور.

source: System and staking information
ar: معلومات النظام والحصة

source: The Walrus system object contains metadata about the available and used storage, as well as the price of storage per KiB of storage in FROST. The committee structure within the system object can be used to read the current epoch number, as well as information about the committee.
ar: يحتوي كتلة البيانات نظام Walrus على بيانات تعريف حول التخزين المتاح والمستخدم ، بالإضافة إلى سعر التخزين لكل KIB للتخزين في الصقيع. يمكن استخدام هيكل اللجنة داخل كتلة البيانات النظام لقراءة رقم الحقبة الحالي ، وكذلك معلومات حول اللجنة.

source: ```move public struct SystemStateInnerV1 has key, store { id: UID, /// The current committee, with the current epoch. committee: BlsCommittee, // Some accounting total_capacity_size: u64, used_capacity_size: u64, /// The price per unit size of storage. storage_price_per_unit_size: u64, /// The write price per unit size. write_price_per_unit_size: u64, /// Accounting ring buffer for future epochs. future_accounting: FutureAccountingRingBuffer, /// Event blob certification state event_blob_certification_state: EventBlobCertificationState, } /// This represents a BLS signing committee for a given epoch. public struct BlsCommittee has store, copy, drop { /// A vector of committee members members: vector<BlsCommitteeMember>, /// The total number of shards held by the committee n_shards: u16, /// The epoch in which the committee is active. epoch: u32, } public struct BlsCommitteeMember has store, copy, drop { public_key: Element<G1>, weight: u16, node_id: ID, } ```
ar: move البنية العامة SystemStateInnerV1 لديه مفتاح ، متجر { ID: UID ، /// اللجنة الحالية ، مع الحقبة الحالية. اللجنة: اللجنة العسكرية ، // بعض المحاسبة Total_capacity_size: U64 ، ederive_capacity_size: u64 ، /// السعر لكل وحدة حجم التخزين. storage_price_per_unit_size: u64 ، /// سعر الكتابة لكل وحدة حجم. write_price_per_unit_size: u64 ، /// المحاسبية المخزن المؤقت للحصات المستقبلية. Future_accounting: FutureAcountingRingBuffer ، / // حالة شهادة كتلة البيانات Event event_كتلة البيانات_certification_state: EventBlobCertificationState ، } /// هذا يمثل لجنة توقيع BLS لعصر معين. البنية العامة blscommittee لديها متجر ، نسخ ، إسقاط { /// متجه أعضاء اللجنة الأعضاء: المتجه <blscommittemember> ، /// إجمالي عدد القطع التي تحتفظ بها اللجنة N_Shards: U16 ، /// الحقبة التي تنشط فيها اللجنة. العصر: U32 ، } بنية عامة blscommitteMember لديه متجر ، نسخ ، إسقاط { public_key: عنصر <g1> ، الوزن: U16 ، node_id: id ، } `` `

source: This chapter introduces all the concepts needed for operators of the different components that make up the Walrus system. It is currently a work in progress and will be updated as the platform matures.
ar: يقدم هذا الفصل جميع المفاهيم اللازمة لمشغلي المكونات المختلفة التي تشكل نظام Walrus. إنه حاليًا عمل مستمر وسيتم تحديثه مع نضوج النظام الأساسي.

source: Specifically, this guide describes the following:
ar: على وجه التحديد ، يصف هذا الدليل ما يلي:

source: [Storage node](storage-node.md) contains the most relevant instructions for operators of a Walrus storage node.
ar: تحتوي [عقدة التخزين](storage-node.md) على التعليمات الأكثر صلة لمشغلي عقدة تخزين Walrus.

source: [Aggregator](aggregator.md) describes the operation of a Walrus aggregator host.
ar: [مجمع] (Aggregator.MD) يصف تشغيل مضيف مجمع Walrus.

source: Operating a storage node
ar: تشغيل عقدة تخزين

source: The binary of the storage node is not yet publicly available. Prior to official network launch the code will be open-sourced.
ar: لم يتم إتاحة الملف الثنائي لعقدة التخزين للعامة بعد. قبل الإطلاق الرسمي للشبكة، سيكون الكود مفتوح المصدر.

source: A basic systemd service running the Storage Node could look like this:
ar: يمكن أن تبدو خدمة SystemD الأساسية التي تعمل بعقدة التخزين مثل هذا:

source: Make sure to adjust any paths and, if desired, the log level.
ar: تأكد من ضبط أي مسارات ، وإذا رغبت في ذلك ، مستوى السجل.

source: The `walrus-node` binary stores slivers in RocksDB, which means the data will be stored on disk, to a path configured by the `/opt/walrus/config/walrus-node.yaml` file. The full format with all mandatory and optional configuration parameters will be made available with the binary.
ar: يخزن "Walrus-Node` Barinary Slivers في RocksDB ، مما يعني أنه سيتم تخزين البيانات على القرص ، إلى مسار تم تكوينه بواسطة ملف"/OPT/Walrus/Config/Walrus-Node.yaml`. سيتم توفير التنسيق الكامل مع جميع معلمات التكوين الإلزامية والاختيارية مع الثنائي.

source: Here are some important config params from a shortened version of the `walrus-node.yaml` config file:
ar: فيما يلي بعض معاملات التكوين المهمة من نسخة مختصرة من ملف التكوين `walrus-node.yaml`:

source: invalidity_sync_timeout_secs
ar: penital_sync_timeout_secs

source: For monitoring, you can configure Grafana Agent to fetch metrics from `localhost:9184/metrics` (or whatever you've configured `metrics_address` to be).
ar: للمراقبة ، يمكنك تكوين Agent Grafana لجلب المقاييس من `LocalHost: 9184/Metrics` (أو أي شيء قمت بتكوينه` metrics_address` ليكون).

source: Operating an aggregator
ar: تشغيل مجمع

source: Below is an example of an aggregator node which hosts a HTTP endpoint that can be used to fetch data from Walrus over the web.
ar: فيما يلي مثال على عقدة المجمع التي تستضيف كتلة البيانات نهاية HTTP التي يمكن استخدامها لجلب البيانات من Walrus عبر الويب.

source: The aggregator process is run via the `walrus` client binary in [daemon mode](../usage/web-api.md). It can be run in many ways, one example being via a systemd service:
ar: يتم تشغيل عملية التجميع عبر ملف العميل الثنائي `walrus` في [وضع الخادم](../usage/web-api.md). ويمكن تشغيلها بعدة طرق، على سبيل المثال عبر خدمة systemd:

source: Staking
ar: الحصة

source: In Walrus, anyone can delegate stake to storage nodes and, by doing so, influence, which storage nodes get selected for the committee in future epochs, and how many shards these nodes will hold. Shards are assigned to storage nodes every epoch, roughly proportional to the amount of stake that was delegated to them. By staking with a storage node, users also earn rewards, as they will receive a share of the storage fees.
ar: في Walrus، يمكن لأي شخص تفويض حصة إلى عقد التخزين، ومن خلال القيام بذلك، التأثير على عقد التخزين التي سيتم اختيارها للجنة في العصور المستقبلية، وعدد الشظايا التي ستحملها هذه العقد. يتم تخصيص الشظايا لعقد التخزين في كل عصر، بما يتناسب تقريبًا مع مقدار الحصة التي تم تفويضها لها. من خلال المشاركة مع عقدة تخزين، يكسب المستخدمون أيضًا مكافآت، حيث سيحصلون على حصة من رسوم التخزين.

source: Since moving shards from one storage node to another requires transferring a lot of data, and storage nodes potentially need to expand their storage capacity, the selection of the committee for the next epoch is done ahead of time, in the middle of the previous epoch. This provides sufficient time to storage-node operators to provision additional resources, if needed.
ar: نظرًا لأن نقل الشظايا من عقدة تخزين إلى أخرى يتطلب نقل الكثير من البيانات ، وربما تحتاج عقد التخزين إلى توسيع قدرتها على التخزين ، يتم اختيار اللجنة للعصر التالي في وقت مبكر ، في منتصف الحقبة السابقة. يوفر هذا وقتًا كافيًا لمشغلي عقدة التخزين لتوفير موارد إضافية ، إذا لزم الأمر.

source: For stake to affect the shard distribution in epoch `e` and become "active", it must be staked before the committee for this epoch has been selected, meaning that it has to be staked before the midpoint of epoch `e - 1`. If it is staked after that point in time, it will only influence the committee selection for epoch `e + 1` and thus only become active, and accrue rewards, in that epoch.
ar: لكي تؤثر الحصة على توزيع الشظايا في العصر `e` ويصبح "نشطًا"، يجب أن تتم الحصة قبل اختيار اللجنة لهذا العصر، مما يعني أنه يجب ان تتم الحصة قبل نقطة المنتصف للعصر `e - 1`. إذا تم عمل الحصة عليه بعد تلك النقطة الزمنية، فسوف يؤثر فقط على اختيار اللجنة للعصر `e + 1` وبالتالي يصبح نشطًا فقط، ويحصل على المكافآت، في ذلك العصر.

source: Unstaking has a similar delay: because unstaking funds only has an effect on the committee in the next committee selection, the stake will remain active until that committee takes over. This means that, to unstake at the start of epoch `e`, the user needs to "request withdrawal" before the midpoint of epoch `e - 1`. Otherwise, that is, if the user unstakes after this point, the stake will remain active, and continue to accrue rewards, throughout epoch `e`, and the balance and rewards will be available to withdraw at the start of epoch `e + 1`.
ar: لا يوجد تأخير مماثل: نظرًا لأن الأموال غير المستقرة لها فقط تأثير على اللجنة في اختيار اللجنة التالية ، ستبقى الحصة نشطة حتى تتولى تلك اللجنة. هذا يعني أنه ، من أجل إلغاء الانتصار في بداية العصر ، يحتاج المستخدم إلى "طلب الانسحاب" قبل كتلة البيانات منتصف العصر `e - 1`. وإلا ، فهذا ، إذا لم يتفوق المستخدم بعد هذه الكتلة ، فستظل الحصة نشطة ، وتستمر في تراكم المكافآت ، في جميع أنحاء العصر ، وسيكون التوازن والمكافآت AVA Ilable للانسحاب في بداية العصر `e + 1`.

source: How to stake with the Walrus Staking dApp
ar: كيفية المشاركة في تطبيق الحصة اللامركزي من Walurs

source: The Walrus Staking dApp allows users to stake (or unstake) to any of the storage nodes of the system.
ar: يتيح تطبيق الحصة اللامركزي من Walurs للمستخدمين إنشاء حصة لعملاهم (أو إلغائها) لأي من عقد التخزين للنظام.

source: To use the dApp, visit <https://stake.walrus.site> and connect your wallet:
ar: لاستخدام DAPP ، تفضل بزيارة <https://stake.walrus.site> وتوصيل محفظتك:

source: Click the `Connect Wallet` button at the top right corner.
ar: انقر فوق الزر "Connect Wallet" في الزاوية اليمنى العليا.

source: Select the wallet (if the wallet was connected before, this and the next step won't be required).
ar: حدد المحفظة (إذا كانت المحفظة متصلة من قبل ، فلن تكون هناك حاجة إلى الخطوة التالية).

source: Approve the connection.
ar: الموافقة على الاتصال.

source: (Make sure the selected wallet network is Testnet).
ar: (تأكد من أن شبكة المحفظة المحددة هي الشبكة التجريبية).

source: Exchange Testnet SUI to WAL
ar: تبادل عملات الشبكة التجريبية SUI إلى WAL

source: To be able to stake you will need to have Testnet WAL in your wallet. You can exchange your Testnet SUI to WAL using the dApp as follows:
ar: لتكون قادرًا على المشاركة ، ستحتاج إلى عملات WAL التجريبية في محفظتك. يمكنك تبادل عملات الشبكة التجريبية SUI إلى WAL باستخدام التطبيق اللامركزي على النحو التالي:

source: Click the `Get WAL` button.
ar: انقر فوق الزر "الحصول على وول".

source: Select the amount of SUI. This will be exchanged to WAL at a 1:1 rate.
ar: حدد مقدار SUI. سيتم تبادل هذا إلى Wal بمعدل 1: 1.

source: And click `Exchange`.
ar: وانقر فوق "التبادل".

source: _Follow the instructions in your wallet to approve the transaction._
ar: تتبع الإرشادات الموجودة في محفظتك للموافقة على المعاملة._

source: Stake
ar: حصة

source: Find the storage node that you want to stake to.
ar: ابحث عن عقدة التخزين التي تريد مشاركتها.

source: Below the system stats, there is the list of the \
ar: أسفل إحصائيات النظام، توجد قائمة \

source: You can select one of the nodes in that list or, if the storage node is not in the current committee, you find all the storage nodes at the bottom of the page.
ar: يمكنك تحديد إحدى العقد في تلك القائمة أو، إذا لم تكن عقدة التخزين موجودة في اللجنة الحالية، فستجد جميع عقد التخزين في أسفل الصفحة.

source: Once you selected the storage node, click the stake button.
ar: بمجرد تحديد عقدة التخزين، انقر فوق الزر حصة.

source: Select the amount of WAL.
ar: حدد مقدار Wal.

source: Click Stake.
ar: انقر فوق حصة.

source: Unstake
ar: إلغاء

source: Find the `Staked WAL` you want to unstake.
ar: ابحث عن "وول" الذي تريده.

source: Below the \
ar: أسفل \

source: Also you can expand a storage node and find all your stakes with that node.
ar: كما يمكنك توسيع عقدة التخزين والعثور على كل حصصك باستخدام تلك العقدة.

source: Depending on the state of the `Staked WAL` you will be able to unstake or Withdraw your funds.
ar: اعتمادًا على حالة "وول" ، ستتمكن من إلغاء أو سحب أموالك.

source: Click the `Unstake` or `Withdraw` button.
ar: انقر فوق الزر "Unstake" أو "سحب".

source: Click continue to confirm your action.
ar: انقر فوق متابعة لتأكيد إجراءاتك.

source: As inspiration, we provide several simple examples in different programming languages to interact with Walrus through the various interfaces. They are located at <https://github.com/MystenLabs/walrus-docs/tree/main/examples> and described below.
ar: كمصدر إلهام ، نقدم العديد من الأمثلة البسيطة في لغات البرمجة المختلفة للتفاعل مع Walrus من خلال واجهات مختلفة. وهي موجودة في <https://github.com/mystenlabs/walrus-docs/tree/main/examples> والموضح أدناه.

source: In addition, we have built actual applications on top of Walrus. The prime example is [Walrus Sites](../walrus-sites/intro.md), with code available in the <https://github.com/MystenLabs/walrus-sites> repository.
ar: بالإضافة إلى ذلك، قمنا ببناء تطبيقات فعلية على Walrus. والمثال الرئيسي على ذلك هو [Walrus Sites](../walrus-sites/intro.md)، مع توفر الكود في مستودع <https://github.com/MystenLabs/walrus-sites>.

source: And for an example of how to build a static website and store it as a Walrus Site with GitHub actions, just look at the [CI workflow](https://github.com/MystenLabs/walrus-docs/blob/main/.github/workflows/publish.yaml) we use to publish this very site.
ar: وللمثال على كيفية إنشاء موقع ويب ثابت وتخزينه كموقع من Walrus مع إجراءات github ، فقط انظر إلى [CI Workflow] (https://github.com/mystenlabs/walrus-docs/كتلة البيانات/main/. github/sorkflows/publish.yaml) نستخدم لنشر هذا الموقع بالذات.

source: Python
ar: بيثون

source: The [Python examples](https://github.com/MystenLabs/walrus-docs/tree/main/examples/python) folder contains a number of examples:
ar: يحتوي المجلد [Python Ampecited] (https://github.com/mystenlabs/walrus-docs/tree/main/examples/python) على عدد من الأمثلة:

source: How to [use the HTTP API](https://github.com/MystenLabs/walrus-docs/blob/main/examples/python/hello_walrus_webapi.py) to store and read a blob.
ar: كيفية [استخدام API http] (https://github.com/mystenlabs/walrus-docs/كتلة البيانات/main/examples/python/hello_walrus_webapi.py) لتخزينها وقراءتها.

source: How to [use the JSON API](https://github.com/MystenLabs/walrus-docs/blob/main/examples/python/hello_walrus_jsonapi.py) to store, read, and check the availability of a blob. Checking the certification of a blob illustrates reading the Blob Sui object that certifies (see the [Walrus Sui reference](../dev-guide/sui-struct.md)).
ar: كيفية [استخدام واجهة برمجة التطبيقات JSON](https://github.com/MystenLabs/walrus-docs/blob/main/examples/python/hello_walrus_jsonapi.py) لتخزين كتلة البيانات وقراءتها والتحقق من توفرها. يوضح التحقق من شهادة الكتلة blob قراءة كتلة البيانات Sui الذي يقوم بالشهادة (انظر [مرجع Walrus Sui](../dev-guide/sui-struct.md)).

source: How to [read information from the Walrus system object](https://github.com/MystenLabs/walrus-docs/blob/main/examples/python/hello_walrus_sui_system.py).
ar: كيفية [قراءة المعلومات من كتلة البيانات نظام WALRUS] (https://github.com/mystenlabs/walrus-docs/كتلة البيانات/main/examples/python/hello_walrus_sui_system.py).

source: How to [track Walrus related Events](https://github.com/MystenLabs/walrus-docs/blob/main/examples/python/track_walrus_events.py).
ar: كيفية [تتبع الأحداث ذات الصلة بالمر] (https://github.com/mystenlabs/walrus-docs/كتلة البيانات/main/examples/python/track_walrus_events.py).

source: JavaScript
ar: جافا سكريبت
