Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: TO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT WILL MYSTEN LABS’ TOTAL LIABILITY ARISING OUT OF OR IN CONNECTION WITH THESE TERMS OR FROM THE USE OF OR INABILITY TO USE THE SERVICES EXCEED THE AMOUNTS YOU HAVE PAID OR ARE PAYABLE BY YOU TO MYSTEN LABS FOR USE OF THE SERVICES OR ONE HUNDRED DOLLARS ($100), IF YOU HAVE NOT HAD ANY PAYMENT OBLIGATIONS TO MYSTEN LABS, AS APPLICABLE.
ar: إلى الحد الأقصى المسموح به بموجب القانون ، لن يتجاوز إجمالي التزام Mysten Labs إجماليه من أو فيما يتعلق بهذه الشروط أو من استخدام أو عدم القدرة على استخدام الخدمات التي تتجاوز المبالغ التي دفعتها أو تدفعها إلى Mysten مختبرات لاستخدام الخدمات أو مائة دولار (100 دولار) ، إذا لم تكن لديك أي التزامات دفع على Mysten Labs ، حسب الاقتضاء.

source: THE EXCLUSIONS AND LIMITATIONS OF DAMAGES SET FORTH ABOVE ARE FUNDAMENTAL ELEMENTS OF THE BASIS OF THE BARGAIN BETWEEN MYSTEN LABS AND YOU.
ar: تعد الاستثناءات والقيود على الأضرار المذكورة أعلاه عناصر أساسية على أساس الصفقة بين Mysten Labs وأنت.

source: XIII. Governing Law and Forum Choice.
ar: الثالث عشر. الحكم القانون واختيار المنتدى.

source: These Terms and any action related thereto will be governed by the Federal Arbitration Act, federal arbitration law, and the laws of the State of California, without regard to its conflict of laws provisions. Except as otherwise expressly set forth in Section XVII “Dispute Resolution,” the exclusive jurisdiction for all Disputes (defined below) that you and Mysten Labs are not required to arbitrate will be the state and federal courts located in the County of Santa Clara, and you and Mysten Labs each waive any objection to jurisdiction and venue in such courts.
ar: سيخضع هذه الشروط وأي إجراء مرتبط بها قانون التحكيم الفيدرالي ، وقانون التحكيم الفيدرالي ، وقوانين ولاية كاليفورنيا ، دون النظر إلى تعارض أحكام القوانين. باستثناء خلاف ذلك ، من المنصوص عليها صراحة في القسم السابع عشر "حل النزاعات" ، فإن الولاية القضائية الحصرية لجميع النزاعات (المحددة أدناه) بأنك و Mysten Labs غير مطلوبة للتحكيم ستكون المحاكم الفيدرالية والمحاكم الفيدرالية الموجودة في مقاطعة سانتا كلارا ، و أنت و Mysten Labs يتنازل كل أي اعتراض على الولاية القضائية والمكان في مثل هذه المحاكم.

source: XIV. Dispute Resolution
ar: الرابع عشر. حل النزاعات

source: <u>Mandatory Arbitration of Disputes</u>. We each agree that any dispute, claim or controversy arising out of or relating to these Terms or the breach, termination, enforcement, interpretation or validity thereof or the use of the Services (collectively, “Disputes”) will be resolved solely by binding, individual arbitration and not in a class, representative or consolidated action or proceeding. You and Mysten Labs agree that the U.S. Federal Arbitration Act governs the interpretation and enforcement of these Terms, and that you and Mysten Labs are each waiving the right to a trial by jury or to participate in a class action. This arbitration provision shall survive termination of these Terms.
ar: <u> التحكيم الإلزامي للنزاعات </u>. كلنا نتفق على أن أي نزاع أو مطالبة أو جدل ناشئ عن هذه المصطلحات أو تتعلق بهذه الشروط أو خرق أو إنهاء أو إنفاذ أو تفسير أو صحة أو استخدام الخدمات (مجتمعة ، "نزاعات") سيتم حلها فقط عن طريق الربط ، التحكيم الفردي وليس في الفصل أو التمثيلية أو الإجراءات الموحدة أو الإجراء. توافق أنت و Mysten Labs على أن قانون التحكيم الفيدرالي الأمريكي يحكم التفسير والإنفاذ تتنازل كل من هذه المصطلحات ، وأنك أنت و Mysten Labs تتنازل عن الحق في محاكمة من قبل هيئة المحلفين أو المشاركة في إجراء جماعي. يجب أن ينجو هذا الحكم التحكيم من إنهاء هذه الشروط.

source: <u>Exceptions</u>. As limited exceptions to Section XVII(A) above: (i) we both may seek to resolve a Dispute in small claims court if it qualifies; and (ii) we each retain the right to seek injunctive or other equitable relief from a court to prevent (or enjoin) the infringement or misappropriation of our intellectual property rights.
ar: <u> الاستثناءات </u>. كاستثناءات محدودة للقسم السابع عشر (أ) أعلاه: (1) قد نسعى إلى حل نزاع في محكمة المطالبات الصغيرة إذا كان مؤهلاً ؛ و (2) نحتفظ كل منا بالحق في البحث عن ما قضائي أو غيره من الإغاثة المنصفة من محكمة لمنع (أو توضيح) انتهاك حقوق الملكية الفكرية (أو توضيحها).

source: <u>Conducting Arbitration and Arbitration Rules</u>. The arbitration will be conducted by the American Arbitration Association (“AAA”) under its Consumer Arbitration Rules (the “AAA Rules”) then in effect, except as modified by these Terms. The AAA Rules are available at www.adr.org or by calling 1-800-778-7879. A party who wishes to start arbitration must submit a written Demand for Arbitration to AAA and give notice to the other party as specified in the AAA Rules. The AAA provides a form Demand for Arbitration at [<u>www.adr.org</u>](http://www.adr.org). Any arbitration hearings will take place in the county (or parish) where you live, unless we both agree to a different location. The parties agree that the arbitrator shall have exclusive authority to decide all issues relating to the interpretation, applicability, enforceability and scope of this arbitration agreement.
ar: <u> إجراء قواعد التحكيم والتحكيم </u>. سيتم إجراء التحكيم من قبل جمعية التحكيم الأمريكية ("AAA") بموجب قواعد تحكيم المستهلك ("قواعد AAA") ثم في الواقع ، باستثناء تعديل هذه الشروط. تتوفر قواعد AAA على www.adr.org أو عن طريق الاتصال بالرقم 1-800-778-7879. يجب أن يقدم الطرف الذي يرغب في بدء التحكيم طلبًا مكتوبًا على التحكيم إلى AAA وإبلاغ الطرف الآخر كما هو محدد في قواعد AAA. يوفر AAA نموذجًا ديما nd للتحكيم في [<u> www.adr.org </u>] (http://www.adr.org). ستعقد أي جلسات تحكيم في المقاطعة (أو الرعية) حيث تعيش ، إلا إذا وافقنا على موقع مختلف. يتفق الطرفان على أن المحكم يجب أن يكون له سلطة حصرية لتحديد جميع القضايا المتعلقة بالتفسير وقابلية التطبيق وقابلية التنفيذ ونطاق اتفاقية التحكيم هذه.

source: <u>Arbitration Costs</u>. Payment of all filing, administration and arbitrator fees will be governed by the AAA Rules, and we won’t seek to recover the administration and arbitrator fees we are responsible for paying, unless the arbitrator finds your Dispute frivolous. If we prevail in arbitration we’ll pay all of our attorneys’ fees and costs and won’t seek to recover them from you. If you prevail in arbitration you will be entitled to an award of attorneys’ fees and expenses to the extent provided under applicable law.
ar: <u> تكاليف التحكيم </u>. سيخضع دفع جميع رسوم الإيداع والإدارة والمحكم لقواعد AAA ، ولن نسعى لاسترداد رسوم الإدارة والمحكم التي نكون مسؤولين عن الدفع ، ما لم يجد المحكم نزاعك تافهة. إذا سادنا في التحكيم ، فسندفع جميع أتعاب المحاماة وتكاليفنا ولن نسعى لاستردادها منك. إذا سادت في التحكيم ، فسيحق لك الحصول على جائزة أتعاب المحاماة ونفقاتها إلى الحد IDed بموجب القانون المعمول به.

source: <u>Injunctive and Declaratory Relief</u>. Except as provided in Section XIV(B) above, the arbitrator shall determine all issues of liability on the merits of any claim asserted by either party and may award declaratory or injunctive relief only in favor of the individual party seeking relief and only to the extent necessary to provide relief warranted by that party’s individual claim. To the extent that you or we prevail on a claim and seek public injunctive relief (that is, injunctive relief that has the primary purpose and effect of prohibiting unlawful acts that threaten future injury to the public), the entitlement to and extent of such relief must be litigated in a civil court of competent jurisdiction and not in arbitration. The parties agree that litigation of any issues of public injunctive relief shall be stayed pending the outcome of the merits of any individual claims in arbitration.
ar: <u> الإغاثة الزجرية والتعريفية </u>. باستثناء ما هو منصوص عليه في القسم الرابع عشر (ب) أعلاه ، يحدد المحكم جميع قضايا المسؤولية بشأن مزايا أي مطالبة يؤكدها أي من الطرفين وقد يمنح الإغاثة التعريفية أو الزجرية فقط لصالح الطرف الفردي الذي يسعى إلى الإغاثة وفقط إلى حد ما ضروري لتوفير الإغاثة التي يبررها المطالبة الفردية لهذا الطرف. إلى الحد الذي تسود فيه أنت أو سادنا في مطالبة ونبحث عن الإغاثة الزجرية العامة (أي الإغاثة الزجرية ال في أن يكون الغرض الأساسي وتأثير حظر الأفعال غير القانونية التي تهدد الإصابة المستقبلية للجمهور) ، يجب التقاضي في هذا الإغاثة في محكمة قضائية مؤهلة وليس في التحكيم. يتفق الطرفان على أن التقاضي في أي قضايا من الإغاثة الزجرية العامة يجب أن تظل في انتظار نتائج مزايا أي مطالبات فردية في التحكيم.

source: <u>Class Action Waiver</u>. YOU AND MYSTEN LABS AGREE THAT EACH MAY BRING CLAIMS AGAINST THE OTHER ONLY IN YOUR OR ITS INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS OR REPRESENTATIVE PROCEEDING. Further, if the parties’ Dispute is resolved through arbitration, the arbitrator may not consolidate another person’s claims with your claims, and may not otherwise preside over any form of a representative or class proceeding. If this specific provision is found to be unenforceable, then the entirety of this Dispute Resolution section shall be null and void.
ar: <u>إعفاء من الدعاوى الجماعية</u>. أنت وMYSTEN LABS توافقان على أنه يجوز لكل منكما رفع دعاوى ضد الآخر بصفتك الفردية فقط، وليس كمدعٍ أو عضو في مجموعة في أي إجراء جماعي أو تمثيلي مزعوم. علاوة على ذلك، إذا تم حل نزاع الطرفين من خلال التحكيم، فلا يجوز للمحكم دمج مطالبات شخص آخر مع مطالباتك، ولا يجوز له رئاسة أي شكل من أشكال الإجراءات التمثيلية أو الجماعية. إذا تبين أن هذا الحكم المحدد غير قابل للتنفيذ، فإن قسم حل النزاعات هذا بأكمله يكون باطلاً ولاغياً.

source: <u>Severability</u>. With the exception of any of the provisions in Section XVII(F) of these Terms (“**Class Action Waiver**”), if an arbitrator or court of competent jurisdiction decides that any part of these Terms is invalid or unenforceable, the other parts of these Terms will still apply.
ar: <u>قابلية الفصل</u>. باستثناء أي من الأحكام الواردة في القسم السابع عشر (F) من هذه الشروط ("**إعفاء الدعوى الجماعية**")، إذا قرر محكم أو محكمة مختصة أن أي جزء من هذه الشروط غير صالح أو غير قابل للتنفيذ، فإن الأجزاء الأخرى من هذه الشروط ستظل سارية.

source: XV. General Terms
ar: الخامس عشر. المصطلحات العامة

source: <u>Reservation of Rights</u>. Mysten Labs and its licensors exclusively own all right, title and interest in and to the Services, including all associated intellectual property rights. You acknowledge that the Services are protected by copyright, trademark, and other laws of the United States and foreign countries. You agree not to remove, alter or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Services.
ar: <u>احتفاظ بالحقوق</u>. تمتلك Mysten Labs والجهات المرخصة لها حصريًا جميع الحقوق والمصالح في الخدمات، بما في ذلك جميع حقوق الملكية الفكرية المرتبطة بها. أنت تقر بأن الخدمات محمية بموجب حقوق الطبع والنشر والعلامات التجارية والقوانين الأخرى للولايات المتحدة والدول الأجنبية. أنت توافق على عدم إزالة أو تغيير أو إخفاء أي حقوق طبع ونشر أو علامة تجارية أو علامة خدمة أو إشعارات حقوق ملكية أخرى مدمجة في الخدمات أو مصاحبة لها.

source: <u>Entire Agreement</u>. These Terms constitute the entire and exclusive understanding and agreement between Mysten Labs and you regarding the Services, and these Terms supersede and replace all prior oral or written understandings or agreements between Mysten Labs and you regarding the Services. If any provision of these Terms is held invalid or unenforceable by an arbitrator or a court of competent jurisdiction, that provision will be enforced to the maximum extent permissible and the other provisions of these Terms will remain in full force and effect. Except where provided by applicable law in your jurisdiction, you may not assign or transfer these Terms, by operation of law or otherwise, without Mysten Labs’ prior written consent. Any attempt by you to assign or transfer these Terms absent our consent or your statutory right, without such consent, will be null. Mysten Labs may freely assign or transfer these Terms without restriction. Subject to the foregoing, these Terms will bind and inure to the benefit of the parties, their successors and permitted assigns.
ar: <u>الاتفاقية الكاملة</u>. تشكل هذه الشروط التفاهم والاتفاقية الكاملة والحصرية بين Mysten Labs وبينك فيما يتعلق بالخدمات، وتحل هذه الشروط محل جميع التفاهمات أو الاتفاقيات الشفهية أو المكتوبة السابقة بين Mysten Labs وبينك فيما يتعلق بالخدمات. إذا اعتبر محكم أو محكمة مختصة أي شرط من هذه الشروط غير صالح أو غير قابل للتنفيذ، فسيتم فرض هذا الشرط إلى أقصى حد مسموح به وستظل الأحكام الأخرى لهذه الشروط سارية المفعول بالكامل. باستثناء ما ينص عليه القانون المعمول به في ولايتك القضائية، لا يجوز لك التنازل عن هذه الشروط أو نقلها، سواء بموجب القانون أو غير ذلك، دون موافقة كتابية مسبقة من Mysten Labs. أي محاولة من جانبك للتنازل عن هذه الشروط أو نقلها في غياب موافقتنا أو حقك القانوني، دون هذه الموافقة، ستكون باطلة. يجوز لشركة Mysten Labs التنازل عن هذه الشروط أو نقلها بحرية دون قيود. مع مراعاة ما سبق، ستكون هذه الشروط ملزمة وتسري لصالح الأطراف وخلفائهم والمتنازل لهم المسموح لهم.

source: <u>Notices</u>. Any notices or other communications provided by Mysten Labs under these Terms will be given: (i) via email; or (ii) by posting to the Services. For notices made by email, the date of receipt will be deemed the date on which such notice is transmitted.
ar: <u>الإشعارات</u>. سيتم إرسال أي إشعارات أو اتصالات أخرى تقدمها Mysten Labs بموجب هذه الشروط: (أ) عبر البريد الإلكتروني؛ أو (ب) عن طريق النشر في الخدمات. بالنسبة للإشعارات المرسلة عبر البريد الإلكتروني، سيتم اعتبار تاريخ الاستلام هو التاريخ الذي يتم فيه إرسال هذا الإشعار.

source: <u>Waiver of Rights</u>. Mysten Labs’ failure to enforce any right or provision of these Terms will not be considered a waiver of such right or provision. The waiver of any such right or provision will be effective only if in writing and signed by a duly authorized representative of Mysten Labs. Except as expressly set forth in these Terms, the exercise by either party of any of its remedies under these Terms will be without prejudice to its other remedies under these Terms or otherwise.
ar: <u>التنازل عن الحقوق</u>. لن يُعتبر فشل Mysten Labs في فرض أي حق أو حكم من هذه الشروط تنازلاً عن هذا الحق أو الحكم. لن يكون التنازل عن أي حق أو حكم ساريًا إلا إذا كان مكتوبًا وموقعًا من قبل ممثل مفوض بشكل صحيح من Mysten Labs. باستثناء ما هو منصوص عليه صراحةً في هذه الشروط، فإن ممارسة أي من الطرفين لأي من سبل الانتصاف بموجب هذه الشروط ستكون دون الإخلال بسبل الانتصاف الأخرى بموجب هذه الشروط أو غير ذلك.

source: XVI. Contact Information
ar: XVI. معلومات الاتصال

source: If you have any questions about these Terms or the Services, please contact Mysten Labs at [<u>legal@mystenlabs.com</u>](mailto:legal@mystenlabs.com).
ar: إذا كانت لديك أي أسئلة حول هذه الشروط أو الخدمات ، فيرجى الاتصال بـ Mysten Labs على [<u> Legal@mystenlabs.com </u>] (Mailto: Legal@mystenlabs.com).

source: Walrus Glossary
ar: معجم مصطلحات Walurs

source: To make communication as clear and efficient as possible, we make sure to use a single term for every Walrus entity/concept and _do not_ use any synonyms. The following table lists various concepts, their canonical name, and how they relate to or differ from other terms.
ar: ولجعل التواصل واضحًا وفعّالاً قدر الإمكان، نتأكد من استخدام مصطلح واحد لكل كيان/مفهوم من مفاهيم Walrus ولا نستخدم أي مرادفات. يسرد الجدول التالي المفاهيم المختلفة، واسمها الرسمي، وكيف ترتبط أو تختلف عن المصطلحات الأخرى.

source: Italicized terms in the description indicate other specific Walrus terms contained in the table.
ar: تشير المصطلحات المائلة في الوصف إلى مصطلحات Walrus أخرى محددة في الجدول.

source: Approved name
ar: الاسم المعتمد

source: Description
ar: وصف

source: storage node (SN)
ar: عقدة التخزين (SN)

source: entity storing data for Walrus; holds one or several _shards_
ar: كيان يخزن البيانات لـ Walrus؛ يحمل شظية واحدة أو عدة شظايا

source: blob
ar: كتلة بيانات

source: single unstructured data object stored on Walrus
ar: كائن بيانات غير منظم واحد مخزّن على Walrus

source: permanent blob
ar: كتلة بيانات دائمة

source: blob which cannot be deleted by its owner and is guaranteed to be available until at least its expiry epoch (assuming it is valid)
ar: كتلة البيانات التي لا يمكن حذفها من قبل مالكها وضمان أن تكون متاحة حتى على الأقل عصر انتهاء الصلاحية (على افتراض أنها صالحة)

source: deletable blob
ar: الكتل المحذوفة

source: blob which can be deleted by its owner at any time to be able to reuse the storage resource
ar: الكتل التي يمكن حذفها من قبل مالكها في أي وقت لتتمكن من إعادة استخدام مورد التخزين

source: shard
ar: شظية

source: (disjoint) subset of erasure-encoded data of all _blobs_; at every point in time, a _shard_ is assigned to and stored on a single _SN_
ar: مجموعة فرعية (منفصلة) من البيانات المشفرة بالمحو لجميع الكتل؛ في كل نقطة زمنية، يتم تعيين جزء وتخزينه على _SN_ واحد

source: our erasure-encoding approach, which uses two different encodings (_primary_ and _secondary_) to enable shard recovery; details are available in the [whitepaper](./walrus.pdf)
ar: نهجنا في التشفير بالمحو، والذي يستخدم ترميزين مختلفين (أساسي وثانوي) لتمكين استرداد الشظايا؛ التفاصيل متاحة في [الورقة البيضاء](./walrus.pdf)

source: sliver
ar: قطعة صغيرة من الشظية

source: erasure-encoded data of one _shard_ corresponding to a single blob for one of the two encodings; this contains several erasure-encoded symbols of that blob but not the _blob metadata_
ar: بيانات مشفرة للمحو الخاص بواحدة _shard_ المقابلة لكتلة واحدة لواحد من الترميزين ؛ هذا يحتوي على العديد من الرموز المشفرة للمحوّل لتلك الكتلة ولكن ليس metadata_ _كتلة البيانات _

source: sliver pair
ar: زوج قطع صغيرة

source: the combination of a shard’s primary and secondary sliver
ar: مزيج من الشظية الأولية والثانوية للقطعة الصغيرة

source: blob ID
ar: معرف كتلة البيانات

source: cryptographic ID computed from a _blob_’s _slivers_
ar: معرف تشفيري تم حسابه من شرائح _blob_’s _slivers_

source: blob metadata
ar: بيانات وصفية لكتلة البيانات

source: metadata of one _blob_; in particular, this contains a hash per _shard_ to enable the authentication of _slivers_ and recovery symbols
ar: بيانات وصفية لكل _blob_ واحدة؛ على وجه الخصوص، تحتوي هذه على تجزئة لكل _shard_ لتمكين مصادقة القطع الصغيرة ورموز الاسترداد

source: (end) user
ar: (نهاية) المستخدم

source: any entity/person that wants to store or read _blobs_ on/from Walrus; can act as a Walrus client itself or use the simple interface exposed by _publishers_ and _caches_
ar: أي كيان/شخص يريد تخزين أو قراءة _كتل_ على/من Walrus ؛ يمكن أن يكون بمثابة عميل من Walrus نفسه أو استخدام الواجهة البسيطة المكشوفة بواسطة _Publishers_ و _caches_

source: publisher
ar: الناشر

source: service interacting with Sui and the _SNs_ to store _blobs_ on Walrus; offers a simple `HTTP POST` endpoint to _end users_
ar: خدمة تتفاعل مع Sui و _SNs_ لتخزين _blobs_ على Walrus؛ تقدم نقطة نهاية `HTTP POST` بسيطة للمستخدمين النهائيين_

source: aggregator
ar: مجمع

source: service that reconstructs _blobs_ by interacting with _SNs_ and exposes a simple `HTTP GET` endpoint to _end users_
ar: خدمة تعيد بناء الكائنات من خلال التفاعل مع _SNs_ وتعرض نقطة نهاية `HTTP GET` البسيطة للمستخدمين النهائيين

source: cache
ar: ذاكرة التخزين المؤقت

source: an _aggregator_ with additional caching capabilities
ar: _aggregator_ مع قدرات التخزين المؤقت الإضافية

source: (Walrus) client
ar: (Walrus) العميل

source: entity interacting directly with the _SNs_; this can be an _aggregator_/_cache_, a _publisher_, or an _end user_
ar: الكيان يتفاعل مباشرة مع _SNS_ ؛ يمكن أن يكون هذا عبارة عن _aggregator _/_ cache_ ، أو _publisher_ ، أو _end user_

source: (blob) reconstruction
ar: (blob) إعادة البناء

source: decoding of the primary _slivers_ to obtain the blob; includes re-encoding the _blob_ and checking the Merkle proofs
ar: فك تشفير _slivers_ الأساسي للحصول على كتلة البيانات ؛ يتضمن إعادة ترميز _كتلة البيانات_ والتحقق من أدلة Merkle

source: (shard/sliver) recovery
ar: (Shard/Sliver) إسترداد

source: process of an _SN_ recovering a _sliver_ or full _shard_ by obtaining recovery symbols from other _SNs_
ar: عملية استرداد _SN_ استرداد _sliver_ أو full _shard_ عن طريق الحصول على عملات الاسترداد من _SNS_ الأخرى

source: storage attestation
ar: شهادة التخزين

source: process where _SNs_ exchange challenges and responses to demonstrate that they are storing their currently assigned _shards_
ar: عملية حيث تتبادل _SNs_ التحديات والاستجابات لإثبات أنها تخزن _shards_ المخصصة لها حاليًا

source: certificate of availability (CoA)
ar: شهادة التوافر (COA)

source: a _blob ID_ with signatures of _SNs_ holding at least <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.8889em;vertical-align:-0.1944em;"></span><span class="mord">2</span><span class="mord mathnormal" style="margin-right:0.10764em;">f</span><span class="mspace" style="margin-right:0.2222em;"></span><span class="mbin">+</span><span class="mspace" style="margin-right:0.2222em;"></span></span><span class="base"><span class="strut" style="height:0.6444em;"></span><span class="mord">1</span></span></span></span> _shards_ in a specific _epoch_
ar: معرف _كتلة البيانات_ مع توقيعات _SN_ تحتوي على <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.8889em;vertical-align:-0.1944em;"></span><span class="mord">2</span><span class="mord mathnormal" style="margin-right:0.10764em;">f</span><span class="mspace" style="margin-right:0.2222em;"></span><span class="mbin">+</span><span class="mspace" style="margin-right:0.2222em;"></span></span><span class="base"><span class="strut" style="height:0.6444em;"></span><span class="mord">1</span></span></span></span> _shards_ في _epoch_ محدد

source: point of availability (PoA)
ar: نقطة التوفر (PoA)

source: point in time when a _CoA_ is submitted to Sui and the corresponding _blob_ is guaranteed to be available until its expiration
ar: نقطة زمنية يتم فيها تقديم _CoA_ إلى Sui ويتم ضمان توفر _blob_ المقابل حتى انتهاء صلاحيته

source: inconsistency proof
ar: دليل التناقض

source: set of several recovery symbols with their Merkle proofs such that the decoded _sliver_ does not match the corresponding hash; this proves an incorrect/inconsistent encoding by the client
ar: مجموعة من العديد من عملات الاسترداد مع أدلة Merkle الخاصة بهم بحيث لا تتطابق _Sliver_ الذي تم فك تشفيره مع التجزئة المقابلة ؛ هذا يثبت ترميز غير صحيح/غير متسق من قبل العميل

source: inconsistency certificate
ar: شهادة التناقض

source: an aggregated signature from 2/3 of _SNs_ (weighted by their number of _shards_) that they have seen and stored an _inconsistency proof_ for a _blob ID_
ar: توقيع مجمعة من 2/3 من _SNS_ (مرجح بعددهم من _shards_) التي رأواها وتخزينها

source: storage committee
ar: لجنة التخزين

source: the set of _SNs_ for a _storage epoch_, including metadata about the _shards_ they are responsible for and other metadata
ar: مجموعة _SNS_ لـ _storage حقبة_ ، بما في ذلك البيانات الوصفية حول _shards_ التي تكون مسؤولة عن البيانات الوصفية الأخرى

source: member
ar: عضو

source: an _SN_ that is part of a _committee_ at some _epoch_
ar: _SN_ هذا جزء من _Committee_ في بعض _epoch_

source: storage epoch
ar: عصر التخزين

source: the epoch for Walrus as distinct to the epoch for Sui
ar: عصر Walrus متميزًا عن عصر Sui

source: availability period
ar: فترة التوفر

source: the period specified in _storage epochs_ for which a _blob_ is certified to be available on Walrus
ar: الفترة المحددة في _storage epoch_ والتي تم اعتماد _blob_ لتكون متاحة على Walrus

source: expiry
ar: انتهاء الصلاحية

source: the end epoch at which a blob is no longer available and can be deleted; the end epoch is always exclusive
ar: عصر النهاية الذي لم تعد فيه الكتلة متاحة ويمكن حذفها ؛ إن End Epoch حصرية دائمًا

source: the native Token of Walrus
ar: الرمز الأصلي من Walrus

source: the smallest unit of WAL (similar to MIST for SUI); 1 WAL is equal to 1 billion (1000000000) FROST
ar: أصغر وحدة من WAL (على غرار Mist for Sui) ؛ 1 وول يساوي 1 مليار (1000000000) الصقيع

source: TESTNET TERMS OF SERVICE - WALRUS
ar: شروط الخدمة شبكة Walrus التجريبية -
