Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: A [JavaScript example](https://github.com/MystenLabs/walrus-docs/tree/main/examples/javascript) is provided showing how to upload and download a blob through a web form using the HTTP API.
ar: يتم توفير [مثال JavaScript] (https://github.com/mystenlabs/walrus-docs/tree/main/examples/javaScript) مما يوضح كيفية تحميل وتنزيل كتلة البيانات من خلال نموذج ويب باستخدام API HTTP.

source: Move
ar: لغة Move

source: For more complex applications, you may want to interact with Walrus on-chain objects. For that purpose, the currently deployed Walrus contracts are included [in our GitHub repository](https://github.com/MystenLabs/walrus-docs/tree/main/contracts).
ar: للتطبيقات الأكثر تعقيدًا ، قد ترغب في التفاعل مع الكائنات على التواصل. لهذا الغرض ، يتم تضمين عقود Walrus التي تم نشرها حاليًا [في مستودع github لدينا] (https://github.com/mystenlabs/walrus-docs/tree/main/contracts).

source: Furthermore, we provide a simple [example contract](https://github.com/MystenLabs/walrus-docs/tree/main/examples/move) that imports and uses the Walrus objects.
ar: علاوة على ذلك ، نحن نقدم [مثال على العقد] (https://github.com/mystenlabs/walrus-docs/tree/main/examples/move) يستورد ويستخدم كتلةات Walrus.

source: ```admonish tip title="Debug logging" You can enable debug logging for Walrus by setting the environment variable `RUST_LOG=walrus=debug`. ```
ar: `` `exmonish tip title =" Debug Logging " يمكنك تمكين تسجيل تصحيح الأخطاء Walrus عن طريق تعيين متغير البيئة `Rust_Log = Walrus = debug`. `` `

source: Latest binary
ar: أحدث ثنائي

source: Before undertaking any other steps, make sure you have the [latest `walrus` binary](./setup.md#installation). If you have multiple versions in different locations, find the binary that will actually be used with `which walrus`.
ar: قبل القيام بأي خطوات أخرى، تأكد من حصولك على [أحدث ملف ثنائي لبرنامج `walrus`](./setup.md#installation). إذا كان لديك إصدارات متعددة في مواقع مختلفة، فابحث عن الملف الثنائي الذي سيتم استخدامه فعليًا مع `which walrus`.

source: Old hardware or incompatible VMs
ar: الأجهزة القديمة أو VMs غير المتوافقة

source: Our standard Ubuntu binary is known to cause problems on certain old hardware and in certain virtualized environments. If you experience errors like "Illegal instruction (core dumped)", [install](./setup.md#installation) the `ubuntu-x86_64-generic` version instead, which is compiled specifically to be compatible with almost all physical and virtual x86-64 CPUs.
ar: من المعروف أن ملفاتنا الثنائية القياسية الخاصة بنظام التشغيل Ubuntu تتسبب في حدوث مشكلات في بعض الأجهزة القديمة وفي بعض البيئات الافتراضية. إذا واجهت أخطاء مثل "تعليمات غير قانونية (تم تفريغ النواة)"، فقم بتثبيت (./setup.md#installation)`ubuntu-x86_64-generic` بدلاً من ذلك، والذي تم تجميعه خصيصًا ليكون متوافقًا مع جميع وحدات المعالجة المركزية x86-64 المادية والافتراضية تقريبًا.

source: Latest Walrus configuration
ar: أحدث تكوين لـWalrus

source: The Walrus Testnet is wiped periodically and requires updating to the latest binary and configuration. If you get an error like "could not retrieve enough confirmations to certify the blob", you are probably using an outdated configuration pointing to an inactive Walrus system. In this case, update your configuration file with the latest [configuration](./setup.md#configuration) and make sure the CLI uses the intended configuration.
ar: يتم مسح شبكة اختبار Walrus بشكل دوري وتتطلب التحديث إلى أحدث ملف ثنائي وتكوين. إذا تلقيت خطأ مثل "لم يتم استرداد تأكيدات كافية لإصدار شهادة للكتلة"، فمن المحتمل أنك تستخدم تكوينًا قديمًا يشير إلى نظام Walrus غير نشط. في هذه الحالة، قم بتحديث ملف التكوين الخاص بك بأحدث [إعدادات](./setup.md#configuration) وتأكد من أن واجهة سطر الأوامر تستخدم التكوين المقصود.

source: Correct Sui network configuration
ar: تكوين شبكة Sui الصحيح

source: If you get an error like "the specified Walrus system object does not exist", make sure your wallet is set up for Sui **Testnet** and you use the latest [configuration](./setup.md#configuration).
ar: إذا حصلت على خطأ مثل "كتلة البيانات نظام Walrus المحدد غير موجود"، فتأكد من إعداد محفظتك لـ Sui **Testnet** واستخدام أحدث [إعدادات](./setup.md#configuration).

source: _Walrus Sites_ are "web"-sites that use Sui and Walrus as their underlying technology. They are a prime example of how Walrus can be used to build new and exciting decentralized applications. Anyone can build and deploy a Walrus Site and make it accessible to the world! Funnily, this documentation is itself available as a Walrus Site at <https://docs.walrus.site/walrus-sites/intro.html> (if you aren't there already).
ar: _walrus sites_ هي "الويب"-التي تستخدم Sui و Walrus كتقنية أساسية. إنها مثال رئيسي على كيفية استخدام Walrus لبناء تطبيقات لا مركزية جديدة ومثيرة. يمكن لأي شخص بناء ونشر موقع Walrus وجعله في متناول العالم! من الممتع ، أن هذه الوثائق متوفرة في حد ذاتها كموقع من Walrus في <https://docs.walrus.site/walrus-sites/intro.html> (إذا لم تكن هناك بالفعل).

source: At a high level, here are some of the most exciting features:
ar: على مستوى عالٍ، إليك بعض الميزات الأكثر إثارة:

source: Publishing a site does not require managing servers or complex configurations; just provide the source files (produced by your favorite web framework), publish them to Walrus Sites using the [site-builder tool](./overview.md#the-site-builder), and you are done!
ar: لا يتطلب نشر موقع إدارة الخوادم أو تكوينات معقدة؛ فقط قم بتوفير ملفات المصدر (التي أنتجها إطار الويب المفضل لديك)، ونشرها على مواقع Walrus باستخدام [أداة إنشاء الموقع](./overview.md#the-site-builder)، وأصبح الموقع جاهز!

source: Sites can be linked to from ordinary Sui objects. This feature enables, for example, creating an NFT collection in which _every single NFT_ has a _personalized website dedicated to it_.
ar: يمكن ربط المواقع من كتلةات SUI العادية. تتيح هذه الميزة ، على سبيل المثال ، إنشاء مجموعة NFT التي تحتوي فيها _every Single NFT_ على موقع ويب شخصي مخصص لـ IT_.

source: Walrus Sites are owned by addresses on Sui and can be exchanged, shared, and updated thanks to Sui's flexible programming model. This means, among other things, that Walrus Sites can leverage the [SuiNS](https://suins.io/) naming system to have human-readable names. No more messing around with DNS!
ar: تملك مواقع Walrus عناوين على Sui ويمكن تبادلها ومشاركتها وتحديثها بفضل نموذج البرمجة المرن لـ Sui. هذا يعني ، من بين أشياء أخرى ، أن مواقع Walrus يمكن أن تستفيد من نظام التسمية [suins] (https://suins.io/) للحصول على أسماء قابلة للقراءة البشرية. لا مزيد من العبث مع DNS!

source: Thanks to Walrus's decentralization and extremely high data availability, there is no risk of having your site wiped for no reason.
ar: بفضل اللامركزية في Walrus وتوافر البيانات العالي للغاية، لا يوجد خطر من القضاء على موقعك دون سبب.

source: Since they live on Walrus, these sites cannot have a backend in the traditional sense, and can be therefore considered "static" sites. However, the developer can integrate with Sui-compatible wallets and harness Sui's programmability to add backend functionality to Walrus Sites!
ar: نظرًا لأنهم يعيشون على Walrus، فلا يمكن لهذه المواقع أن يكون لها واجهة خلفية بالمعنى التقليدي، وبالتالي يمكن اعتبارها مواقع "ثابتة". ومع ذلك، يمكن للمطور التكامل مع محافظ متوافقة مع Sui والاستفادة من قابلية برمجة Sui لإضافة وظائف الواجهة الخلفية إلى مواقع Walrus!

source: Show me
ar: أرني

source: To give you a very high-level intuition of how Walrus Sites work, let's look at an example: A simple NFT collection on Sui that has a frontend dApp to mint the NFTs hosted on Walrus Sites, and in which _each NFT_ has a _specific, personalized Walrus Site_.
ar: لإعطائك حدس رفيع المستوى لكيفية عمل مواقع Walrus ، دعونا نلقي نظرة على مثال: مجموعة NFT بسيطة على Sui تحتوي على مقدمة مقدمة للنعن المخصص Walrus site_.

source: You can check out the mint page at <https://flatland.walrus.site/>. This site is served to your browser through the Walrus Site _portal_ <https://walrus.site>. While the portal's operation is explained in a [later section](./portal.md), consider for now that there can be many portals (hosted by whoever wants to have their own, and even on `localhost`). Further, the only function of the portal is to provide the browser with some code (specifically, a service worker) that allows it to fetch the Walrus Site from Sui and Walrus.
ar: يمكنك الاطلاع على صفحة النعناع على <https://flatland.walrus.site/>. يتم تقديم هذا الموقع إلى متصفحك من خلال بوابة موقع Walrus <https://walrus.site>. وبينما يتم شرح تشغيل البوابة في [قسم لاحق](./portal.md)، ضع في اعتبارك الآن أنه يمكن أن يكون هناك العديد من البوابات (التي يستضيفها أي شخص يريد أن يكون لديه بوابة خاصة به، وحتى على `localhost`). علاوة على ذلك، فإن الوظيفة الوحيدة للبوابة هي تزويد المتصفح ببعض التعليمات البرمجية (على وجه التحديد، عامل خدمة) التي تسمح له بجلب موقع Walrus من Sui وWalrus.

source: If you have a Sui wallet with some Testnet SUI, you can try and "mint a new Flatlander" from the site. This creates an NFT from the collection and shows you two links: one to the explorer, and one to the "Flatlander site". This latter site is a special Walrus Site that exists only for that NFT, and has special characteristics (the background color, the image, ...) that are based on the contents of the NFT.
ar: إذا كان لديك محفظة Sui مع بعض عملات Sui التجريبية، فيمكنك محاولة "Mint a New Flatlander" من الموقع. هذا ينشئ NFT من المجموعة ويظهر لك رابطين: واحد إلى المستكشف ، وواحد إلى "موقع Flatlander".هذا الموقع الأخير هو موقع Walrus خاص موجود فقط لهذا NFT، وله خصائص خاصة (لون الخلفية، الصورة، ...) تستند إلى محتويات NFT.

source: The URL to this per-NFT site looks something like this: `https://2hzpawjycxuiuh36047yocxapc69g8ercrypa7ccsk8ek4iqu6.walrus.site/`. You'll notice that the domain remains `walrus.site`, but the subdomain is a long and random-looking string. This string is actually the [Base36](https://en.wikipedia.org/wiki/Base36) encoding of the object ID of the NFT, which is [0x644bc958...](https://suiscan.xyz/testnet/object/0x644bc958052463785c026a13be051d579c8a4d2dc93b1874dce5839d4fb18c5e).
ar: يبدو عنوان URL لهذا الموقع المخصص لكل NFT على هذا النحو: `https://2hzpawjycxuiuh36047yocxapc69g8ercrypa7ccsk8ek4iqu6.walrus.site/`. ستلاحظ أن النطاق يظل `walrus.site`، لكن النطاق الفرعي عبارة عن سلسلة طويلة وعشوائية المظهر. هذه السلسلة هي في الواقع ترميز [Base36](https://en.wikipedia.org/wiki/Base36) لمعرف كتلة البيانات NFT، وهو [0x644bc958...](https://suiscan.xyz/testnet/object/0x644bc958052463785c026a13be051d579c8a4d2dc93b1874dce5839d4fb18c5e).

source: In summary:
ar: ملخص:

source: Walrus Sites are served through a portal; in this case, `https://walrus.site`. There can be many portals, and anyone can host one.
ar: يتم تقديم مواقع Walrus من خلال بوابة؛ في هذه الحالة، `https://walrus.site`. يمكن أن يكون هناك العديد من البوابات، ويمكن لأي شخص استضافة واحدة منها.

source: The subdomain on the URL points to a specific object on Sui that allows the browser to fetch and render the site resources. This pointer can be
ar: يشير المجال الفرعي الموجود في عنوان URL إلى كائن محدد على Sui يسمح للمتصفح بجلب موارد الموقع وعرضها. يمكن أن يكون هذا المؤشر

source: a SuiNS name, such as `flatland` in `https://flatland.walrus.site`, or
ar: اسم SuiNS، مثل `flatland` في `https://flatland.walrus.site`، أو

source: the Base36 encoding of a the Sui object ID, such as `0x644bc958...` in the example above.
ar: ترميز BASE36 لمعرف كتلة البيانات SUI ، مثل `0x644BC958 ...` في المثال أعلاه.

source: Curious to know how this magic is possible? Read the [technical overview](./overview.md)! If you just want to get started trying Walrus Sites out, check the [tutorial](./tutorial.md).
ar: هل تريد معرفة كيفية تحقيق هذا السحر؟ اقرأ [النظرة العامة الفنية](./overview.md)! إذا كنت تريد فقط البدء في تجربة مواقع Walrus، فراجع [البرنامج التعليمي](./tutorial.md).

source: This tutorial walks you through the steps necessary to publish a Walrus Site. We also provide the instructions on how to add a SuiNS name to it for convenient browsing.
ar: يرشدك هذا البرنامج التعليمي خلال الخطوات اللازمة لنشر موقع Walrus. كما نقدم إرشادات حول كيفية إضافة اسم SuiNS إليه لتسهيل التصفح.

source: This section describes the steps necessary to setup the Walrus Sites' `site-builder` tool and prepare your environment for development.
ar: يصف هذا القسم الخطوات اللازمة لإعداد أداة "باني الموقع" وإعداد بيئتك للتنمية.

source: Prerequisites
ar: المتطلبات الأساسية

source: Before you start, make sure you
ar: قبل أن تبدأ ، تأكد من ذلك

source: have a recent version of [Rust](https://www.rust-lang.org/tools/install) installed;
ar: احصل على نسخة حديثة من [Rust] (https://www.rust-lang.org/tools/install) ؛

source: have `git` installed; and
ar: تم تثبيت `git` ؛ و

source: followed all [Walrus setup instructions](../usage/setup.md).
ar: اتبعت جميع [تعليمات إعداد Walrus](../usage/setup.md).

source: Then, follow these additional setup steps.
ar: ثم ، اتبع خطوات الإعداد الإضافية هذه.

source: Clone the repository and build the `site-builder` tool
ar: استنساخ المستودع وإنشاء أداة "بناء الموقع"

source: First, clone and enter the Walrus Sites repo from <https://github.com/MystenLabs/walrus-sites>:
ar: أولاً ، استنساخ وإدخال مواقع Walrus من <https://github.com/mystenlabs/walrus-sites>:

source: Then, build the release version of the site builder:
ar: ثم قم ببناء الإصدار الإصداري لمنشئ الموقع:

source: After the build process completes, you are ready to run the site builder:
ar: بعد اكتمال عملية الإنشاء ، تكون مستعدًا لتشغيل منشئ الموقع:

source: Now that everything is installed and configured, you should be able to start publishing your first Walrus Site!
ar: الآن بعد أن تم تثبيت كل شيء وتكوينه ، يجب أن تكون قادرًا على بدء نشر موقع Walrus الأول!

source: Select the source material for the site
ar: حدد مصدر المواد للموقع

source: The `site-builder` works by uploading a directory of files produced by any web framework to Walrus and adding the relevant metadata to Sui. This directory should have a file called `index.html` in its root, which will be the entry point to the Walrus Site.
ar: يعمل "منشئ الموقع" عن طريق تحميل دليل للملفات التي ينتجها أي إطار عمل ويب إلى Walrus وإضافة البيانات الوصفية ذات الصلة إلى Sui. يجب أن يحتوي هذا الدليل على ملف يسمى "index.html" في جذره، والذي سيكون نقطة الدخول إلى موقع Walrus.

source: For the rest of the tutorial, we will use as an example the simple site contained in `./examples/snake`.
ar: بالنسبة لبقية البرنامج التعليمي، سوف نستخدم كمثال الموقع البسيط الموجود في `./examples/snake`.

source: Publish the site
ar: نشر الموقع

source: Since we have placed the `walrus` binary and configuration in their default locations, publishing the `./examples/snake` site is as simple as calling the publishing command:
ar: نظرًا لأننا وضعنا الملف الثنائي `walrus` والتكوين في مواقعهما الافتراضية، فإن نشر موقع `./examples/snake` بسيط مثل استدعاء أمر النشر:

source: The end of the output should look like the following:
ar: يجب أن تبدو نهاية الإخراج كما يلي:

source: This output tells you that, for each file in the folder, a new Walrus blob was created, and the respective blob ID. Further, it prints the object ID of the Walrus Site object on Sui (so you can have a look in the explorer and use it to set the SuiNS name) and, finally, the URL at which you can browse the site.
ar: يخبرك هذا الإخراج أنه لكل ملف في المجلد ، تم إنشاء كتلة البيانات Walrous الجديد ، ومعرف كتلة البيانات المعني. علاوة على ذلك ، يطبع معرف كتلة البيانات كتلة البيانات موقع Walrus على Sui (بحيث يمكنك إلقاء نظرة على المستكشف واستخدامه لتعيين اسم Suins) ، وأخيراً عنوان URL الذي يمكنك من خلاله تصفح الموقع.

source: Note here that we are passing the default config `./sites-config.yaml` as the config for the site builder. The configuration file is necessary to ensure that the `site-builder` knows the correct Sui package for the Walrus Sites logic.
ar: لاحظ هنا أننا نمرر التكوين الافتراضي `./sites-config.yaml` باعتباره التكوين لمنشئ الموقع. يعد ملف التكوين ضروريًا للتأكد من أن `site-builder` يعرف حزمة Sui الصحيحة لمنطق Walrus Sites.

source: More details on the configuration of the `site-builder` can be found under the [advanced configuration](./builder-config.md) section.
ar: يمكن العثور على مزيد من التفاصيل حول تكوين `site-builder` ضمن قسم [التكوين المتقدم](./builder-config.md).

source: Update the site
ar: تحديث الموقع

source: Let's say now you want to update the content of the site, for example by changing the title from "eat all the blobs!" to "Glob all the Blobs!".
ar: دعنا نقول الآن أنك تريد تحديث محتوى الموقع ، على سبيل المثال عن طريق تغيير العنوان من "Eat All the كائنات!" إلى "Goll All the كائنات!".

source: First, make this edit on in the `./examples/snake/index.html` file.
ar: أولاً، قم بإجراء هذا التعديل في الملف `./examples/snake/index.html`.

source: Then, you can update the existing site by running the `update` command, providing the directory where to find the updated files (still `./example/snake`) and the object ID of the existing site (`0x407a3081...`):
ar: بعد ذلك، يمكنك تحديث الموقع الحالي عن طريق تشغيل الأمر `update`، وتوفير الدليل الذي يمكنك من خلاله العثور على الملفات المحدثة (ما زال `./example/snake`) ومعرف الكتلة للموقع الحالي (`0x407a3081...`):

source: The output this time should be:
ar: يجب أن يكون الإخراج هذه المرة:

source: Compared to the `publish` action, we can see that now the only actions performed were to delete the old `index.html`, and update it with the newer one.
ar: بالمقارنة مع إجراء "النشر" ، يمكننا أن نرى أن الإجراءات الوحيدة التي تم تنفيذها هي حذف "Index.html" القديم ، وتحديثه بالأحدث.

source: Browsing to the provided URL should reflect the change. You've updated the site!
ar: يجب أن يعكس التصفح إلى عنوان URL المقدم التغيير. لقد قمت بتحديث الموقع!

source: ```admonish danger title="Extending the expiration date of an existing site" To extend the expiration date of a previously-stored site, use the `update` command with the `--force` flag, and specify the number of additional epochs (from the current epoch) with the `--epochs` flag. ```
ar: `` `` intermonish danger title = "توسيع تاريخ انتهاء صلاحية موقع موجود" لتوسيع تاريخ انتهاء الموقع الذي تم تخزينه مسبقًا ، استخدم الأمر "تحديث" مع علامة "-فورس" ، وحدد عدد الأعمدة الإضافية (من الحقبة الحالية) مع العلم-العلم. `` `

source: Browsing a URL like `https://1lupgq2auevjruy7hs9z7tskqwjp5cc8c5ebhci4v57qyl4piy.walrus.site` is not particularly nice. Therefore, Walrus Sites allows to use SuiNS names (this is like DNS for Sui) to assign a human-readable name to a Walrus Site. To do so, you simply have to get a SuiNS name you like, and point it to the object ID of the Walrus Site (as provided by the `publish` or `update` commands).
ar: إن تصفح عنوان URL مثل `https://1lupgq2auevjruy7hs9z7tskqwjp5cc8c5ebhci4v57qyl4piy.walrus.site` ليس أمرًا لطيفًا بشكل خاص. لذلك، يسمح لك موقع Walrus باستخدام أسماء SuiNS (هذا يشبه DNS لـ Sui) لتعيين اسم يمكن قراءته بواسطة البشر لموقع Walrus. للقيام بذلك، عليك ببساطة الحصول على اسم SuiNS الذي تريده، وتوجيهه إلى معرف الكتلة لموقع Walrus (كما هو موضح بواسطة الأمرين `publish` أو `update`).

source: Let's do this step by step.
ar: دعونا نفعل هذه خطوة بخطوة.

source: Get a SuiNS name
ar: احصل على اسم Suins

source: Navigate to <https://testnet.suins.io> and buy a domain name with your Testnet wallet. For example, `walrusgame` (this specific one is already taken, choose another you like).
ar: انتقل إلى <https://testnet.suins.io> واشترِ اسم نطاق باستخدام محفظة Testnet الخاصة بك. على سبيل المثال، `walrusgame` (هذا النطاق محجوز بالفعل، اختر نطاقًا آخر يعجبك).

source: Map the SuiNS name to the Walrus Site
ar: قم بتخطيط اسم Suins إلى موقع Walrus

source: Now, you can set the SuiNS name to point to the address of your Walrus Site. To do so, go to the ["names you own"](https://testnet.suins.io/account/my-names) section of the SuiNS website, click on the "three dots" menu icon above the name you want to map, and click "Link To Wallet Address". Paste in the bar the object ID of the Walrus Site, check that it is correct, and click "Apply".
ar: الآن، يمكنك تعيين اسم SuiNS ليشير إلى عنوان موقع Walrus الخاص بك. للقيام بذلك، انتقل إلى قسم ["الأسماء التي تملكها"](https://testnet.suins.io/account/my-names) بموقع SuiNS الإلكتروني، وانقر على أيقونة القائمة "النقاط الثلاث" أعلى الاسم الذي تريد ربطه، وانقر على "ربط بعنوان المحفظة". الصق معرف الكائن الخاص بموقع Walrus في الشريط، وتحقق من صحته، وانقر على "تطبيق".

source: After approving the transaction, we can now browse <https://walrusgame.walrus.site>!
ar: بعد الموافقة على المعاملة ، يمكننا الآن تصفح <https://walrusgame.walrus.site>!

source: Keep reading to learn about the advanced features of Walrus Sites, including configuring the site builder, specifying headers and routing for site resources, and _redirecting Sui objects to Walrus Sites_ to create per-object websites!
ar: استمر في القراءة للتعرف على الميزات المتقدمة لمواقع Walrus ، بما في ذلك تكوين منشئ الموقع ، وتحديد الرؤوس والتوجيه لموارد الموقع ، و _redecting كتلةات SUI إلى مواقع Walrus_ لإنشاء مواقع الويب لكل كتلة البيانات!

source: We now describe in more detail the commands available through the site builder.
ar: نصف الآن بمزيد من التفصيل الأوامر المتاحة من خلال منشئ الموقع.

source: `publish`
ar: "النشر"

source: The `publish` command, as described in the [previous section](./tutorial-publish.md), publishes a new site on Sui. The command takes a directory as input and creates a new Walrus Site from the resources contained within.
ar: يقوم الأمر `publish`، كما هو موضح في [القسم السابق](./tutorial-publish.md)، بنشر موقع جديد على Sui. يأخذ الأمر دليلاً كمدخل وينشئ موقع Walrus جديدًا من الموارد الموجودة بداخله.

source: The `--epochs` flag allows you to specify for how long the site data will be stored on Walrus. By default, this is set to `1` epoch.
ar: تتيح لك علامة `-حقبةs" تحديد المدة التي سيتم تخزين بيانات الموقع على Walrus. بشكل افتراضي ، تم تعيين هذا على "1".

source: ```admonish danger title="Epoch duration on Walrus Testnet" On Walrus Testnet, one epoch will last **1 day**. Therefore, consider storing your site for a large number of epochs if you want to make it available for the following months! The maximum duration is set to 200 epochs. ```
ar: `` `exmonish danger title =" حقبة مدة على شبكة Walrus التجريبية " على Walrus الشبكة التجريبية ، ستستمر حقبة واحدة ** يوم واحد **. لذلك ، فكر في تخزين موقعك للكبير عدد الأحداث إذا كنت تريد إتاحتها للأشهر التالية! الحد الأقصى مدة ضبط على 200 عصر. `` `

source: If you are just uploading raw files without an `index.html`, you may want to use the `--list-directory` flag, which will automatically create an index page to browse the files. See for example <https://bin.blob.store>.
ar: إذا كنت تقوم فقط بتحميل ملفات RAW بدون `index.html` ، فقد ترغب في استخدام علامة"-قائم الدليل "، والتي ستقوم تلقائيًا بإنشاء صفحة فهرس لتصفح الملفات. انظر على سبيل المثال <https://bin.كتلة البيانات.store>.

source: The `publish` command will also respect the instructions in the `ws-resources.json` configuration file. To know more, see the section on [specifying headers and routing](./routing.md).
ar: سيحترم الأمر `publish` أيضًا التعليمات الواردة في ملف تكوين `ws-resources.json`. لمعرفة المزيد، راجع القسم الخاص بـ [تحديد الرؤوس والتوجيه](./routing.md).

source: `update`
ar: "تحديث"

source: This command is the equivalent of `publish`, but for updating an existing site. It takes the same arguments, with the addition of the Sui object ID of the site to update.
ar: هذا الأمر هو ما يعادل "نشر" ، ولكن لتحديث موقع موجود. يستغرق نفس الوسائط ، مع إضافة معرف كتلة البيانات SUI للموقع للتحديث.

source: `convert`
ar: "تحويل"

source: The `convert` command converts an object ID in hex format to the equivalent Base36 format. This command is useful if you have the Sui object ID of a Walrus Site, and want to know the subdomain where you can browse it.
ar: يحول الأمر `convert` معرف كتلة البيانات بتنسيق Hex إلى تنسيق Base36 المكافئ. يكون هذا الأمر مفيدًا إذا كان لديك معرف كتلة البيانات SUI لموقع Walrus ، ويريد معرفة النطاق الفرعي حيث يمكنك تصفحه.
