Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: **AI-related use cases:** Walrus can store clean data sets of training data, datasets with a known and verified provenance, model weights, and proofs of correct training for AI models. Or it may be used to store and ensure the availability and authenticity of an AI model output.
ar: **حالات استخدام متعلقة بالذكاء الاصطناعي:** يمكن لـWalrus تخزين مجموعات بيانات نظيفة من بيانات التدريب، ومجموعات البيانات ذات المصدر المعروف والموثق، وأوزان النماذج، وإثباتات التدريب الصحيح لنماذج الذكاء الاصطناعي. أو يمكن استخدامه لتخزين وضمان توفر ومصداقية مخرجات نموذج الذكاء الاصطناعي.

source: **Storage of long term archival of blockchain history:** Walrus can be used as a lower-cost decentralized store to store blockchain history. For Sui, this can include sequences of checkpoints with all associated transaction and effects content, as well as historic snapshots of the blockchain state, code, or binaries.
ar: **تخزين الأرشفة طويلة الأجل لتاريخ البلوك تشين:** يمكن استخدام Walrus كمخزن لا مركزي منخفض التكلفة لتخزين تاريخ البلوك تشين. بالنسبة إلى Sui، يمكن أن يشمل ذلك تسلسلات من نقاط التدقيق مع كل محتوى المعاملات والتأثيرات المرتبطة بها، بالإضافة إلى لقطات تاريخية لحالة البلو تشين أو الكود أو الثنائيات.

source: **Support availability for L2s:** Walrus enables parties to certify the availability of blobs, as required by L2s that need data to be stored and attested as available to all. This may also include the availability of extra audit data such as validity proofs, zero-knowledge proofs of correct execution, or large fraud proofs.
ar: ** توافر الدعم لشبكات الطبقات الثانية: ** يمكّن Walrus الأطراف من التصديق على توافر كتل البيانات، كما هو مطلوب من قبل شبكات الطبقة الثانية التي تحتاج إلى تخزين البيانات وتشهدها على أنها متاحة للجميع. قد يتضمن ذلك أيضًا توفر بيانات التدقيق الإضافية مثل أدلة الصلاحية أو أدلة المعرفة الصفرية للتنفيذ الصحيح أو براهين الاحتيال الكبيرة.

source: **Support a full decentralized web experience:** Walrus can host full decentralized web experiences including all resources (such as js, css, html, and media). These can provide content but also host the UX of dapps, enabling fully decentralized front- and back-ends on chain. It brings the full "web" back into "web3".
ar: **دعم تجربة ويب لامركزية كاملة: ** يمكن لـ Walrus استضافة تجارب ويب لامركزية كاملة بما في ذلك جميع الموارد (مثل js و css و html والوسائط). ويمكنها توفير المحتوى، ولكن يمكنها أيضًا استضافة تجربة المستخدم للتطبيقات اللامركزية، مما يتيح لامركزية كاملة في الواجهة الأمامية والخلفية على السلسلة. إنها تعيد ”الويب“ الكامل إلى ”الويب3“.

source: **Support subscription models for media:** Creators can store encrypted media on Walrus and only provide access via decryption keys to parties that have paid a subscription fee or have paid for content. (Note that Walrus provides the storage; encryption and decryption must be done off Walrus).
ar: ** دعم نماذج الاشتراك للوسائط: ** يمكن للمبدعين تخزين الوسائط المشفرة على Walrus وتوفير الوصول فقط عبر مفاتيح فك التشفير للأطراف التي دفعت رسوم الاشتراك أو دفعت مقابل المحتوى. (لاحظ أن Walrus يوفر التخزين ؛ يجب أن يتم التشفير وفك التشفير قبالة Walrus).

source: We are excited to see what else the web3 developer community can imagine!
ar: نحن متحمسون لمعرفة ما يمكن أن يتخيله مجتمع مطور Web3!

source: Getting Started
ar: البدء

source: For this developer preview the public Walrus Devnet is openly available to all developers. Developer documentation is available at <https://docs.walrus.site>.
ar: بالنسبة للعرض التمهيدي للمطور، فإن شبكة Walrus العامة للمطور متاحة علنًا لجميع المطورين. تتوفر وثائق المطورين على <https://docs.walrus.site>.

source: SUI Testnet token is the main currency for interacting with Walrus. Developers pay for Walrus Devnet storage using SUI Testnet tokens which can be acquired at the [Sui Testnet Discord faucet](https://discord.com/channels/916379725201563759/1037811694564560966).
ar: عملات Sui على الشبكة التجريبية هي العملة الرئيسية للتفاعل مع Walrus. يدفع المطورون مقابل تخزين Walrus على شبكة المطور باستخدام عملات Sui على الشبكة التجريبية التي يمكن الحصول عليها في [Sui الشبكة التجريبية صنبور ديسكورد] (https://discord.com/channels/916379725201563759/103781169456460966).

source: One more thing …
ar: شيء آخر ..

source: The [Walrus Sites website](https://walrus.site), the [Walrus docs](https://docs.walrus.site), and [this very blog](https://blog.walrus.site) are hosted on Walrus. To learn more about Walrus Sites and how you can deploy your own, [click here](https://docs.walrus.site/walrus-sites/intro.html).
ar: The [Walrus Sites Website] (https://walrus.site) ، و [مستندات Walrus] (https://docs.walrus.site) ، و [هذه المدونة ذاتها] (https://blog.walrus.site) يتم استضافتها على Walrus. لمعرفة المزيد حول مواقع Walrus وكيف يمكنك نشر خاص بك ، [انقر هنا] (https://docs.walrus.site/walrus-sites/intro.html).

source: Published on: 2024-08-12
ar: تم النشر في: 2024-08-12

source: We have redeployed the Walrus Devnet to incorporate various improvements to the Walrus storage nodes and clients. In this process, all blobs stored on Walrus were wiped. Note that this may happen again on Devnet and Testnet, but obviously _not on the future Mainnet_.
ar: لقد قمنا بإعادة نشر شبكة Walrus للمطور لدمج التحسينات المختلفة لعقد تخزين Walrus والعملاء. في هذه العملية، تم مسح جميع كتل البيانات المخزنة على Walrus. لاحظ أن هذا قد يحدث مرة أخرى على شبكة المطور و الشبكة التجريبية ، ولكن من المؤكد أنه لن يحدث على الشبكة الرئيسية_ في المستقبل.

source: Migration and Re-deployment of Walrus Sites
ar: الهجرة وإعادة نشر مواقع Walrus

source: You can obtain the latest version of the `walrus` binary and the new configuration as described in the [setup chapter](../usage/setup.md).
ar: يمكنك الحصول على أحدث إصدار من الملف الثنائي `walrus` والتكوين الجديد كما هو موضح في [فصل الإعداد](../usage/setup.md).

source: If you had deployed any Walrus Sites, the site object on Sui and any SuiNS name are still valid. However, you need to re-store all blobs on Walrus. You can achieve this by running the site-builder tool (from the `walrus-sites` directory) as follows:
ar: إذا كنت قد نشرت أي مواقع من Walrus ، فإن كتلة البيانات الموقع على SUI وأي اسم Suins لا يزال صالحًا. ومع ذلك ، تحتاج إلى إعادة تخزين جميع الكتل على Walrus. يمكنك تحقيق ذلك من خلال تشغيل أداة بناء الموقع (من دليل "Walrus-Sites`) على النحو التالي:

source: Changes
ar: التغييرات

source: Besides many improvements to the storage nodes, the new version of Walrus includes the following user-facing changes:
ar: إلى جانب العديد من التحسينات على عقد التخزين ، يتضمن الإصدار الجديد من Walrus التغييرات التالية التي تواجه المستخدم:

source: Improved coin management: The client now better selects coins for gas and storage fees. Users no longer require multiple coins in their wallet.
ar: إدارة العملة المحسنة: يختار العميل الآن عملات أفضل لرسوم الغاز والتخزين. لم يعد المستخدمون يحتاجون إلى عملات متعددة في محفظتهم.

source: Improved connection management: The client now limits the number of parallel connections to improve performance for users with low network bandwidth storing large blobs.
ar: إدارة الاتصال المحسّنة: يحد العميل الآن عدد الاتصالات المتوازية لتحسين الأداء للمستخدمين الذين يعانون من عرض النطاق الترددي منخفض الشبكة لتخزين الكتل الكبيرة.

source: OpenAPI specification: Walrus storage nodes, aggregators, and publishers expose their API specifications at the path `/v1/api`.
ar: مواصفات OpenAPI: تعرض عقد تخزين Walrus ومجمّعات وناشرو Walrus مواصفات واجهة برمجة التطبيقات الخاصة بهم في المسار '/v1/API'.

source: System info in JSON: The `info` command is now also available in JSON mode.
ar: معلومات النظام في JSON: يتوفر أمر ”المعلومات“ الآن أيضًا في وضع JSON.

source: Client version: The `walrus` CLI now has a `--version` option.
ar: إصدار العميل: لدى "Win Walrus` CLI الآن" خيار "version".

source: Support for the empty blob: The empty blob is now supported by Walrus.
ar: دعم الكتلة الفارغة: يتم الآن دعم الكتلة الفارغة من قبل Walrus.

source: Default configuration-file paths: The client now looks for configuration files in `~/.config/walrus` in addition to `~/.walrus` and recognizes the extension `.yml` in addition to `.yaml`.
ar: مسارات ملف التكوين الافتراضية: يبحث العميل الآن عن ملفات التكوين في `~/.config/walrus` بالإضافة إلى` ~/.walrus` ويتعرف على امتداد `.Iml` بالإضافة إلى` .yaml`.

source: Home directory in paths: Paths specified in configuration files now expand the `~` symbol at the beginning to the user's home directory.
ar: الدليل الرئيسي في المسارات: المسارات المحددة في ملفات التكوين الآن قم بتوسيع الرمز `~` في بداية الدليل الرئيسي للمستخدم.

source: More robust store and status check: The `store` and `blob-status` commands are now more robust against Sui full nodes that aggressively prune past events and against load-balancers that send transactions to different full nodes.
ar: المزيد من أوامر المتجر والحالة الأكثر قوة: أصبحت أوامر "المتجر" و "كتلة البيانات-status" أكثر قوة ضد العقد الكاملة SUI التي تقلب الأحداث الماضية بقوة وضد محاذاة الحمل التي ترسل المعاملات إلى العقد الكاملة المختلفة.

source: Fix CLI parsing: The `walrus` CLI now properly handles hyphens in blob IDs.
ar: إصلاح تحليل CLI: تتعامل ”واجهة برمجة تطبيقات CLI“ الآن بشكل صحيح مع الواصلات في معرّفات كتل البيانات.

source: This update also increases the number of shards to 1000, which is more representative of the expected value in Testnet and Mainnet.
ar: يزيد هذا التحديث أيضًا من عدد الشظايا إلى 1000، وهو أكثر تمثيلا للقيمة المتوقعة في الشبكة التجريبية و الشبكة الرئيسية.

source: Announcing the Official Walrus Whitepaper
ar: الإعلان عن ورقة Walrus البيضاء الرسيمة

source: In June, Mysten Labs announced Walrus, a new decentralized secure blob store design, and introduced a developer preview that currently stores over [12TiB](https://capacity.walrus.site/) of data. [Breaking the Ice](https://info.breakingtheice.sui.io/) gathered over 200 developers to build apps leveraging decentralized storage.
ar: في يونيو، أعلنت Mysten Labs عن Walrus، وهو تصميم جديد لتخزين البيانات اللامركزي الآمن، وقدمت معاينة للمطورين تخزن حاليًا أكثر من 12TiB (https://capacity.walrus.site/) من البيانات. كما جمع حدث [Breaking the Ice](https://info.breakingtheice.sui.io/) أكثر من 200 مطور لبناء تطبيقات تستفيد من التخزين اللامركزي.

source: It is time to unveil the next stage of the project: Walrus will become an independent decentralized network with its own utility token, WAL, that will play a key role in the operation and governance of the network. Walrus will be operated by storage nodes through a delegated proof-of-stake mechanism using the WAL token. An independent Walrus foundation will encourage the advancement and adoption of Walrus, and support its community of users and developers.
ar: لقد حان الوقت للكشف عن المرحلة التالية من المشروع: ستصبح Walrus شبكة لا مركزية مستقلة مع رمزها الخاص ، Wal ، التي ستلعب دورًا رئيسيًا في تشغيل الشبكة وحوكمة الشبكة. سيتم تشغيل Walrus بعقد التخزين من خلال آلية إثبات الإبداع المفوضية باستخدام Wal Token. ستشجع مؤسسة Walrus المستقلة التقدم واعتماد Walrus ، ودعم مجتمعها من المستخدمين والمطورين.

source: Today, we published the Walrus [whitepaper](../walrus.pdf) (also on [GitHub](https://github.com/MystenLabs/walrus-docs/blob/main/docs/walrus.pdf)) that offers additional details, including:
ar: اليوم، نشرنا [الورقة البيضاء] (.. /walrus.pdf) (أيضًا على [GitHub] (https://github.com/MystenLabs/walrus-docs/blob/main/docs/walrus.pdf)) التي تقدم تفاصيل إضافية، بما في ذلك:

source: The encoding scheme and Read / Write operations Walrus uses to ensure both security and efficient scaling to 100s and 1000s of storage nodes, including interactions with the Sui blockchain which serves as a coordination layer for Walrus’ operations.
ar: نظام التشفير وعمليات القراءة / الكتابة التي يستخدمها Walrus لضمان كل من الأمان والتوسيع الفعال إلى 100 و 1000 من عقد التخزين، بما في ذلك التفاعلات مع بلوكتشين Sui التي تعمل كطبقة تنسيق لعمليات Walrus.

source: The reconfiguration of storage nodes across epochs, and how the protocol ensures available blobs on Walrus remain available over long periods of time.
ar: إعادة تكوين عقد التخزين عبر الحقبة ، وكيف يضمن البروتوكول الكتل المتاحة على Walrus متاحًا على مدار فترات طويلة من الزمن.

source: The tokenomics of Walrus based on the WAL token, including how staking and staking rewards are structured, how pricing and payments for storage are handled and distributed in each epoch, and the governance of key system parameters.
ar: اقتصادات Walrus القائمة على عملة WAL، بما في ذلك كيفية هيكلة الحصة ومكافآت الحصة، وكيفية التعامل مع التسعير والمدفوعات للتخزين وتوزيعها في كل عصر، وحوكمة معلمات النظام الرئيسية.

source: Forward-looking design options, such as a cheap mechanism to challenge and audit storage nodes, options for ensuring reads with a higher service quality, possibly against a payment, and designs that empower light nodes to meaningfully contribute to the protocol’s robustness, serve reads, and be rewarded.
ar: خيارات التصميم التطلعية ، مثل آلية رخيصة لتحدي العقد وتدقيق تخزين ، وخيارات لضمان القراءات بجودة خدمة أعلى ، ربما ضد الدفع ، والتصميمات التي تمكن العقد الإضاءة من المساهمة بشكل مفيد في متانة البروتوكول ، تخدم القراءات ، تخدم ، ، تقرأ ، وتكافأ.

source: The whitepaper focuses on the steady-state design aspects of Walrus. Further details about the project, such as timelines, opportunities for community participation, how to join the network as a storage node, and plans around light nodes, will be shared in subsequent posts.
ar: تركز الورقة البيضاء على جوانب تصميم الحالة المستقرة في Walrus. سيتم مشاركة مزيد من التفاصيل حول المشروع ، مثل الجداول الزمنية ، وفرص مشاركة المجتمع ، وكيفية الانضمام إلى الشبكة كعقدة تخزين ، والخطط حول العقد الخفيفة ، في المنشورات اللاحقة.

source: To be part of this journey:
ar: لكي تكون جزءًا من هذه الرحلة:

source: Follow us on [Twitter](https://x.com/WalrusProtocol)
ar: تابعنا على [Twitter] (https://x.com/walrusprotocol)

source: Join our [Discord](https://discord.com/invite/walrusprotocol)
ar: انضم إلى [Discord] (https://discord.com/invite/walrusprotocol)

source: [Build apps](../index.md) on Walrus
ar: [بناء التطبيقات] (../index.md) على Walrus

source: [Publish a Walrus Site](../walrus-sites/intro.md) and share it
ar: [نشر موقع Walrus] (../ Walrus-sites/intro.md) وشاركه

source: Published on: 2024-10-17
ar: نشرت على: 2024-10-17

source: Today, a community of operators launches the first public Walrus Testnet. This is an important milestone in validating the operation of Walrus as a decentralized blob store, by operating it on a set of independent storage nodes, that change over time through a delegated proof of stake mechanism. The Testnet also brings functionality updates relating to governance, epochs, and blob deletion.
ar: اليوم، أطلق مجتمع من المشغلين أول شبكة اختبار عامة لـ Walrus. وهذا يمثل إنجازًا مهمًا في التحقق من صحة تشغيل Walrus كمخزن كتل لامركزي، من خلال تشغيله على مجموعة من عقد التخزين المستقلة، والتي تتغير بمرور الوقت من خلال آلية إثبات الحصة المفوضة. كما تجلب الشبكة الاختبارية تحديثات وظيفية تتعلق بالحوكمة والعصور وحذف الكائنات.

source: Blob deletion
ar: حذف الكتلة

source: The most important user-facing new feature is optional blob deletion. The uploader of a blob can optionally indicate a blob is "deletable". This information is stored in the Sui blob metadata object, and is also included in the event denoting when the blob is certified. Subsequently, the owner of the Sui blob metadata object can "delete" it. As a result storage for the remaining period is reclaimed and can be used by subsequent blob storage operations.
ar: أهم ميزة جديدة مواجهة المستخدم هي حذف كتلة البيانات اختياري. يمكن أن يشير تحميل كتلة البيانات اختياريًا إلى أن الكتلة "قابلة للحذف". يتم تخزين هذه المعلومات في كتلة البيانات Metadata Sui كتلة البيانات ، ويتم تضمينه أيضًا في الحدث الذي يشير إلى متى يتم اعتماد كتلة البيانات. بعد ذلك ، يمكن لمالك كتلة البيانات Metadata Sui كتلة البيانات "حذفه". نتيجة لتخزين النتيجة للفترة المتبقية ، يمكن استخدامها ويمكن استخدامها بواسطة عمليات تخزين كتلة البيانات اللاحقة.

source: Blob deletion allows more fine-grained storage cost management: smart contracts that wrap blob metadata objects can define logic that stores blobs and delete them to minimize costs, and reclaim storage space before Walrus epochs end.
ar: يتيح حذف كتلة البيانات المزيد من إدارة تكاليف التخزين: العقود الذكية التي ترفع كتلةات بيانات التعريف التي يمكن أن تحدد المنطق الذي يخزن الكتل وحذفها لتقليل التكاليف ، واستعادة مساحة التخزين قبل انتهاء عصر Walrus.

source: However, blob deletion is not an effective privacy mechanism in itself: copies of the blob may exist outside Walrus storage nodes on caches and end-user stores or devices. Furthermore, if the identical blob is stored by multiple Walrus users, the blob will still be available on Walrus until no copy exists. Thus deleting your own copy of a blob cannot guarantee that it is deleted from Walrus as a whole.
ar: ومع ذلك ، فإن حذف كتلة البيانات ليس آلية خصوصية فعالة في حد ذاتها: قد توجد نسخ من الكتلة خارج عقد تخزين Walrus على ذاكرة التخزين المؤقت ومخازن المستخدمين النهائيين. علاوة على ذلك ، إذا تم تخزين الكتلة المتطابقة من قبل متعددة من مستخدمي Walrus ، فستظل الكتلة متاحة على Walrus حتى لا توجد نسخة. وبالتالي ، لا يمكن لحذف نسختك الخاصة من ALOB ضمان حذفها من Walrus ككل.

source: Find out how to [upload and delete deletable blobs](../usage/client-cli.md#reclaiming-space-via-deletable-blobs) through the CLI.
ar: تعرف على كيفية [تحميل وحذف الكائنات القابلة للحذف](../usage/client-cli.md#reclaiming-space-via-deletable-blobs) من خلال واجهة سطر الأوامر CLI.

source: Find out more about how [delete operations work](../dev-guide/dev-operations.md#delete).
ar: تعرف على المزيد حول كيفية [حذف عمليات العمل] (../dev-guide/dev-porations.md#delete).

source: Epochs
ar: العصور

source: Walrus Testnet enables multiple epochs. Initially, the epoch duration is set to a single day to ensure the logic of epoch change is thoroughly tested. At Mainnet, epochs will likely be multiple weeks long.
ar: تتيح شبكة Walrus التجريبية إمكانية تشغيل عصور متعددة. في البداية، يتم ضبط مدة العصر على يوم واحد لضمان اختبار منطق تغيير العصر بدقة. في الشبكة الرئيسية، من المرجح أن تستمر العصور لعدة أسابيع.

source: The progress of epochs makes the expiry epoch of blobs meaningful, and blobs will become unavailable after their expiry epoch. The store command may be used to extend the expiry epoch of a blob that is still available. This operation is efficient and only affects payments and metadata, and does not re-upload blob contents.
ar: تقدم تقدم الحقبة عصرًا انتهاء الصلاحية ذات معنى ، وستصبح الكتل غير متوفرة بعد فترة انتهاء الصلاحية. يمكن استخدام أمر المتجر لتوسيع عصر انتهاء الصلاحية من الكتلة التي لا تزال متوفرة. هذه العملية فعالة ولا تؤثر إلا على المدفوعات والبيانات الوصفية ، ولا تعيد تحميل محتويات كتلة البيانات.

source: Find out the [current epoch](../usage/client-cli.md#walrus-system-information) through the CLI.
ar: اكتشف [العصر الحالي] (../ use/client-cli.md#walrus-system-information) من خلال CLI.

source: Find out how to store a blob for [multiple epochs](../usage/client-cli.md#storing-querying-status-and-reading-blobs).
ar: تعرف على كيفية تخزين كتلة البيانات كبيرة لمدة [عدة عصور](../usage/client-cli.md#storing-querying-status-and-reading-blobs).

source: The WAL token and the Testnet WAL faucet
ar: عملة WAL و صنبور عملة WAL على الشبكة التجريبية

source: Payments for blob storage and extending blob expiry are denominated in Testnet WAL, a Walrus token issued on the Sui Testnet. Testnet WAL has no value, and an unlimited supply; so no need to covet or hoard it, it's just for testing purposes and only issued on Sui Testnet.
ar: يتم تصميم مدفوعات تخزين الكتلة وتوسيع نطاق انتهاء الكتلة في شبكة Wal التجريبية، عملة Walrus الصادرة على شبكة Sui التجريبية. شبكة Wal التجريبية ليس له قيمة ، وعرض غير محدود ؛ لذلك لا حاجة إلى الطمع أو تخزينها ، إنها فقط لأغراض الاختبار والتي تم إصدارها فقط على Sui الشبكة التجريبية.

source: WAL also has a smaller unit called FROST, similar to MIST for SUI. 1 WAL is equal to 1 billion (1000000000) FROST.
ar: لدى Wal أيضًا وحدة أصغر تسمى Frost ، على غرار Mist for Sui. 1 وول يساوي 1 مليار (1000000000) الصقيع.

source: To make Testnet WAL available to all who want to experiment with the Walrus Testnet we provide a utility and smart contract to convert Testnet SUI (which also has no value) into Testnet WAL using a one-to-one exchange rate. This is chosen arbitrarily, and generally one should not read too much into the actual WAL denominated costs of storage on Testnet. They have been chosen arbitrarily.
ar: لإتاحةلشبكة Wal التجريبية لجميع الذين يرغبون في تجربة Walrus الشبكة التجريبية ، نقدم أداة فائدة وعقدًا ذكيًا لتحويل الشبكة التجريبية Sui (الذي ليس له قيمة أيضًا) إلى الشبكة التجريبية Wal باستخدام سعر صرف فردي. يتم اختيار هذا بشكل تعسفي ، وعمومًا لا ينبغي للمرء أن يقرأ الكثير في التكاليف الفعلية للتخزين في WAL على الشبكة التجريبية. لقد تم اختيارهم بشكل تعسفي.

source: Find out how to [request Testnet WAL tokens](../usage/setup.md#testnet-wal-faucet) through the CLI.
ar: تعرف على كيفية [طلب عملات Testnet WAL](../usage/setup.md#testnet-wal-faucet) من خلال CLI.

source: Decentralization through staking & unstaking
ar: اللامركزية من خلال الحصة وإلغاء الحصة

source: The WAL token may also be used to stake with storage operators. Staked WAL can be unstaked and re-staked with other operators or used to purchase storage.
ar: يمكن أيضًا استخدام Wal Token للمشاركة مع مشغلي التخزين. يمكن أن تكون STAKED WAL غير مخبأة وإعادة ستخطها مع مشغلي آخرين أو تستخدم لشراء التخزين.

source: Each epoch storage nodes are selected and allocated storage shards according to their delegated stake. At the end of each epoch payments for storing blobs for the epoch are distributed to storage nodes and those that delegate stake to them. Furthermore, important network parameters (such as total available storage and storage price) are set by the selected storage operators each epoch according to their stake weight.
ar: يتم اختيار كل عقد تخزين في الحقبة وتخصيص شرائح التخزين وفقًا لحصتها المفوضة. في نهاية كل مدفوعات كل عصر لتخزين النقص للعصر يتم توزيعها على عقد التخزين وتلك التي تبرزها. علاوة على ذلك ، يتم تحديد معلمات الشبكة المهمة (مثل إجمالي سعر التخزين والتخزين المتاح) من قبل مشغلي التخزين المحددين لكل فترة وفقًا لوزن حصتها.

source: A staking web dApp is provided to experiment with this functionality. Community members have also created explorers that can be used to view storage nodes when considering who to stake with. Staking ensures that the ultimate governance of Walrus, directly in terms of storage nodes, and indirectly in terms of parameters and software they chose, rests with WAL Token holders.
ar: تم توفير تطبيق ويب لامركزي للحصة "Stkaing" لتجربة هذه الوظيفة. كما أنشأ أعضاء المجتمع مستكشفات يمكن استخدامها لعرض عقد التخزين عند التفكير في من سيتم إنشاء حصة معه. تضمن الحصة أن الإدارة النهائية لـ Walrus، بشكل مباشر من حيث عقد التخزين، وبشكل غير مباشر من حيث المعلمات والبرمجيات التي اختاروها، تقع على عاتق حاملي عملة WAL.

source: Under the hood and over the next months we will be testing many aspects of epoch changes and storage node committee changes: better shard allocation mechanisms upon changes or storage node stake; efficient ways to sync state between storage nodes; as well as better ways for storage nodes to follow Sui event streams.
ar: تحت الغطاء وعلى مدار الأشهر المقبلة ، سنختبر العديد من جوانب التغييرات في العصر وتغييرات لجنة عقدة التخزين: آليات تخصيص شظية بشكل أفضل عند التغييرات أو حصة عقدة التخزين ؛ طرق فعالة لمزامنة الحالة بين عقد التخزين ؛ بالإضافة إلى طرق أفضل لتخزين العقد لمتابعة تدفقات الأحداث SUI.

source: Explore the [Walrus staking dApp](https://stake.walrus.site).
ar: استكشف [تطبيق Walrus للحصة] (https://stake.walrus.site).

source: Look at recent activity on the [Walrus Explorer](https://walruscan.com/testnet/home).
ar: قم بإلقاء نظرة على النشاط الأخير على [Walrus Explorer](https://walruscan.com/testnet/home).

source: New Move contracts & documentation
ar: عقود و مستندات Move الجديدة
