Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: Summary
ar: ملخص

source: Dev Blog
ar: مدونة المطور

source: Blog Preface
ar: مقدمة المدونة

source: Announcing Walrus
ar: الإعلان عن Walrus

source: Devnet Update
ar: تحديث شبكة المطور

source: Announcing the Walrus Whitepaper
ar: الإعلان عن ورقة Walrus البيضاء

source: Announcing Testnet
ar: الإعلان عن الشبكة التجريبية

source: Design
ar: التصميم

source: Objectives and use cases
ar: الأهداف وحالات الاستخدام

source: Overview
ar: ملخص

source: Architecture
ar: البنيان

source: Encoding
ar: التشفير

source: Operations
ar: العمليات

source: Sui operations
ar: عمليات SUI

source: Off-chain operations
ar: العمليات خارج السلسلة

source: Properties
ar: خصائص

source: Future discussion
ar: مناقشة مستقبلية

source: Usage
ar: الاستخدام

source: Setup
ar: تنصيب

source: Interacting with Walrus
ar: التفاعل مع Walrus

source: Using the client CLI
ar: استخدام واجهة سطر الأوامر للعميل

source: Using the client JSON API
ar: استخدام واجهة برمجة تطبيقات JSON الخاصة بالعميل

source: Using the client HTTP API
ar: استخدام واجهة برمجة تطبيقات HTTP للعميل

source: Developer guide
ar: دليل المطور

source: Components
ar: عناصر

source: Sui structures
ar: هياكل Sui

source: Operator guide
ar: دليل المشغل

source: Storage node
ar: عقدة التخزين

source: Aggregator
ar: مجمع

source: Stake and Unstake
ar: الحصة وإلغائها

source: Examples
ar: أمثلة

source: Troubleshooting
ar: استكشاف الأخطاء وإصلاحها

source: Walrus Sites
ar: مواقع Walrus

source: Introduction to Walrus Sites
ar: مقدمة لمواقع Walrus

source: Your first Walrus Site
ar: أول موقع لك من Walrus

source: Installing the site builder
ar: تثبيت منشئ الموقع

source: Publishing a Walrus Site
ar: نشر موقع Walrus

source: Bonus: Set a SuiNS name
ar: علاوة: اضبط اسم Suins

source: Advanced functionality
ar: وظيفة متقدمة

source: Site builder commands
ar: أوامر منشئ الموقع

source: Advanced site-builder configuration
ar: إعدادات بناء المواقع المتقدمة

source: Specifying headers and routing
ar: تحديد الرؤوس والتوجيه

source: Linking from and to Walrus Sites
ar: الربط من وإلى مواقع Walrus

source: Redirecting objects to Walrus Sites
ar: إعادة توجيه الأشياء إلى مواقع Walrus

source: Technical overview
ar: نظرة عامة فنية

source: The Walrus Sites portal
ar: بوابة مواقع Walrus

source: Site data authentication
ar: مصادقة بيانات الموقع

source: Known restrictions
ar: القيود المعروفة

source: Terms of service
ar: شروط الخدمة

source: Glossary Testnet terms of service Privacy policy
ar: شروط خدمة الشبكة التجريبية سياسة الخصوصية

source: Welcome to the developer documentation for Walrus, a decentralized storage and data availability protocol designed specifically for large binary files, or "blobs". Walrus focuses on providing a robust but affordable solution for storing unstructured content on decentralized storage nodes while ensuring high availability and reliability even in the presence of Byzantine faults.
ar: مرحبًا بك في وثائق المطورين لـWalrus، هو بروتوكول تخزين وتوافر بيانات لامركزي مصمم خصيصًا للملفات الثنائية الكبيرة، أو "كتل البيانات". يركز Walrus على توفير حل قوي ولكن بأسعار معقولة لتخزين المحتوى غير المنظم على عقد تخزين لامركزية مع ضمان التوافر العالي والموثوقية حتى في وجود أخطاء بيزنطية.

source: ```admonish tip title="Fun fact" If you are viewing this site at <https://docs.walrus.site>, you are fetching this from Walrus behind the scenes. See the [Walrus Sites chapter](./walrus-sites/intro.md) for further details on how this works. ```
ar: ```admonish tip title="حقيقة ممتعة" إذا كنت تشاهد هذا الموقع على <https://docs.walrus.site>، فأنت تحصل على هذه المعلومات من Walrus خلف الكواليس. راجع [فصل مواقع Walrus](./walrus-sites/intro.md) لمزيد من التفاصيل حول كيفية عمل ذلك. ```

source: ```admonish danger title="Disclaimer about the Walrus Testnet" The current Testnet release of Walrus and Walrus Sites is a preview intended to showcase the technology and solicit feedback from builders, users, and storage-node operators. All transactions are executed on the Sui Testnet and use Testnet WAL and SUI which have no value. The state of the store **can and will be wiped** at any point and possibly with no warning. Do not rely on this Testnet for any production purposes, it comes with no availability or persistence guarantees. Furthermore, encodings and blob IDs may be incompatible with the future Testnet and Mainnet, and developers will be responsible for migrating any Testnet applications and data to Mainnet. Detailed migration guides will be provided when Mainnet becomes available. Also see the [Testnet terms of service](../legal/testnet_tos.md) under which this Testnet is made available. ```
ar: ```admonish danger title="إخلاء المسؤولية عن شبكة اختبار Walrus" إن إصدار الشبكة التجريبية الحالي من Walrus ومواقع Walrus هو معاينة تهدف إلى عرض التكنولوجيا وطلب الملاحظات من المطورين والمستخدمين ومشغلي عقد التخزين. يتم تنفيذ جميع المعاملات على شبكة اختبار Sui واستخدام عملات الشبكة التجريبية WAL وSUI والتي ليس لها قيمة. يمكن حذف حالة المتجر **وسيتم ذلك** في أي وقت وربما بدون سابق إنذار. لا تعتمد على شبكة الاختبار هذه لأي أغراض إنتاجية، فهي لا تأتي مع ضمانات التوافر أو الاستمرار. وعلاوة على ذلك، قد تكون الترميزات ومعرفات الكتل غير متوافقة مع شبكة الاختبار والشبكة الرئيسية في المستقبل، وسيكون المطورون مسؤولين عن ترحيل أي تطبيقات وبيانات للشبكة التجريبية إلى الشبكة الرئيسية. سيتم توفير أدلة ترحيل مفصلة عند توفر الشبكة الرئيسية. راجع أيضًا [شروط خدمة شبكة الاختبار](../legal/testnet_tos.md) التي يتم بموجبها توفير هذة الشبكة التجريبية. ```

source: ```admonish danger title="Public access" **All blobs stored in Walrus are public and discoverable by all.** Therefore you must not use Walrus to store anything that contains secrets or private data without additional measures to protect confidentiality. ```
ar: ```admonish danger title="الوصول العام" **جميع كتل البيانات المخزنة في Walrus عامة ويمكن للجميع اكتشافها.** لذلك لا يجوز لك استخدام Walrus لتخزين أي شيء يحتوي على أسرار أو بيانات خاصة دون اتخاذ تدابير إضافية لحماية السرية. ```

source: Features
ar: مميزات

source: **Storage and retrieval:** Walrus supports storage operations to write and read blobs. It also allows anyone to prove that a blob has been stored and is available for retrieval at a later time.
ar: التخزين والاسترجاع: يدعم Walrus عمليات التخزين لكتابة وقراءة كتل البيانات. كما يسمح لأي شخص بإثبات أن كتلة البيانات قد تم تخزينها وهي متاحة للاسترجاع في وقت لاحق.

source: **Cost efficiency:** By utilizing advanced erasure coding, Walrus maintains storage costs at approximately five times the size of the stored blobs, and encoded parts of each blob are stored on each storage node. This is significantly more cost-effective than traditional full-replication methods and much more robust against failures than protocols that only store each blob on a subset of storage nodes.
ar: الكفاءة من حيث التكلفة: من خلال استخدام ترميز المحو المتقدم، يحافظ Walrus على تكاليف التخزين عند حوالي خمسة أضعاف حجم الكتل المخزنة، ويتم تخزين الأجزاء المشفرة من كل كتلة البيانات على كل عُقدة تخزين. وهذا أكثر فعالية من حيث التكلفة بكثير من طرق النسخ المكررة التقليدية وأقوى بكثير ضد الفشل مقارنة بالبروتوكولات التي تخزن كل كتلة البيانات على مجموعة فرعية من عُقد التخزين.

source: **Integration with the Sui blockchain:** Walrus leverages [Sui](https://github.com/MystenLabs/sui) for coordination, attesting availability, and payments. Storage space is represented as a resource on Sui, which can be owned, split, merged, and transferred. Stored blobs are also represented by objects on Sui, which means that smart contracts can check whether a blob is available and for how long, extend its lifetime or optionally delete it.
ar: **التكامل مع بلوكتشين Sui:** يستفيد Walrus من [Sui] (https://github.com/MystenLabs/sui) للتنسيق وإثبات التوافر والمدفوعات. يتم تمثيل مساحة التخزين كمورد على Sui، والتي يمكن امتلاكها وتقسيمها ودمجها ونقلها. يتم تمثيل كتل البيانات المخزنة أيضًا بواسطة كائنات على Sui، مما يعني أن العقود الذكية يمكنها التحقق مما إذا كانت كتلة البيانات متاحة ومدة إتاحتها أو تمديد عمرها أو حذفها اختياريًا.

source: **Epochs, tokenomics, and delegated proof of stake** Walrus is operated by a committee of storage nodes that evolve between epochs. A native token, WAL (and its subdivision FROST, where 1 WAL is equal to 1 billion FROST), is used to delegate stake to storage nodes, and those with high stake become part of the epoch committee. The WAL token is also used for payments for storage. At the end of each epoch, rewards for selecting storage nodes, storing and serving blobs are distributed to storage nodes and whose that stake with them. All these processes are mediated by smart contracts on the Sui platform.
ar: **العصور، واقتصاد العملات، وإثبات الحصة المفوض** يتم تشغيل Walrus بواسطة لجنة من عُقد التخزين التي تتطور بين العصور. يتم استخدام عملة أصلية، WAL (وقسمه الفرعي FROST، حيث يساوي 1 WAL مليار FROST)، لتفويض الحصة إلى عقد التخزين، وتصبح تلك التي لديها حصة عالية جزءًا من لجنة العصر. يتم استخدام عملة WAL أيضًا للدفع مقابل التخزين. في نهاية كل عصر، يتم توزيع المكافآت لاختيار عقد التخزين وتخزين وخدمة الكتل على عقد التخزين والتي لها حصة معها. تتم كل هذه العمليات بواسطة عقود ذكية على منصة Sui.

source: **Flexible access:** Users can interact with Walrus through a command-line interface (CLI), software development kits (SDKs), and web2 HTTP technologies. Walrus is designed to work well with traditional caches and content distribution networks (CDNs), while ensuring all operations can also be run using local tools to maximize decentralization.
ar: **الوصول المرن:** يمكن للمستخدمين التفاعل مع Walrus من خلال واجهة سطر الأوامر (CLI)، ومجموعات تطوير البرامج (SDKs)، وتقنيات الويب 2 HTTP. تم تصميم Walrus للعمل بشكل جيد مع ذاكرات التخزين المؤقتة التقليدية وشبكات توزيع المحتوى (CDNs)، مع ضمان إمكانية تشغيل جميع العمليات أيضًا باستخدام أدوات محلية لتحقيق أقصى قدر من اللامركزية.

source: Architecture and operations
ar: العمارة والعمليات

source: Walrus's architecture ensures that content remains accessible and retrievable even when many storage nodes are unavailable or malicious. Under the hood it uses modern error correction techniques based on fast linear fountain codes, augmented to ensure resilience against Byzantine faults, and a dynamically changing set of storage nodes. The core of Walrus remains simple, and storage node management and blob certification leverages Sui smart contracts.
ar: تضمن بنية Walrus أن يظل المحتوى متاحًا وقابلًا للاسترداد حتى عندما تكون العديد من عقد التخزين غير متوفرة أو ضارة. تحت الغطاء، يستخدم تقنيات تصحيح الأخطاء الحديثة القائمة على أكواد النافورة الخطية السريعة، والتي تم تعزيزها لضمان المرونة ضد الأخطاء البيزنطية، ومجموعة متغيرة ديناميكيًا من عقد التخزين. يظل جوهر Walrus بسيطًا، وتستفيد إدارة عقد التخزين وشهادة الكتلة من عقود Sui الذكية.

source: Organization
ar: منظمة

source: This documentation is split into several parts:
ar: يتم تقسيم هذه الوثائق إلى عدة أجزاء:

source: _Dev blog_ contains announcements and other blog posts.
ar: _dev blog_ يحتوي على إعلانات وغيرها من منشورات المدونة.

source: _Design_ describes the objectives, security properties, and architecture of Walrus.
ar: _design_ يصف الأهداف وخصائص الأمان والهندسة المعمارية للوصف.

source: _Usage_ provides concrete information for developers. If you want to get started quickly, you can jump directly to the [setup chapter](./usage/setup.md).
ar: يوفر _Usage_ معلومات ملموسة للمطورين. إذا كنت تريد البدء بسرعة، يمكنك الانتقال مباشرة إلى [فصل الإعداد](./usage/setup.md).

source: _Walrus Sites_ describes how you can use Walrus and Sui together to build truly decentralized websites.
ar: يصف _walrus sites_ كيف يمكنك استخدام Walrus و Sui معًا لبناء مواقع الويب اللامركزية حقًا.

source: Finally, we provide a [glossary](./glossary.md) that explains the terminology used throughout the documentation.
ar: وأخيرًا، نقدم [مصطلحات](./glossary.md) الذي يشرح المصطلحات المستخدمة في جميع أنحاء الوثائق.

source: Sources
ar: مصادر

source: This documentation is built using [mdBook](https://rust-lang.github.io/mdBook/) from source files in <https://github.com/MystenLabs/walrus-docs/>. Please report or fix any errors you find in this documentation in that GitHub project.
ar: تم إنشاء هذه الوثائق باستخدام [mdBook](https://rust-lang.github.io/mdBook/) من ملفات المصدر في <https://github.com/MystenLabs/walrus-docs/>. يُرجى الإبلاغ عن أي أخطاء تجدها في هذه الوثائق أو إصلاحها في مشروع GitHub هذا.

source: The Walrus Dev Blog
ar: مدونة Walrus للمطور

source: This part of the Walrus documentation is used to publish news and updates about Walrus's development!
ar: يستخدم هذا الجزء من وثائق Walrus لنشر الأخبار والتحديثات حول تطوير Walrus!

source: Announcing Walrus: A Decentralized Storage and Data Availability Protocol
ar: الإعلان عن Walrus: بروتوكول تخزين وتوافر البيانات اللامركزية

source: Walrus is an innovative decentralized storage network for blockchain apps and autonomous agents. The Walrus storage system is being released today as a developer preview for Sui builders in order to gather feedback. We expect a broad rollout to other web3 communities very soon!
ar: Walrus هو شبكة تخزين لامركزية مبتكرة مخصصة لتطبيقات البلوكشين والوكلاء المستقلين. يتم إطلاق نظام التخزين Walrus اليوم كمعاينة للمطورين لمجتمع Sui لجمع الملاحظات. ونتوقع طرحًا واسعًا للمجتمعات الأخرى في الويب 3 قريبًا!

source: Leveraging innovations in erasure coding, Walrus enables fast and robust encoding of unstructured data blobs into smaller slivers distributed and stored over a network of storage nodes. A subset of slivers can be used to rapidly reconstruct the original blob, even when up to two-thirds of the slivers are missing. This is possible while keeping the replication factor down to a minimal 4x-5x, similar to existing cloud-based services, but with the additional benefits of decentralization and resilience to more widespread faults.
ar: من خلال الاستفادة من الابتكارات في مجال ترميز المحو، يتيح برنامج Walrus ترميزًا سريعًا وقويًا لكتل ​​البيانات غير المنظمة إلى شرائح أصغر موزعة ومخزنة عبر شبكة من عقد التخزين. ويمكن استخدام مجموعة فرعية من الشرائح لإعادة بناء الكتلة الأصلية بسرعة، حتى عندما يكون ما يصل إلى ثلثي الشرائح مفقودة. وهذا ممكن مع الحفاظ على عامل التكرار عند أدنى حد 4 - 5 أضعاف، على غرار الخدمات القائمة على السحابة، ولكن مع الفوائد الإضافية المتمثلة في اللامركزية والمرونة في مواجهة الأخطاء الأكثر انتشارًا.

source: The Replication Challenge
ar: تحدي النسخ المتماثل

source: Sui is the most advanced blockchain system in relation to storage on validators, with innovations such as a [storage fund](https://docs.sui.io/concepts/tokenomics/storage-fund) that future-proofs the cost of storing data on-chain. Nevertheless, Sui still requires complete data replication among all validators, resulting in a replication factor of 100x or more in today’s Sui Mainnet. While this is necessary for replicated computing and smart contracts acting on the state of the blockchain, it is inefficient for simply storing unstructured data blobs, such as music, video, blockchain history, etc.
ar: Sui هو نظام بلوكتشين الأكثر تقدمًا فيما يتعلق بالتخزين على الشبكة، مع ابتكارات مثل [صندوق التخزين](https://docs.sui.io/concepts/tokenomics/storage-fund) الذي يحمي تكلفة تخزين البيانات على السلسلة في المستقبل. ومع ذلك، لا يزال Sui يتطلب تكرار البيانات بالكامل بين جميع المحققين، مما يؤدي إلى عامل تكرار يبلغ 100 ضعف أو أكثر في شبكة Sui الرئيسية اليوم. في حين أن هذا ضروري للحوسبة المكررة والعقود الذكية التي تعمل على حالة البلوكتشين، إلا أنه غير فعال لتخزين كتل البيانات غير المنظمة ببساطة، مثل الموسيقى والفيديو وتاريخ البلوكتشين، وما إلى ذلك.

source: Introducing Walrus: Efficient and Robust Decentralized Storage
ar: تقديم Walrus: تخزين لا مركزي فعال وقوي

source: To tackle the challenge of high replication costs, Mysten Labs has developed Walrus, a decentralized storage network offering exceptional data availability and robustness with a minimal replication factor of 4x-5x. Walrus provides two key benefits:
ar: لمواجهة تحدي تكاليف التكرار المرتفعة، طورت Mysten Labs شبكة Walrus، وهي شبكة تخزين لامركزية توفر توفرًا استثنائيًا للبيانات وقوة تحمل مع عامل تكرار ضئيل يبلغ 4 - 5 أضعاف. توفر Walrus فائدتين رئيسيتين:

source: **Cost-Effective Blob Storage:** Walrus allows for the uploading of gigabytes of data at a time with minimal cost, making it an ideal solution for storing large volumes of data. Walrus can do this because the data blob is transmitted only once over the network, and storage nodes only spend a fraction of resources compared to the blob size. As a result, the more storage nodes the system has, the fewer resources each storage node uses per blob.
ar: ** تخزين الكتلة الفعالة من حيث التكلفة: ** يسمح Walrus بتحميل Gigabytes من البيانات في وقت واحد بأقل تكلفة ، مما يجعله حلاً مثاليًا لتخزين كميات كبيرة من البيانات. يمكن أن يقوم Walrus بذلك لأن كتلة البيانات البيانات يتم إرسالها مرة واحدة فقط عبر الشبكة ، ولا تنفق عقد التخزين سوى جزءًا من الموارد مقارنة بحجم الكتلة. ونتيجة لذلك ، كلما زاد عدد العقد التي يتمتع بها النظام ، كلما زادت الموارد التي تستخدمها كل عقدة تخزين لكل كتلة البيانات.

source: **High Availability and Robustness:** Data stored on Walrus enjoys enhanced reliability and availability under fault conditions. Data recovery is still possible even if two-thirds of the storage nodes crash or come under adversarial control. Further, availability may be certified efficiently without downloading the full blob.
ar: ** توافر عالي والمتانة: ** تتمتع البيانات المخزنة على Walrus بالموثوقية والتوافر المعزز في ظل ظروف الخطأ. لا يزال استرداد البيانات ممكنًا حتى لو تعطل ثلثي عقد التخزين أو تخضع لسيطرة عدوانية. علاوة على ذلك ، قد يكون التوفر معتمد بكفاءة دون تنزيل الكتلة الكاملة.

source: Decentralized storage can take multiple forms in modern ecosystems. For instance, it offers better guarantees for digital assets traded as NFTs. Unlike current designs that store data off-chain, decentralized storage ensures users own the actual resource, not just metadata, mitigating risks of data being taken down or misrepresented.
ar: يمكن للتخزين اللامركزي أن يأخذ أشكالًا متعددة في النظم الإيكولوجية الحديثة. على سبيل المثال ، يوفر ضمانات أفضل للأصول الرقمية المتداولة كـ NFTS. على عكس التصميمات الحالية التي تخزن البيانات خارج السلسلة ، فإن التخزين اللامركزي يضمن أن المستخدمين يمتلكون المورد الفعلي ، وليس فقط البيانات الوصفية ، مما يخفف من مخاطر البيانات أو تحريفها.

source: Additionally, decentralized storage is not only useful for storing data such as pictures or files with high availability; it can also double as a low-cost data availability layer for rollups. Here, sequencers can upload transactions on Walrus, and the rollup executor only needs to temporarily reconstruct them for execution.
ar: بالإضافة إلى ذلك، فإن التخزين اللامركزي ليس مفيدًا فقط لتخزين البيانات مثل الصور أو الملفات مع توافر عالٍ، بل يمكنه أيضًا أن يعمل كطبقة توفر بيانات منخفضة التكلفة للـ Rollups. في هذا السياق، يمكن للـ Sequencers تحميل المعاملات على Walrus، ويحتاج منفذ الـ Rollup فقط إلى إعادة بنائها مؤقتًا من أجل تنفيذها.

source: We also believe Walrus will accompany existing disaster recovery strategies for millions of enterprise companies. Not only is Walrus low-cost, it also provides unmatched layers of data availability, integrity, transparency, and resilience that centralized solutions by design cannot offer.
ar: نعتقد أيضًا أن Walrus سيرافق استراتيجيات التعافي من الكوارث الحالية لملايين شركات المؤسسات. ليس فقط Walrus منخفض التكلفة ، بل يوفر أيضًا طبقات لا مثيل لها من توافر البيانات ، والنزاهة ، والشفافية ، والمرونة التي لا يمكن أن تقدمها الحلول المركزية حسب التصميم.

source: Walrus is powered by the Sui Network and scales horizontally to hundreds or thousands of networked decentralized storage nodes. This should enable Walrus to offer Exabytes of storage at costs competitive with current centralized offerings, given the higher assurance and decentralization.
ar: يتم تشغيل Walrus بواسطة شبكة SUI ويحدد أفقيًا إلى مئات أو الآلاف من عقد التخزين اللامركزية المتصلة بالشبكة. هذا من شأنه أن يمكّن Walrus من تقديم exabytes من التخزين بتكاليف تنافسية مع العروض المركزية الحالية ، بالنظر إلى ارتفاع الضمان واللامركزية.

source: The Future of Walrus
ar: مستقبل Walrus

source: By releasing this developer preview we hope to share some of the design decisions with the decentralized app developer community and gather feedback on the approach and the APIs for storing, retrieving, and certifying blobs. In this developer preview, all storage nodes are operated by Mysten Labs to help us understand use cases, fix bugs, and improve the performance of the software.
ar: من خلال إصدار معاينة المطور هذه، نأمل في مشاركة بعض قرارات التصميم مع مجتمع مطوري التطبيقات اللامركزية وجمع الملاحظات حول النهج وواجهة برمجة التطبيقات الخاصة بالتخزين والاسترداد والتصديق. في هذه المرحلة، يتم تشغيل جميع عقد التخزين بواسطة Mysten Labs لمساعدتنا على فهم حالات الاستخدام، وإصلاح الأخطاء، وتحسين أداء البرنامج.

source: Future updates to Walrus will allow for dynamically changing the set of decentralized storage nodes, as well as changing the mapping of what slivers are managed by each storage node. The available operations and tools will also be expanded to cover more storage-related use cases. Many of these functions will be designed with the feedback we gather in mind.
ar: ستسمح التحديثات المستقبلية ل Walrus بتغيير مجموعة عقد التخزين اللامركزية ديناميكيًا، بالإضافة إلى تغيير تعيين الشرائح التي تديرها كل عقدة تخزين. كما سيتم توسيع العمليات والأدوات المتاحة لتغطية المزيد من حالات الاستخدام المتعلقة بالتخزين. سيتم تصميم العديد من هذه الوظائف مع وضع التعليقات التي نجمعها في الاعتبار.

source: Stay tuned for more updates on how Walrus will revolutionize data storage in the web3 ecosystem.
ar: ترقبوا المزيد من التحديثات حول كيفية إحداث ثورة في Walrus في تخزين البيانات في نظام الويب 3 البيئي.

source: What can developers build?
ar: ماذا يمكن للمطورين بناءه؟

source: As part of this developer preview, we provide a binary client (currently macOS, ubuntu) that can be operated from the [command line interface](https://docs.walrus.site/usage/client-cli.html), a [JSON API](https://docs.walrus.site/usage/json-api.html), and an [HTTP API](https://docs.walrus.site/usage/web-api.html). We also offer the community an aggregator and publisher service and a Devnet deployment of 10 storage nodes operated by Mysten Labs.
ar: كجزء من هذا العرض التمهيدي للمطور، نقدم عميلًا ثنائيًا (حاليًا MacOS ، Ubuntu) يمكن تشغيله من [واجهة سطر الأوامر] (https://docs.walrus.site/usage/client-cli.html) ، [JSON API] (https://docs.walrus.site/usage/json-api.html) ، و [http api] (https://docs.walrus.site/usage/web-api.html). كما نقدم للمجتمع خدمة مجمع وناشر ونشر شبكة المطور لـ 10 عقد تخزين تديره Mysten Labs.

source: We hope developers will experiment with building applications that leverage the Walrus Decentralized Store in a variety of ways. As examples, we hope to see the community build:
ar: نأمل أن يقوم المطورون بتجربة بناء التطبيقات التي تستفيد من المتجر اللامركزي في Walrus بعدة طرق. كأمثلة ، نأمل أن نرى المجتمع يبني:

source: **Storage of media for NFT or dapps:** Walrus can directly store and serve media such as images, sounds, sprites, videos, other game assets, etc. This is publicly available media that can be accessed using HTTP requests at caches to create multimedia dapps.
ar: ** تخزين الوسائط لـ NFT أو التطبيقات اللامركزية: ** يمكن للوبر تخزين وتقديم الوسائط مباشرة مثل الصور والأصوات والعفاريت ومقاطع الفيديو وأصول الألعاب الأخرى ، وما إلى ذلك. إنشاء تطبيقات لامركزية متعددة الوسائط.
