Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: For each blob, multiple symbols are combined into a **sliver**, which is then assigned to a shard.
ar: بالنسبة لكل كتلة، يتم دمج رموز متعددة في قطعة صغيرة، والتي يتم تخصيصها بعد ذلك إلى شظايا أخرى.

source: Storage nodes manage one or more shards, and corresponding slivers of each blob are distributed to all the storage shards.
ar: تقوم عقد التخزين بإدارة واحدة أو أكثر من القطع ، ويتم توزيع الشظايا المقابلة لكل كتلة البيانات على جميع شرائح التخزين.

source: The detailed encoding setup results in an expansion of the blob size by a factor of <span class="katex"><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.6444em;"></span><span class="mord">4.5</span><span class="mspace" style="margin-right:0.2778em;"></span><span class="mrel">∼</span><span class="mspace" style="margin-right:0.2778em;"></span></span><span class="base"><span class="strut" style="height:0.6444em;"></span><span class="mord">5</span></span></span></span>. This is independent of the number of shards and the number of storage nodes.
ar: ينتج عن إعداد التشفير التفصيلي توسيع حجم الكتلة بعامل <span class = "katex"> <span class = "katex-html" aria-hidden = "true"> <span class = "base"> < span class = "strut" style = "الارتفاع: 0.64444 ؛"> </span> <span class = "mord"> 4.5 </span> <span class = "mspace" style = "margin-right: 0.2778em ؛ "> </span> <span class =" mrel "> ∼ </span> <span class =" mspace "style =" margin-right: 0.2778em ؛ "> </span> </span> <span class = "base"> <span class = "strut" style = "الارتفاع: 0.64444 ؛"> </span> <span class = "mord"> 5 </span> </ span> </span> </span>. هذا مستقل عن عدد القطع وعدد عقد التخزين.

source: Each blob is also associated with some metadata including a **blob ID** to allow verification:
ar: ترتبط كل كتلة البيانات أيضًا ببعض البيانات الوصفية بما في ذلك معرف ** كتلة البيانات ** للسماح بالتحقق:

source: The blob ID is computed as an authenticator of the set of all shard data and metadata (byte size, encoding, blob hash).
ar: يتم حساب معرف كتلة البيانات كمصادقة لمجموعة جميع بيانات الشظية وبيانات التعريف (حجم البايت ، التشفير ، تجزئة كتلة البيانات).

source: Walrus hashes a sliver representation in each of the shards and adds the resulting hashes into a Merkle tree. Then the root of the Merkle tree is the blob hash used to derive the blob ID that identifies the blob in the system.
ar: يقوم Walrus بتجزئه قطعة صغيرة في كل شظية ويضيف التجزئات الناتجة إلى شجرة Merkle. بعد ذلك، يكون جذر شجرة Merkle هو تجزئة كتلة البيانات المستخدمة لاستنتاج معرف كتلة البيانات الذي تحدد كتلة البيانات في النظام.

source: Each storage node can use the blob ID to check if some shard data belongs to a blob using the authenticated structure corresponding to the blob hash (Merkle tree). A successful check means that the data is indeed as intended by the writer of the blob.
ar: يمكن لكل عقدة تخزين استخدام معرف كتلة البيانات للتحقق مما إذا كانت بعض بيانات الشظية تنتمي إلى كتلة البيانات باستخدام الهيكل المصادق عليه المقابل لتجزئة كتلة البيانات (شجرة Merkle). الشيك الناجح يعني أن البيانات هي في الواقع مقصود من قبل كاتب الكتلة.

source: As the writer of a blob might have incorrectly encoded a blob (by mistake or on purpose), any party that reconstructs a blob ID from shard slivers must check that it encodes to the correct blob ID. The same is necessary when accepting any blob claiming to be a specific blob ID.
ar: نظرًا لأن كاتب كتلة البيانات البيانات ما قد يكون قد قام بتشفير كتلة البيانات البيانات ما بشكل غير صحيح (عن طريق الخطأ أو عن عمد)، فيجب على أي طرف يعيد بناء معرف كتلة البيانات البيانات ما من شظايا صغيرة التحقق من ترميزه إلى معرف كتلة البيانات البيانات الصحيح. وينطبق نفس الأمر عند قبول أي كتلة البيانات بيانات تدعي أنه معرف كتلة البيانات بيانات معين.

source: This process involves re-encoding the blob using the erasure code, and deriving the blob ID again to check that the blob matches. This prevents a malformed blob (incorrectly erasure coded) from ever being read as a valid blob at any correct recipient.
ar: تتضمن هذه العملية إعادة تشكيل الكتلة باستخدام كود المحو ، واستخلاص معرف كتلة البيانات مرة أخرى للتحقق من تطابق الكتلة. هذا يمنع الكتلة المشوهة (محو غير صحيح مشفرة) من القراءة من أي وقت مضى على أنها كتلة البيانات صالحة في أي مستلم صحيح.

source: A set of slivers equal to the reconstruction threshold belonging to a blob ID that are either inconsistent or lead to the reconstruction of a different ID represent an incorrect encoding. This happens only if the user that encoded the blob was faulty or malicious and encoded it incorrectly.
ar: مجموعة من الأشرطة تساوي عتبة إعادة الإعمار التي تنتمي إلى معرف كتلة البيانات والتي لا تناسق أو تؤدي إلى إعادة بناء معرف مختلف تمثل ترميز غير صحيح. يحدث هذا فقط إذا كان المستخدم الذي قام بترميز الكتلة معيبة أو ضارة وترميزها بشكل غير صحيح.

source: Walrus can extract one symbol per sliver to form an inconsistency proof. Storage nodes can delete slivers belonging to inconsistently encoded blobs, and upon request return either the inconsistency proof or an inconsistency certificate posted on chain.
ar: يمكن أن يستخرج Walrus رمزًا واحدًا لكل قطعة صغيرة لتشكيل دليل على التناقض. يمكن لعقد التخزين حذف القطع الصغيرة التي تنتمي إلى الكتل المشفرة بشكل غير متسق. وعند الطلب، يمكنها إرجاع إما إثبات عدم التوافق أو شهادة عدم التوافق المنشورة على السلسلة.

source: Walrus operations can be separated in [interactions with the Sui chain](./operations-sui.md), which is used by Walrus for coordination and governance, and [off-chain interactions](./operations-off-chain.md) between clients and storage nodes.
ar: يمكن فصل عمليات Walrus في [التفاعلات مع سلسلة Sui](./operations-sui.md)، والتي تستخدمها Walrus للتنسيق والحوكمة، و[التفاعلات خارج السلسلة](./operations-off-chain.md) بين العملاء وعقد التخزين.

source: Operations on Sui
ar: العمليات على Sui

source: Walrus uses Sui smart contracts to coordinate storage operations as resources that have a lifetime, and payments. Smart contracts also facilitate governance to determine the storage nodes holding each storage shard. The following content outlines these operations and refers to them as part of the read/write paths.
ar: تستخدم Walrus عقود Sui الذكية لتنسيق عمليات التخزين كموارد لها عمر افتراضي، والمدفوعات. كما تسهل العقود الذكية الحوكمة لتحديد عقد التخزين التي تحتوي على كل شظية تخزين. يوضح المحتوى التالي هذه العمليات ويشير إليها كجزء من مسارات القراءة/الكتابة.

source: Metadata is the only blob element ever exposed to Sui or its validators, as the content of blobs is always stored off chain on Walrus storage nodes and caches. The storage nodes or caches do not have to overlap with any Sui infrastructure components (such as validators), and the storage epochs can be of different lengths and not have the same start/end times as Sui epochs.
ar: Metadata هو عنصر كتلة البيانات الوحيد الذي يتعرض على الإطلاق لـ SUI أو مصادقيها ، حيث يتم تخزين محتوى الكتل دائمًا على سلسلة التخزين على العقد والتخزينات. لا يتعين على عقد التخزين أو ذاكرة التخزين المؤقت التداخل مع أي مكونات البنية التحتية لـ SUI (مثل المدققين) ، ويمكن أن تكون عصر التخزين بأطوال مختلفة وليس لها نفس أوقات البدء/نهاية عصر SUI.

source: Storage resource life cycle on Sui
ar: دورة حياة موارد التخزين على Sui

source: A number of Sui smart contracts hold the metadata of the Walrus system and all its entities.
ar: يوجد عدد من عقود Sui الذكية في بيانات تعريف نظام Walrus وجميع كياناتها.

source: A **Walrus system object** holds the committee of storage nodes for the current storage epoch. The system object also holds the total available space on Walrus and the price per unit of storage (1 KiB).
ar: يحتفظ **كائن نظام Walrus** بلجنة عقد التخزين لعصر التخزين الحالي. يحتفظ كائن النظام أيضًا بالمساحة الإجمالية المتاحة على Walrus وسعر وحدة التخزين (1 كيلوبايت).

source: These values are determined by 2/3 agreement between the storage nodes for the storage epoch. Users can pay to purchase storage space for some time duration. These space resources can be split, merged, and transferred. Later, they can be used to place a blob ID into Walrus.
ar: يتم تحديد هذه القيم من خلال 2/3 اتفاق بين عقد التخزين لعصر التخزين. يمكن للمستخدمين الدفع لشراء مساحة التخزين لبعض الوقت. يمكن تقسيم موارد الفضاء هذه ودمجها ونقلها. في وقت لاحق ، يمكن استخدامها لوضع معرف الكتلة في Walrus.

source: The **storage fund** holds funds for storing blobs over one or multiple storage epochs. When purchasing storage space from the system object, users pay into the storage fund separated over multiple storage epochs. Payments are made each epoch to storage nodes according to performance (details follow).
ar: يحتفظ **صندوق التخزين** بأموال لتخزين الكائنات على مدار فترة تخزين واحدة أو فترات تخزين متعددة. عند شراء مساحة تخزين من كائن النظام، يدفع المستخدمون إلى صندوق التخزين بشكل منفصل على مدار فترات تخزين متعددة. يتم إجراء المدفوعات لكل فترة تخزين وفقًا للأداء (التفاصيل تتبع).

source: A user acquires some storage through the contracts or transfer and can assign to it a blob ID, signifying they want to store this blob ID into it. This emits a Move **resource event** that storage nodes listen for to expect and authorize off-chain storage operations.
ar: يكتسب المستخدم بعض مساحة التخزين من خلال العقود أو النقل ويمكنه تعيين معرف كتلة بيانات له، مما يدل على رغبته في تخزين معرف الكائن هذا فيه. يؤدي هذا إلى إصدار حدث مورد Move تستمع إليه عقد التخزين لتوقع عمليات التخزين خارج السلسلة والموافقة عليها.

source: Eventually a user holds an off-chain **availability certificate** from storage nodes for a blob ID. The user **uploads the certificate on chain** to signal that the blob ID is available for an availability period. The certificate is checked against the latest Walrus committee, and an **availability event** is emitted for the blob ID if correct. This is the point of availability for the blob.
ar: في النهاية، يحصل المستخدم على **شهادة توفر** خارج السلسلة من عقد التخزين لمعرف كتلة البيانات. يقوم المستخدم **بتحميل الشهادة على السلسلة** للإشارة إلى أن معرف كتلة البيانات متاح لفترة توفر. يتم التحقق من الشهادة وفقًا لأحدث لجنة Walrus، ويتم إصدار **حدث توفر** لمعرف كتلة البيانات إذا كان صحيحًا. هذه هي نقطة توفر كتلة البيانات.

source: At a later time, a certified blob's storage can be **extended** by adding a storage object to it with a longer expiry period. This facility can be used by smart contracts to extend the availability of blobs stored in perpetuity as long as funds exist to continue providing storage.
ar: في وقت لاحق، يمكن **تمديد** مساحة تخزين كتلة البيانات المعتمدة بإضافة كائن تخزين إليه بفترة صلاحية أطول. يمكن استخدام هذه الميزة بواسطة العقود الذكية لتمديد توافر كتل البيانات المخزنة إلى الأبد طالما أن الأموال موجودة لمواصلة توفير التخزين.

source: In case a blob ID is not correctly encoded, an **inconsistency proof certificate** can be uploaded on chain at a later time. This action emits an **inconsistent blob event**, signaling that the blob ID read results always return `None`. This indicates that its slivers can be deleted by storage nodes, except for an indicator to return `None`.
ar: في حالة عدم تشفير معرف كتلة البيانات بشكل صحيح ، يمكن تحميل شهادة إثبات عدم الاتساق ** على السلسلة في وقت لاحق. هذا الإجراء ينبعث من حدث ** غير متناسق ** ، مما يشير إلى أن نتائج معرف كتلة البيانات تُرجع دائمًا "لا شيء". يشير هذا إلى أنه يمكن حذف شظاياها بواسطة عقد التخزين ، باستثناء مؤشر لإرجاع "لا شيء".

source: Users writing to Walrus, need to perform Sui transactions to acquire storage and certify blobs. Users creating or consuming proofs for attestations of blob availability read the chain only to prove or verify emission of events. Nodes read the blockchain to get committee metadata only once per epoch, and then request slivers directly from storage nodes by blob ID to perform reads on Walrus resources.
ar: يحتاج المستخدمون الذين يكتبون إلى Walrus إلى إجراء معاملات Sui للحصول على مساحة تخزين وإصدار شهادات لكتل البيانات. يقرأ المستخدمون الذين ينشئون أو يستهلكون أدلة لإثبات توفر كتلة البيانات السلسلة فقط لإثبات أو التحقق من انبعاث الأحداث. تقرأ العقد سلسلة الكتل للحصول على بيانات تعريف اللجنة مرة واحدة فقط لكل عصر، ثم تطلب شرائح مباشرة من عقد التخزين بواسطة معرف الكائن لإجراء قراءات على موارد Walrus.

source: Governance operations on Sui
ar: عمليات الحوكمة على Sui

source: Each Walrus storage epoch is represented by the Walrus system object that contains a storage committee and various metadata or storage nodes, like the mapping between shards and storage nodes, available space, and current costs.
ar: يتم تمثيل كل عصر تخزين Walrus بواسطة كتلة البيانات نظام Walrus الذي يحتوي على لجنة تخزين وعقد بيانات تصويرية أو العديد من العقد ، مثل رسم الخرائط بين الشظايا وعقد التخزين ، والمساحة المتاحة ، والتكاليف الحالية.

source: Users can go to the system object for the period and **buy some storage** amount for one or more storage epochs. At each storage epoch there is a price for storage, and the payment provided becomes part of a **storage fund** for all the storage epochs that span the storage bought. There is a maximum number of storage epochs in the future for which storage can be bought (approximately 2 years). Storage is a resource that can be split, merged, and transferred.
ar: يمكن للمستخدمين الانتقال إلى كتلة البيانات النظام للفترة و ** شراء بعض التخزين ** مبلغ واحد أو أكثر من عصر التخزين. في كل عصر تخزين ، يوجد سعر للتخزين ، ويصبح الدفعة المقدمة جزءًا من صندوق تخزين ** ** لجميع عصر التخزين الذي تمتد إلى التخزين المشتراة. يوجد عدد أقصى لعدد عصر التخزين في المستقبل الذي يمكن شراء التخزين من أجله (حوالي عامين). التخزين هو مورد يمكن تقسيمه ودمجه ونقله.

source: At the end of the storage epoch, part of the funds in the **storage fund need to be allocated to storage nodes**. The idea here is for storage nodes to perform light audits of each other, and suggest which nodes are to be paid based on the performance of these audits.
ar: في نهاية فترة التخزين ، يجب تخصيص جزء من الأموال في صندوق التخزين ** لعقد التخزين **. تتمثل الفكرة هنا في إجراء عمليات تخزين لتنفيذ عمليات تدقيق الضوء لبعضها البعض ، وتشير إلى العقد التي سيتم دفعها بناءً على أداء عمليات التدقيق هذه.

source: While Walrus operations happen off Sui, they might interact with the blockchain flows defining the resource life cycle.
ar: في حين أن عمليات Walrus تحدث قبالة SUI ، فقد تتفاعل مع تدفقات بلوكتشين التي تحدد دورة حياة الموارد.

source: Write paths
ar: اكتب المسارات

source: Systems overview of writes, illustrated in the previous image:
ar: نظرة عامة على الأنظمة للكتابة ، الموضحة في الصورة السابقة:

source: A user acquires a storage resource of appropriate size and duration on chain, either by directly buying it on the Walrus system object or a secondary market. A user can split, merge, and transfer owned storage resources.
ar: يكتسب المستخدم مورد تخزين ذي حجم ومدة مناسبة على السلسلة ، إما عن طريق شرائه مباشرة على كتلة البيانات نظام Walrus أو سوق ثانوي. يمكن للمستخدم تقسيم ودمج ونقل موارد التخزين المملوكة.

source: When users want to store a blob, they first erasure code it and compute the blob ID. Then they can perform the following steps themselves, or use a publisher to perform steps on their behalf.
ar: عندما يرغب المستخدمون في تخزين كتلة البيانات ، يقومون أولاً بمحو الكود الخاص بها وحساب معرف كتلة البيانات. ثم يمكنهم إجراء الخطوات التالية بأنفسهم ، أو استخدام ناشر لأداء خطوات نيابة عنهم.

source: The user goes on chain (Sui) and updates a storage resource to register the blob ID with the desired size and lifetime. This emits an event, received by storage nodes. After the user receives they then continue the upload.
ar: يذهب المستخدم إلى السلسلة (SUI) ويقوم بتحديث مورد تخزين لتسجيل معرف كتلة البيانات مع الحجم المطلوب وعمره. هذا ينبعث من حدث ، يتلقاه العقد التخزين. بعد أن يتلقى المستخدم ثم يستمرون في التحميل.

source: The user sends the blob metadata to all storage nodes and each of the blob slivers to the storage node that currently manages the corresponding shard.
ar: يرسل المستخدم بيانات تعريف كتلة البيانات إلى جميع عقد التخزين وكل من الأشرطة الكتلية إلى عقدة التخزين التي تدير حاليًا الشظية المقابلة.

source: A storage node managing a shard receives a sliver and checks it against the blob ID. It also checks that there is a blob resource with the blob ID that is authorized to store a blob. If correct, the storage node then signs a statement that it holds the sliver for blob ID (and metadata) and returns it to the user.
ar: تتلقى عقدة التخزين التي تدير شظية قطعة صغيرة وتتحقق من ذلك مقابل معرف كتلة البيانات. كما تتحقق من وجود مورد كتلة بيانات يحمل معرف كتلة البيانات ومصرح له بتخزين كتلة البيانات. إذا كان ذلك صحيحًا، فإن عقدة التخزين توقع بعد ذلك بيانًا بأنها تحتفظ بالقطعة الصغيرة لمعرف كتلة البيانات (والبيانات الوصفية) وتعيدها إلى المستخدم.

source: The user puts together the signatures returned from storage nodes into an availability certificate and submits it to the chain. When the certificate is verified on chain, an availability event for the blob ID is emitted, and all other storage nodes seek to download any missing shards for the blob ID. This event emitted by Sui is the [point of availability (PoA)](./properties.md) for the blob ID.
ar: يجمع المستخدم التوقيعات التي يتم إرجاعها من عقد التخزين إلى شهادة توافر وتقديمها إلى السلسلة. عندما يتم التحقق من الشهادة على السلسلة ، يتم انبعاث حدث توافر لمعرف كتلة البيانات ، وتسعى جميع عقد التخزين الأخرى إلى تنزيل أي شرائح مفقودة لمعرف كتلة البيانات. هذا الحدث المنبعث من قبل SUI هو [كتلة البيانات التوفر (POA)] (./ Properties.MD) لمعرف كتلة البيانات.

source: After the PoA, and without user involvement, storage nodes sync and recover any missing metadata and slivers.
ar: بعد POA ، وبدون مشاركة المستخدم ، تتم مزامنة عقد التخزين واستعادة أي بيانات تعريف وشرائح مفقودة.

source: The user waits for 2/3 of shard signatures to return to create the certificate of availability. The rate of the code is below 1/3, allowing for reconstruction even if only 1/3 of shards return the sliver for a read. Because at most 1/3 of the storage nodes can fail, this ensures reconstruction if a reader requests slivers from all storage nodes. The full process can be mediated by a publisher that receives a blob and drives the process to completion.
ar: ينتظر المستخدم عودة 2/3 من توقيعات الشظايا لإنشاء شهادة التوفر. معدل الكود أقل من 1/3، مما يسمح بإعادة البناء حتى لو أرجع 1/3 فقط من القطع الصغيرة للقراءة. نظرًا لأن 1/3 من عقد التخزين على الأكثر يمكن أن تفشل، فإن هذا يضمن إعادة البناء إذا طلب القارئ قطع صغيرة من جميع عقد التخزين. يمكن أن تتم التوسط في العملية الكاملة بواسطة ناشر يتلقى كتلة بيانات ويقود العملية إلى الاكتمال.

source: Refresh availability
ar: توافر تحديث

source: Because no content data is required to refresh the duration of storage, refresh is conducted fully on chain within the protocol. To request an extension to the availability of a blob, a user provides an appropriate storage resource. Upon success this emits an event that storage nodes receive to extend the time for which each sliver is stored.
ar: نظرًا لعدم الحاجة إلى بيانات المحتوى لتحديث مدة التخزين ، يتم إجراء التحديث بالكامل على السلسلة داخل البروتوكول. لطلب امتداد إلى توفر كتلة البيانات ، يوفر المستخدم مورد تخزين مناسب. عند النجاح ، ينبعث هذا الحدث الذي تتلقاه عقد التخزين لتمديد الوقت الذي يتم فيه تخزين كل قطعة صغيرة.

source: Inconsistent resource flow
ar: تدفق الموارد غير المتسق

source: When a correct storage node tries to reconstruct a sliver for a blob past [PoA](./properties.md), this may fail if the encoding of the blob was incorrect. In this case, the storage node can instead extract an inconsistency proof for the blob ID. It then uses the proof to create an inconsistency certificate and upload it on chain.
ar: عندما تحاول عقدة تخزين صحيحة إعادة بناء قطع صغيرة لكتلة بيانات ما بعد [PoA](./properties.md)، فقد تفشل هذه المحاولة إذا كان ترميز كتلة البيانات غير صحيح. في هذه الحالة، يمكن لعقدة التخزين بدلاً من ذلك استخراج دليل عدم تناسق لمعرف كتلة البيانات. ثم تستخدم الدليل لإنشاء شهادة عدم تناسق وتحميلها على السلسلة.

source: The flow is as follows:
ar: التدفق كما يلي:

source: A storage node fails to reconstruct a sliver, and instead computes an inconsistency proof.
ar: تفشل عقدة التخزين في إعادة بناء القطعة الصغير ، وبدلاً من ذلك تحسب دليل التناقض.

source: The storage node sends the blob ID and inconsistency proof to all storage nodes of the Walrus epoch. The storage nodes verify the proof and sign it.
ar: ترسل عقدة التخزين معرف كتلة البيانات وإثبات عدم الاتساق إلى جميع عقد التخزين في عصر Walrus. تتحقق عقد التخزين من الدليل وتوقيعه.

source: The storage node who found the inconsistency aggregates the signatures into an inconsistency certificate and sends it to the Walrus smart contract, which verifies it and emits an inconsistent resource event.
ar: عقدة التخزين التي وجدت عدم الاتساق تجمع التوقيعات في شهادة عدم الاتساق وترسلها إلى العقد الذكي للوراه ، مما يتحقق منه وينبعث منه حدث مورد غير متناسق.

source: Upon receiving an inconsistent resource event, correct storage nodes delete sliver data for the blob ID and record in the metadata to return `None` for the blob ID for the [availability period](./properties.md). No storage attestation challenges are issued for this blob ID.
ar: عند تلقي حدث مورد غير متسق، تقوم عقد التخزين الصحيحة بحذف بيانات القطع الصغيرة لمعرف كتلة البيانات وتسجيلها في البيانات الوصفية لإرجاع `None` لمعرف كتلة البيانات لفترة التوفر [./properties.md]. لا يتم إصدار أي تحديات لإثبات التخزين لمعرف كتلة البيانات هذة.

source: ```admonish tip title="Reading inconsistent blobs" A blob ID that is inconsistent always resolves to `None` upon reading because the read process re-encodes the received blob to check that the blob ID is correctly derived from a consistent encoding. This means that an inconsistency proof reveals only a true fact to storage nodes (that do not otherwise run decoding), and does not change the output of read in any case. However, partial reads leveraging the systematic nature of the encoding might successfully return partial reads for inconsistently encoded files. Thus, if consistency and availability of reads is important, dApps should do full reads rather than partial reads. ```
ar: `` `exmonish tip title =" قراءة الكتل غير المتسقة " معرف كتلة البيانات الذي لا يتناسق دائمًا يحل على "لا شيء" عند القراءة بسبب تقوم عملية القراءة بإعادة ترميز الكتلة المستلمة للتحقق من أن معرف كتلة البيانات مشتق بشكل صحيح من أ ترميز متسق. هذا يعني أن دليل التناقض لا يكشف عن حقيقة حقيقية للتخزين فقط العقد (التي لا يتم تشغيل فك تشفير خلاف ذلك) ، ولا تغير إخراج القراءة في أي حال. ومع ذلك ، فإن القراءة الجزئية تستفيد من الطبيعة المنهجية للترميز قد العودة بنجاح القراءات الجزئية للملفات المشفرة بشكل غير متسق. وبالتالي ، إذا كان الاتساق وتوافر القراءات مهم ، يجب أن تفعل DAPPs القراءات الكاملة بدلاً من القراءات الجزئية. `` `

source: Read paths
ar: قراءة المسارات

source: A user can read stored blobs either directly or through an aggregator/cache. The operations are the same for direct user access, for aggregators, and caches in case of cache misses. In practice, most reads happen through caches for blobs that are hot and do not result in requests to storage nodes.
ar: يمكن للمستخدم قراءة الكتل المخزنة إما مباشرة أو من خلال مجمع/ذاكرة التخزين المؤقت. العمليات هي نفسها للوصول المباشر للمستخدم ، للمجمعين ، واختداءات التخزين المؤقت في حالة اختلاف ذاكرة التخزين المؤقت. في الممارسة العملية ، تحدث معظم القراءات من خلال ذاكرة التخزين المؤقت للنقاط الساخنة ولا تؤدي إلى طلبات إلى عقد التخزين.

source: The reader gets the metadata for the blob ID from any storage node, and authenticates it using the blob ID.
ar: يحصل القارئ على بيانات التعريف لمعرف كتلة البيانات من أي عقدة تخزين ، ويصادقها باستخدام معرف كتلة البيانات.
