Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: **Email Communications**. If you receive an unwanted email from us, you can use the unsubscribe link found at the bottom of the email to opt out of receiving future emails. Note that you will continue to receive transfer-related emails regarding Services you have requested. We may also send you certain non-promotional communications regarding us and our Services, and you will not be able to opt out of those communications (e.g., communications regarding our Services or updates to our Terms of Service or this Privacy Policy).
ar: ** اتصالات البريد الإلكتروني **. إذا تلقيت بريدًا إلكترونيًا غير مرغوب فيه منا ، فيمكنك استخدام رابط إلغاء الاشتراك الموجود في أسفل البريد الإلكتروني لإلغاء الاشتراك في استلام رسائل البريد الإلكتروني المستقبلية. لاحظ أنك ستستمر في تلقي رسائل البريد الإلكتروني المتعلقة بالنقل فيما يتعلق بالخدمات التي طلبتها. قد نرسل لك أيضًا بعض الاتصالات غير المعروفة فيما يتعلق بنا وخدماتنا ، ولن تتمكن من إلغاء الاشتراك في هذه الاتصالات (على سبيل المثال ، الاتصالات المتعلقة بخدماتنا أو تحديثاتنا لشروطنا RVICE أو سياسة الخصوصية هذه).

source: **Text Messages**. You may opt out of receiving text messages from us by following the instructions in the text message you have received from us or by otherwise contacting us.
ar: ** الرسائل النصية **. يمكنك إلغاء الاشتراك من استلام الرسائل النصية منا باتباع الإرشادات الواردة في الرسالة النصية التي تلقيتها منا أو عن طريق الاتصال بنا.

source: **Mobile Devices**. We may send you push notifications through our mobile application. You may opt out from receiving these push notifications by changing the settings on your mobile device. With your consent, we may also collect precise location-based information via our mobile application. You may opt out of this collection by changing the settings on your mobile device.
ar: ** الأجهزة المحمولة **. قد نرسل لك الإخطارات من خلال تطبيق الهاتف المحمول الخاص بنا. يمكنك إلغاء الاشتراك من تلقي إعلامات الدفع هذه عن طريق تغيير الإعدادات على جهازك المحمول. بموافقتك ، قد نقوم أيضًا بجمع معلومات دقيقة قائمة على الموقع عبر تطبيق الهاتف المحمول. يمكنك إلغاء الاشتراك من هذه المجموعة عن طريق تغيير الإعدادات على جهازك المحمول.

source: **"Do Not Track**.**"** Do Not Track ("**DNT**") is a privacy preference that users can set in certain web browsers. Please note that we do not respond to or honor DNT signals or similar mechanisms transmitted by web browsers.
ar: ** "لا تتبع **. **" ** لا تتبع ("** dnt **") هو تفضيل خصوصية يمكن للمستخدمين تعيينها في بعض متصفحات الويب. يرجى ملاحظة أننا لا نرد على إشارات DNT أو تكريمها أو آليات مماثلة تنتقل بواسطة متصفحات الويب.

source: **Cookies and Interest-Based Advertising**. You may stop or restrict the placement of Technologies on your device or remove them by adjusting your preferences as your browser or device permits. However, if you adjust your preferences, our Services may not work properly. Please note that cookie-based opt-outs are not effective on mobile applications. However, you may opt-out of personalized advertisements on some mobile applications by following the instructions for [Android](https://support.google.com/googleplay/android-developer/answer/6048248?hl=en), [iOS](https://support.apple.com/en-us/HT202074) and [others](https://www.networkadvertising.org/mobile-choice/).
ar: ** ملفات تعريف الارتباط والإعلانات القائمة على الاهتمام **. يمكنك إيقاف أو تقييد وضع التقنيات على جهازك أو إزالتها عن طريق ضبط تفضيلاتك كما يسمح المتصفح أو الجهاز. ومع ذلك ، إذا قمت بضبط تفضيلاتك ، فقد لا تعمل خدماتنا بشكل صحيح. يرجى ملاحظة أن عمليات إلغاء الاشتراك المستندة إلى ملفات تعريف الارتباط ليست فعالة على تطبيقات الهاتف المحمول. ومع ذلك ، يمكنك إلغاء الاشتراك في الإعلانات المخصصة على بعض تطبيقات الهاتف المحمول من خلال اتباع التعليمات الخاصة بـ [Android] (https://support.goog le.com/googleplay/android-developer/answer/6048248؟hl=en) ، [IOS] (https://support.apple.com/en-us/ht202074) و [others] (https: // www. NetworkAdvertising.org/mobile-choice/).

source: The online advertising industry also provides websites from which you may opt out of receiving targeted ads from data partners and other advertising partners that participate in self-regulatory programs. You can access these and learn more about targeted advertising and consumer choice and privacy by visiting the [Network Advertising Initiative](http://www.networkadvertising.org/managing/opt_out.asp), [the Digital Advertising Alliance](http://www.aboutads.info/choices/), [the European Digital Advertising Alliance](https://www.youronlinechoices.eu/), and [the Digital Advertising Alliance of Canada](https://youradchoices.ca/choices/).
ar: توفر صناعة الإعلان عبر الإنترنت أيضًا مواقع ويب يمكنك من خلالها إلغاء الاشتراك في تلقي إعلانات مستهدفة من شركاء البيانات وغيرهم من شركاء الإعلان الذين يشاركون في برامج التنظيم الذاتي. يمكنك الوصول إلى هذه المواقع ومعرفة المزيد حول الإعلانات المستهدفة واختيار المستهلك والخصوصية من خلال زيارة [مبادرة الإعلان الشبكي](http://www.networkadvertising.org/managing/opt_out.asp)، [تحالف الإعلان الرقمي](http://www.aboutads.info/choices/)، [تحالف الإعلان الرقمي الأوروبي](https://www.youronlinechoices.eu/)، و[تحالف الإعلان الرقمي في كندا](https://youradchoices.ca/choices/).

source: Please note you must separately opt out in each browser and on each device.
ar: يرجى ملاحظة أنه يجب عليك إلغاء الاشتراك بشكل منفصل في كل متصفح وعلى كل جهاز.

source: **Your Privacy Rights**. In accordance with applicable law, you may have the right to:
ar: ** حقوق الخصوصية الخاصة بك **. وفقًا للقانون المعمول به ، قد يكون لديك الحق في:

source: **Access Personal Information about you, including: (i) confirming whether we are processing your personal information; (ii) obtaining access to or a copy of your personal information; or (iii) receiving an electronic copy of personal information that you have provided to us, or asking us to send that information to another company (aka the right of data portability);**
ar: ** الوصول إلى المعلومات الشخصية عنك ، بما في ذلك: (1) تأكيد ما إذا كنا نعالج معلوماتك الشخصية ؛ (2) الحصول على الوصول إلى أو نسخة من معلوماتك الشخصية ؛ أو (3) تلقي نسخة إلكترونية من المعلومات الشخصية التي قدمتها إلينا ، أو تطلب منا إرسال تلك المعلومات إلى شركة أخرى (ويعرف أيضًا باسم حق نقل البيانات) ؛ **

source: **Request Correction** of your personal information where it is inaccurate or incomplete. In some cases, we may provide self-service tools that enable you to update your personal information;
ar: ** طلب تصحيح ** معلوماتك الشخصية حيث تكون غير دقيقة أو غير مكتملة. في بعض الحالات ، قد نقدم أدوات الخدمة الذاتية التي تمكنك من تحديث معلوماتك الشخصية ؛

source: Request Deletion of your personal information;
ar: طلب حذف معلوماتك الشخصية ؛

source: **Request Restriction of or Object** to our processing of your personal information, including where the processing of your personal information is based on our legitimate interest or for direct marketing purposes; and
ar: ** طلب قيود أو كتلة البيانات ** على معالجتنا لمعلوماتك الشخصية ، بما في ذلك حيث تعتمد معالجة معلوماتك الشخصية على مصلحتنا المشروعة أو لأغراض التسويق المباشر ؛ و

source: **Withdraw Your Consent to our processing of your personal information. Please note that your withdrawal will only take effect for future processing and will not affect the lawfulness of processing before the withdrawal.**
ar: ** سحب موافقتك على معالجتنا لمعلوماتك الشخصية. يرجى ملاحظة أن انسحابك لن يصبح ساري المفعول فقط للمعالجة المستقبلية ولن يؤثر على قانون المعالجة قبل الانسحاب. **

source: If you would like to exercise any of these rights, please contact us as set forth in "[Contact Us](#contact-us)" below. We will process such requests in accordance with applicable laws.
ar: إذا كنت ترغب في ممارسة أي من هذه الحقوق، يرجى الاتصال بنا على النحو المبين في "[اتصل بنا](#contact-us)" أدناه. وسوف نقوم بمعالجة مثل هذه الطلبات وفقًا للقوانين المعمول بها.

source: SECURITY OF YOUR INFORMATION
ar: أمان معلوماتك

source: We take steps designed to ensure that your information is treated securely and in accordance with this Privacy Policy. Unfortunately, no system is 100% secure, and we cannot ensure or warrant the security of any information you provide to us. To the fullest extent permitted by applicable law, we do not accept liability for unauthorized disclosure.
ar: نتخذ خطوات مصممة لضمان معاملة معلوماتك بشكل آمن ووفقًا لسياسة الخصوصية هذه. لسوء الحظ ، لا يوجد نظام آمن بنسبة 100 ٪ ، ولا يمكننا ضمان أو ضمان أمان أي معلومات تقدمها لنا. إلى أقصى حد يسمح به القانون المعمول به ، لا نقبل المسؤولية عن الكشف غير المصرح به.

source: By using our Services or providing personal information to us, you agree that we may communicate with you electronically regarding security, privacy, and administrative issues relating to your use of our Services. If we learn of a security system's breach, we may attempt to notify you electronically by posting a notice on our Services, by mail or by sending an email to you.
ar: باستخدام خدماتنا أو تقديم معلومات شخصية لنا ، فإنك توافق على أننا قد نتواصل معك إلكترونيًا فيما يتعلق بالأمان والخصوصية والمشكلات الإدارية المتعلقة باستخدام خدماتنا. إذا علمنا بخرق نظام الأمان ، فقد نحاول إخطارك إلكترونيًا من خلال نشر إشعار على خدماتنا أو عن طريق البريد أو عن طريق إرسال بريد إلكتروني إليك.

source: INTERNATIONAL DATA TRANSFERS
ar: نقل البيانات الدولية

source: All information processed by us may be transferred, processed, and stored anywhere in the world, including, but not limited to, the United States or other countries, which may have data protection laws that are different from the laws where you live. We endeavor to safeguard your information consistent with the requirements of applicable laws.
ar: قد يتم نقل جميع المعلومات التي تمت معالجتها من قبلنا ومعالجتها وتخزينها في أي مكان في العالم ، بما في ذلك ، على سبيل المثال لا الحصر ، الولايات المتحدة أو دول أخرى ، والتي قد يكون لها قوانين حماية البيانات تختلف عن القوانين التي تعيش فيها. نسعى إلى حماية معلوماتك بما يتوافق مع متطلبات القوانين المعمول بها.

source: If we transfer personal information which originates in the European Economic Area, Switzerland, and/or the United Kingdom to a country that has not been found to provide an adequate level of protection under applicable data protection laws, one of the safeguards we may use to support such transfer is the EU Standard Contractual Clauses.
ar: إذا قمنا بنقل المعلومات الشخصية التي تنشأ في المنطقة الاقتصادية الأوروبية وسويسرا و/أو المملكة المتحدة إلى بلد لم يتم العثور عليه لتوفير مستوى مناسب من الحماية بموجب قوانين حماية البيانات المعمول بها ، فإن أحد الضمانات التي قد نستخدمها دعم هذا النقل هو الجمل التعاقدية القياسية في الاتحاد الأوروبي.

source: RETENTION OF PERSONAL INFORMATION
ar: الاحتفاظ بالمعلومات الشخصية

source: We store the personal information we collect as described in this Privacy Policy for as long as you use our Services or as necessary to fulfill the purpose(s) for which it was collected, provide our Services, resolve disputes, establish legal defenses, conduct audits, pursue legitimate business purposes, enforce our agreements, and comply with applicable laws.
ar: نقوم بتخزين المعلومات الشخصية التي نجمعها كما هو موضح في سياسة الخصوصية هذه طالما أنك تستخدم خدماتنا أو حسب الضرورة للوفاء بالأغراض (الأهداف) التي تم جمعها من أجلها ، وتوفير خدماتنا ، وحل النزاعات ، وإنشاء دفاعات قانونية ، وإجراء عمليات التدقيق ، متابعة أغراض العمل المشروعة ، وفرض اتفاقياتنا ، والامتثال للقوانين المعمول بها.

source: To determine the appropriate retention period for personal information, we may consider applicable legal requirements, the amount, nature, and sensitivity of the personal information, certain risk factors, the purposes for which we process your personal information, and whether we can achieve those purposes through other means.
ar: لتحديد فترة الاستبقاء المناسبة للمعلومات الشخصية ، قد ننظر في المتطلبات القانونية المعمول بها ، والمبلغ ، والطبيعة ، وحساسية المعلومات الشخصية ، وبعض عوامل الخطر ، والأغراض التي نعالج معلوماتك الشخصية من أجلها ، وما إذا كان يمكننا تحقيق هذه الأغراض من خلال وسائل أخرى.

source: SUPPLEMENTAL NOTICE FOR CALIFORNIA RESIDENTS
ar: إشعار إضافي لسكان كاليفورنيا

source: This Supplemental Notice for California Residents only applies to our processing of personal information that is subject to the California Consumer Privacy Act of 2018 ("**CCPA**"). Mysten Labs does not believe it is subject to the CCPA. That said, Mysten Labs provides this supplemental notice for purposes of transparency. The CCPA provides California residents with the right to know what categories of personal information Mysten Labs has collected about them and whether Mysten Labs disclosed that personal information for a business purpose (e.g., to a service provider) in the preceding twelve months. California residents can find this information below:
ar: لا ينطبق هذا الإشعار التكميلي لسكان كاليفورنيا فقط على معالجة المعلومات الشخصية التي تخضع لقانون خصوصية المستهلك في كاليفورنيا لعام 2018 ("** CCPA **"). Mysten Labs لا يعتقد أنه يخضع ل CCPA. ومع ذلك ، يقدم Mysten Labs هذا الإشعار التكميلي لأغراض الشفافية. يوفر CCPA لسكان كاليفورنيا الحق في معرفة فئات المعلومات الشخصية التي جمعتها Mysten Labs عنهم وما إذا كانت Mysten Labs كشفت في المعلومات الشخصية لغرض العمل (على سبيل المثال ، إلى مزود خدمة) في الاثني عشر شهرًا السابقة. يمكن لسكان كاليفورنيا العثور على هذه المعلومات أدناه:

source: The categories of sources from which we collect personal information and our business and commercial purposes for using personal information are set forth in "[Personal Information we Collect](#personal-information-we-collect)" and "[How We Use of Your Information](#how-we-use-your-information)" above, respectively.
ar: وترد فئات المصادر التي نجمع منها المعلومات الشخصية وأغراضنا التجارية والتجارية لاستخدام المعلومات الشخصية في "[المعلومات الشخصية التي نجمعها](#personal-information-we-collect)" و "[كيف نستخدم الخاص بك المعلومات] (#how-we-use-your-information)"أعلاه، على التوالي.

source: **"Sales" of Personal Information under the CCPA.** For purposes of the CCPA, Mysten Labs does not "sell" personal information, nor do we have actual knowledge of any "sale" of personal information of minors under 16 years of age.
ar: ** "مبيعات" المعلومات الشخصية بموجب CCPA. ** لأغراض CCPA ، لا "Mysten Labs لا" يبيع "المعلومات الشخصية ، ولا لدينا معرفة فعلية بأي" بيع "للمعلومات الشخصية للقاصرين الذين تقل أعمارهم عن 16 عامًا من عمر.

source: **Additional Privacy Rights for California Residents**
ar: ** حقوق خصوصية إضافية لسكان كاليفورنيا **

source: **Non-Discrimination.** California residents have the right not to receive discriminatory treatment by us for the exercise of their rights conferred by the CCPA.
ar: ** عدم التمييز.

source: **Authorized Agent.** Only you, or someone legally authorized to act on your behalf, may make a verifiable consumer request related to your personal information. To designate an authorized agent, please contact us as set forth in "[Contact Us](#contact-us)" below and provide written authorization signed by you and your designated agent.
ar: **الوكيل المعتمد.** أنت فقط، أو شخص مفوض قانونيًا للتصرف نيابة عنك، يمكنه تقديم طلب مستهلك قابل للتحقق يتعلق بمعلوماتك الشخصية. لتعيين وكيل معتمد، يرجى الاتصال بنا كما هو موضح في "[اتصل بنا](#contact-us)" أدناه وتقديم تفويض مكتوب موقع من قبلك ووكيلك المعين.

source: **Verification**. To protect your privacy, we will take the following steps to verify your identity before fulfilling your request. When you make a request, we will ask you to provide sufficient information that allows us to reasonably verify you are the person about whom we collected personal information or an authorized representative, which may include confirming the email address associated with any personal information we have about you. If you are a California resident and would like to exercise any of your rights under the CCPA, please contact us as set forth in "[Contact Us](#contact-us)" below. We will process such requests in accordance with applicable laws.
ar: **التحقق**. لحماية خصوصيتك، سنتخذ الخطوات التالية للتحقق من هويتك قبل تلبية طلبك. عند تقديم طلب، سنطلب منك تقديم معلومات كافية تسمح لنا بالتحقق بشكل معقول من أنك الشخص الذي جمعنا عنه معلومات شخصية أو ممثل مفوض، وقد يشمل ذلك تأكيد عنوان البريد الإلكتروني المرتبط بأي معلومات شخصية لدينا عنك. إذا كنت مقيمًا في كاليفورنيا وترغب في ممارسة أي من حقوقك بموجب قانون CCPA، فيرجى الاتصال بنا على النحو المبين في "[اتصل بنا](#contact-us)" أدناه. سنقوم بمعالجة مثل هذه الطلبات وفقًا للقوانين المعمول بها.

source: \*\*Refer-a-Friend and Similar In "[How We Use Your Personal Information](#how-we-use-your-information) we may offer referral programs or other incentivized data collection programs. For example, we may offer incentives to you such as discounts or promotional items or credit in connection with these programs, wherein you provide your personal information in exchange for a reward, or provide personal information regarding your friends or colleagues (such as their email address) and receive rewards when they sign up to use our Services. (The referred party may also receive rewards for signing up via your referral.) These programs are entirely voluntary and allow us to grow our business and provide additional benefits to you. The value of your data to us depends on how you ultimately use our Services, whereas the value of the referred party's data to us depends on whether the referred party ultimately becomes a user and uses our Services. Said value will be reflected in the incentive offered in connection with each program.
ar: \*\*إحالة صديق وما شابه ذلك في "[كيف نستخدم معلوماتك الشخصية](#how-we-use-your-information) قد نقدم برامج إحالة أو برامج أخرى لجمع البيانات بحوافز. على سبيل المثال، قد نقدم لك حوافز مثل الخصومات أو العناصر الترويجية أو الائتمان فيما يتعلق بهذه البرامج، حيث تقدم معلوماتك الشخصية مقابل مكافأة، أو تقدم معلومات شخصية عن أصدقائك أو زملائك (مثل عنوان بريدهم الإلكتروني) وتتلقى مكافآت عند التسجيل لاستخدام خدماتنا. (قد يتلقى الطرف المُحال أيضًا مكافآت للتسجيل من خلال إحالتك.) هذه البرامج طوعية تمامًا وتسمح لنا بتنمية أعمالنا وتقديم مزايا إضافية لك. تعتمد قيمة بياناتك بالنسبة لنا على كيفية استخدامك لخدماتنا في النهاية، بينما تعتمد قيمة بيانات الطرف المُحال بالنسبة لنا على ما إذا كان الطرف المُحال يصبح في النهاية مستخدمًا ويستخدم خدماتنا. ستنعكس هذه القيمة في الحافز المعروض فيما يتعلق بكل برنامج.

source: **Accessibility**. This Privacy Policy uses industry-standard technologies and was developed in line with the World Wide Web Consortium's Web Content Accessibility Guidelines, version 2.1. If you wish to print this policy, please do so from your web browser or by saving the page as a PDF.
ar: **إمكانية الوصول**. تستخدم سياسة الخصوصية هذه تقنيات معايير الصناعة وتم تطويرها بما يتماشى مع إرشادات إمكانية الوصول إلى محتوى الويب التابع لـ World Wide Consortium ، الإصدار 2.1. إذا كنت ترغب في طباعة هذه السياسة ، فيرجى القيام بذلك من متصفح الويب الخاص بك أو عن طريق حفظ الصفحة كـ PDF.

source: **California Shine the Light**. The California "Shine the Light" law permits users who are California residents to request and obtain from us once a year, free of charge, a list of the third parties to whom we have disclosed their personal information (if any) for their direct marketing purposes in the prior calendar year, as well as the type of personal information disclosed to those parties.
ar: ** كاليفورنيا تألق الضوء **. يسمح قانون "Shine the Light" في كاليفورنيا للمستخدمين الذين هم من سكان كاليفورنيا أن يطلبوا منا مرة واحدة في السنة ، مجانًا ، قائمة بالأطراف الثالثة التي كشفنا عنها معلوماتهم الشخصية (إن وجدت) لتسويقها المباشر الأغراض في السنة التقويمية السابقة ، وكذلك نوع المعلومات الشخصية التي تم الكشف عنها لتلك الأطراف.

source: **Right for minors to remove posted content.** Where required by law, California residents under the age of 18 may request to have their posted content or information removed from the publicly viewable portions of the Services by contacting us directly as set forth in "[Contact Us](#contact-us)" below.
ar: **حق القاصرين في إزالة المحتوى المنشور.** حيثما يقتضي القانون، يجوز للمقيمين في كاليفورنيا الذين تقل أعمارهم عن 18 عامًا طلب إزالة المحتوى أو المعلومات المنشورة من الأجزاء التي يمكن مشاهدتها علنًا من الخدمات عن طريق الاتصال بنا مباشرة كما هو موضح في "[اتصل بنا](#contact-us)" أدناه.

source: SUPPLEMENTAL NOTICE FOR NEVADA RESIDENTS
ar: إشعار إضافي لسكان نيفادا

source: If you are a resident of Nevada, you have the right to opt-out of the sale of certain personal information to third parties who intend to license or sell that personal information. You can exercise this right by contacting us as set forth in "[Contact Us](#contact-us)" below with the subject line "Nevada Do Not Sell Request" and providing us with your name and the email address associated with your account. Please note that we do not currently sell your personal information as sales are defined in Nevada Revised Statutes Chapter 603A.
ar: إذا كنت مقيمًا في ولاية نيفادا، فلديك الحق في إلغاء الاشتراك في بيع بعض المعلومات الشخصية لأطراف ثالثة تنوي ترخيص أو بيع تلك المعلومات الشخصية. يمكنك ممارسة هذا الحق عن طريق الاتصال بنا على النحو المبين في "[اتصل بنا](#contact-us)" أدناه مع سطر الموضوع "طلب عدم البيع في ولاية نيفادا" وتزويدنا باسمك وعنوان البريد الإلكتروني المرتبط بحسابك. يرجى ملاحظة أننا لا نبيع معلوماتك الشخصية حاليًا حيث يتم تعريف المبيعات في الفصل 603A من القوانين المنقحة لولاية نيفادا.

source: CHILDREN'S INFORMATION
ar: معلومات الأطفال

source: The Services are not directed to children under 13 (or other age as required by local law), and we do not knowingly collect personal information from children. If you learn that your child has provided us with personal information without your consent, you may contact us as set forth in "[Contact Us](#contact-us)" below. If we learn that we have collected a child's personal information in violation of applicable law, we will promptly take steps to delete such information.
ar: لا تستهدف الخدمات الأطفال دون سن 13 عامًا (أو أي سن آخر حسبما يقتضيه القانون المحلي)، ولا نجمع معلومات شخصية من الأطفال عن عمد. إذا علمت أن طفلك قد زودنا بمعلومات شخصية دون موافقتك، فيمكنك الاتصال بنا على النحو المبين في "[اتصل بنا](#contact-us)" أدناه. إذا علمنا أننا جمعنا معلومات شخصية عن طفل في انتهاك للقانون المعمول به، فسنقوم على الفور باتخاذ خطوات لحذف هذه المعلومات.

source: THIRD-PARTY WEBSITES/APPLICATIONS
ar: مواقع/تطبيقات الطرف الثالث

source: The Services may contain links to other websites/applications (such as GitHub) and other websites/applications may reference or link to our Services. These third-party services are not controlled by us. We encourage our users to read the privacy policies of each website and application with which they interact. We do not endorse, screen or approve, and are not responsible for, the privacy practices or content of such other websites or applications. Providing personal information to third-party websites or applications is at your own risk.
ar: قد تحتوي الخدمات على روابط لمواقع/تطبيقات أخرى (مثل GitHub) ومواقع/تطبيقات أخرى قد تشير أو ترتبط بخدماتنا. لا يتم التحكم في خدمات الطرف الثالث هذه من قبلنا. نشجع مستخدمينا على قراءة سياسات الخصوصية لكل موقع ويب وتطبيق يتفاعلون معه. نحن لا نؤيد أو شاشة أو نتوافق ، ونكون مسؤولين عن ممارسات الخصوصية أو محتوى هذه المواقع أو التطبيقات الأخرى. توفير معلومات شخصية لجهة خارجية ث EBSITES أو التطبيقات على مسؤوليتك الخاصة.

source: SUPERVISORY AUTHORITY
ar: السلطة الإشرافية

source: If you are located in the European Economic Area, Switzerland, the United Kingdom, or Brazil, you have the right to lodge a complaint with a supervisory authority if you believe our processing of your personal information violates applicable law.
ar: إذا كنت موجودًا في المنطقة الاقتصادية الأوروبية أو سويسرا أو المملكة المتحدة أو البرازيل ، فلديك الحق في تقديم شكوى مع سلطة إشرافية إذا كنت تعتقد أن معالجتنا لمعلوماتك الشخصية تنتهك القانون المعمول به.

source: CONTACT US
ar: اتصل بنا
