Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: `site-map`
ar: "خريطة الموقع"

source: The `sitemap` command shows the resources that compose the Walrus Site at the given object ID.
ar: يعرض أمر "sitemap` الموارد التي تشكل موقع Walrus في معرف الكتلة المحدد.

source: `list-directory`
ar: `قائمة الدليل`

source: With `list-directory`, you can obtain the `index.html` file that would be generated by running `publish` or `update` with the `--list-directory` flag. This is useful to see how the index page would look like before publishing it—and possibly editing to make it look nicer!
ar: باستخدام "القائمة الدليل" ، يمكنك الحصول على ملف `index.html` الذي سيتم إنشاؤه عن طريق تشغيل" publish "أو" تحديث "مع العلم"-القائمة الدقيقة ". هذا مفيد لمعرفة كيف ستبدو صفحة الفهرس قبل نشرها - وربما التحرير لجعلها تبدو أجمل!

source: Configuring the site builder
ar: تكوين منشئ الموقع

source: Configuring the `site-builder` tool is straightforward, but care is required to ensure that everything works correctly.
ar: يعد تكوين أداة "بناء الموقع" واضحًا ، ولكن هناك حاجة إلى الرعاية لضمان أن كل شيء يعمل بشكل صحيح.

source: The `site-builder` tool requires a configuration file to know which package to use on Sui, which wallet to use, the gas budget, and other operational details. Most of these are abstracted away through sensible defaults, so you should not need to touch them. Yet, for completeness, we provide here the details for all the configuration options.
ar: تتطلب أداة "بواني الموقع" ملف تكوين لمعرفة الحزمة التي يجب استخدامها على SUI ، والتي تستخدمها ، وميزانية الغاز ، وغيرها من التفاصيل التشغيلية. يتم تجريد معظم هذه الأشياء من خلال التخلف عن السداد المعقولة ، لذلك يجب ألا تحتاج إلى لمسها. ومع ذلك ، من أجل الاكتمال ، نقدم هنا التفاصيل لجميع خيارات التكوين.

source: Minimal configuration
ar: الحد الأدنى من التكوين

source: The config file is expected to be in `./sites-config.yaml`, and it is possible to point elsewhere with the `--config` flag. For your first run, it should be sufficient to call the `site-builder` with `--config sites-config.yaml`, which is already configured appropriately.
ar: من المتوقع أن يكون ملف التكوين في `./sites-config.yaml`، ومن الممكن الإشارة إلى مكان آخر باستخدام علامة `--config`. في التشغيل الأول، يجب أن يكون كافيًا استدعاء `site-builder` باستخدام `--config sites-config.yaml`، والذي تم تكوينه بشكل مناسب بالفعل.

source: If, for any reason, you didn't add `walrus` to `$PATH`, make sure to configure a pointer to the binary, see below.
ar: إذا لم تضيف ، لأي سبب من الأسباب ، إضافة "Walrus" إلى "مسار $" ، تأكد من تكوين مؤشر إلى الثنائي ، انظر أدناه.

source: Additional options
ar: خيارات إضافية

source: If you want to have more control over the behavior of the site builder, you can customize the following variables in the config file:
ar: إذا كنت ترغب في الحصول على مزيد من التحكم في سلوك منشئ الموقع ، فيمكنك تخصيص المتغيرات التالية في ملف التكوين:

source: `package`: the object ID of the Walrus Sites package on Sui. This must always be specified in the config, and is already appropriately configured in `assets/example-config.yaml`.
ar: `package`: معرف كتلة البيانات لحزمة مواقع Walrus على Sui. يجب تحديد هذا دائمًا في التكوين، وقد تم تكوينه بشكل مناسب في `assets/example-config.yaml`.

source: `portal`: the name of the portal through which the site will be viewed; this only affects the output of the CLI, and nothing else (default: `walrus.site`). All Walrus Sites are accessible through any portal independent of this setting.
ar: "البوابة": اسم البوابة التي سيتم من خلالها عرض الموقع ؛ يؤثر هذا فقط على ناتج CLI ، ولا شيء آخر (افتراضي: "Walrus.site`). يمكن الوصول إلى جميع مواقع Walrus من خلال أي بوابة مستقلة عن هذا الإعداد.

source: `general`: these are general options that can be configured both through the CLI and the config:
ar: "عام": هذه خيارات عامة يمكن تكوينها من خلال CLI والتكوين:

source: `rpc_url`: The URL of the Sui RPC node to use. If not set, the `site-builder` will infer it from the wallet.
ar: `rpc_url`: عنوان URL لعقدة Sui RPC للاستخدام. إذا لم يتم تعيينه ، فإن "بناء الموقع" سوف يستنتجه من المحفظة.

source: `wallet`: Pointer to the Sui wallet to be used. By default, it uses the system-wide wallet (the one from `sui client addresses`).
ar: "محفظة": مؤشر إلى محفظة Sui لاستخدامها. بشكل افتراضي ، يستخدم محفظة على مستوى النظام (واحد من "عناوين عميل SUI").

source: `walrus_binary`: Pointer to the `walrus` binary. By default, this is expected to be run from `$PATH`.
ar: `walrus_binary`: مؤشر إلى "Walrus" الثنائي. بشكل افتراضي ، من المتوقع أن يتم تشغيل هذا من `$ path`.

source: `walrus_config`: The configuration for the `walrus` client binary, see the [relevant chapter](../usage/setup.md).
ar: `walrus_config`: تكوين ملف ثنائي لعميل `walrus`، راجع [الفصل ذي الصلة](../usage/setup.md).

source: `gas_budget`: The maximum amount of gas to be spent for transactions (default: 500M MIST).
ar: `gas_budget`: الحد الأقصى لكمية الغاز التي سيتم إنفاقها للمعاملات (الافتراضي: 500 متر ضباب).

source: ```admonish tip title="New with Walrus Sites Testnet version" The following features have been released with the Walrus Sites Testnet version. ```
ar: ```admonish tip title="جديد مع إصدار Walrus Sites على الشبكة التجريبية" تم إصدار الميزات التالية مع إصدار Walrus Sites على الشبكة التجريبية. ```

source: In its base configuration, Walrus Sites serves static assets through a portal. However, many modern web applications require more advanced features, such as custom headers and client-side routing.
ar: في تكوينه الأساسي ، تقدم مواقع Walrus أصولًا ثابتة من خلال بوابة. ومع ذلك ، تتطلب العديد من تطبيقات الويب الحديثة ميزات أكثر تقدمًا ، مثل الرؤوس المخصصة والتوجيه من جانب العميل.

source: Therefore, the site-builder can read a `ws-resource.json` configuration file, in which you can directly specify resource headers and routing rules.
ar: لذلك ، يمكن لبناء الموقع قراءة ملف تكوين `ws-resource.json` ، حيث يمكنك تحديد رؤوس الموارد وقواعد التوجيه مباشرة.

source: The `ws-resources.json` file
ar: ملف `ws-resources.json`

source: This file is optionally placed in the root of the site directory, and it is _not_ uploaded with the site's resources (in other words, the file is not part of the resulting Walrus Site and is not served by the portal).
ar: يتم وضع هذا الملف اختياريًا في جذر دليل الموقع ، ويتم تحميله _not_ تم تحميله بموارد الموقع (بمعنى آخر ، الملف ليس جزءًا من موقع Walrus الناتج ولا يتم تقديمه بواسطة البوابة).

source: If you don't want to use this default location, you can specify the path to the configuration file with the `--ws-resources` flag when running the `publish` or `update` commands.
ar: إذا كنت لا ترغب في استخدام هذا الموقع الافتراضي ، فيمكنك تحديد المسار إلى ملف التكوين مع علامة "الموارد-WS" عند تشغيل أوامر "publish" أو "تحديث".

source: The file is JSON-formatted, and looks like the following:
ar: يتم تنسيق الملف ، ويبدو كما يلي:

source: We now describe in details the two sections of the configuration file, `headers` and `routes`.
ar: نصف الآن بالتفصيل القسمان من ملف التكوين و "الرؤوس" و "الطرق".

source: Specifying HTTP response headers
ar: تحديد رؤوس استجابة HTTP

source: The `headers` section allows you to specify custom HTTP response headers for specific resources. The keys in the `headers` object are the paths of the resources, and the values are lists of key-value pairs corresponding to the headers that the portal will attach to the response.
ar: يتيح لك قسم "Headers" تحديد رؤوس استجابة HTTP المخصصة لموارد محددة. المفاتيح الموجودة في كتلة البيانات "الرؤوس" هي مسارات الموارد ، والقيم هي قوائم بأزواج القيمة الرئيسية المقابلة للرؤوس التي ستعلقها البوابة بالاستجابة.

source: For example, in the configuration above, the file `index.html` will be served with the `Content-Type` header set to `text/html; charset=utf-8` and the `Cache-Control` header set to `max-age=3500`.
ar: على سبيل المثال ، في التكوين أعلاه ، سيتم تقديم ملف `index.html` مع رأس" نوع المحتوى "على" text/html ؛ charset = utf-8` ورأس "cache-control`" تم تعيينه على `max-age = 3500`.

source: This mechanism allows you to control various aspects of the resource delivery, such as caching, encoding, and content types.
ar: تتيح لك هذه الآلية التحكم في جوانب مختلفة من توصيل الموارد ، مثل التخزين المؤقت والتشفير والأنواع المحتوى.

source: Default headers
ar: الرؤوس الافتراضية

source: By default, no headers need to be specified, and the `ws-resources.json` file can be omitted. The site-builder will automatically try to infer the `Content-Type` header based on the file extension, and set the `Content-Encoding` to `identity` (no transformation).
ar: بشكل افتراضي ، لا يلزم تحديد أي رؤوس ، ويمكن حذف ملف `ws-resources.json`. سيحاول بناء الموقع تلقائيًا استنتاج رأس "نوع المحتوى" استنادًا إلى امتداد الملف ، وتعيين "ترميز المحتوى" إلى "الهوية" (بدون تحويل).

source: In case the content type cannot be inferred, the `Content-Type` will be set to `application/octet-stream`.
ar: في حالة عدم استنتاج نوع المحتوى ، سيتم تعيين "نوع المحتوى" على "التطبيق/الإثارة الثمانية".

source: These defaults will be overridden by any headers specified in the `ws-resources.json` file.
ar: سيتم تجاوز هذه الإعدادات الافتراضية من قبل أي رؤوس محددة في ملف `ws-resources.json`.

source: Specifying client-side routing
ar: تحديد التوجيه من جانب العميل

source: The `routes` section allows you to specify client-side routing rules for your site. This is useful when you want to use a single-page application (SPA) framework, such as React or Angular.
ar: يتيح لك قسم "Routes` تحديد قواعد التوجيه من جانب العميل لموقعك. يكون هذا مفيدًا عندما ترغب في استخدام إطار تطبيق (SPA) من صفحة واحدة ، مثل React أو Angular.

source: The configuration in the `routes` object is a mapping from route keys to resource paths.
ar: التكوين في كتلة البيانات "Routes" هو رسم الخرائط من مفاتيح الطريق إلى مسارات الموارد.

source: The **`routes` keys** are path patterns in the form `/path/to/some/*`, where the `*` character represents a wildcard.
ar: مفاتيح ** `ROIDES` ** هي أنماط مسار في النموذج`/to/to/some/*`، حيث تمثل الحرف"*`الحرف" بطاقة البرية ".

source: The **`routes` values** are the resource paths that should be served when the route key is matched.
ar: قيم ** `ROUTES` ** هي مسارات الموارد التي يجب تقديمها عند مطابقة مفتاح المسار.

source: ```admonish danger title="Important" The paths in the values **must** be valid resource paths, meaning that they must be present among the site's resources. The Walrus sites contract will **abort** if the user tries to create a route that points to a non-existing resource. ```
ar: `` `` intermonish danger title = "Target" يجب أن تكون المسارات في القيم ** مسارات مورد صالحة ، مما يعني أنه يجب أن تكون موجودة بين موارد الموقع. سيقوم عقد مواقع Walrus ** بإحباط ** إذا حاول المستخدم إنشاء مسار هذا يشير إلى مورد غير موجود. `` `

source: The simple routing algorithm is as follows:
ar: خوارزمية التوجيه البسيطة هي كما يلي:

source: Whenever a resource path _is not found among the sites resources_, the portal tries to match the path to the `routes`.
ar: كلما لم يتم العثور على مسار الموارد بين المواقع الموارد _ ، تحاول البوابة مطابقة المسار مع "الطرق".

source: All matching routes are then _lexicographically ordered_, and the _longest_ match is chosen.
ar: يتم بعد ذلك _lexicographicly order_ ، ويتم اختيار مطابقة _longest_.

source: The resource corresponding to this longest match is then served.
ar: ثم يتم تقديم المورد المقابل لهذه المباراة الأطول.

source: Recall the example above:
ar: أذكر المثال أعلاه:

source: The following matchings will occur:
ar: ستحدث المطابقات التالية:

source: browsing `/any/other/test.html` will serve `/index.html`;
ar: سيؤدي تصفح `/any/other/test.html` إلى تقديم `/index.html`؛

source: browsing `/path/test.html` will serve `/accounts.html`, as it is a more specific match than the previous one;
ar: سيؤدي تصفح `/path/test.html` إلى تقديم `/accounts.html`، حيث إنه تطابق أكثر تحديدًا من المطابقة السابقة؛

source: similarly, browsing `/path/assets/test.html` will serve `/assets/asset_router.html`.
ar: على نحو مماثل، سيؤدي تصفح `/path/assets/test.html` إلى تقديم `/assets/asset_router.html`.

source: `/index.html`, `/accounts.html`, and `/assets/asset_router.html` are all existing resources on the Walrus Sites object on Sui.
ar: `/index.html` و`/accounts.html` و`/assets/asset_router.html` كلها موارد موجودة على كائن مواقع Walrus على Sui.

source: Links in Walrus Sites work _almost_ as you would expect in a regular website. We specify here a few of the details.
ar: تعمل الروابط _almost_ في مواقع Walrus بنفس الطريقة التي تتوقعها في أي موقع ويب عادي. نوضح هنا بعض التفاصيل.

source: Linking to resources within the same site
ar: الارتباط بالموارد داخل نفس الموقع

source: Relative and absolute links (`href=\
ar: الروابط النسبية والمطلقة (`href=\

source: Linking to resources on the web
ar: الارتباط بالموارد على الويب

source: Linking to a resource on the web (`href="https://some.cdn.example.com/stylesheet.css"`) also works as usual.
ar: الارتباط بمورد على الويب (`href =" https://some.cdn.example.com/stylesheet.css "`) يعمل كالمعتاد.

source: Linking to resources in other Walrus Sites
ar: الارتباط بالموارد في مواقع Walrus الأخرى

source: Here is the part that is a bit different. Assume there is some image that you can browse at `https://gallery.walrus.site/walrus_arctic.webp`, and you want to link it from your own Walrus Site.
ar: هذا هو الجزء الذي يختلف قليلاً. افترض أن هناك بعض الصور التي يمكنك تصفحها على `https://gallery.walrus.site/walrus_arctic.webp`، وتريد ربطها بموقع Walrus الخاص بك.

source: Recall that, however, `https://walrus.site` is just one of the possibly many portals. I.e., the same resource is browsable from a local portal (`http://gallery.localhost:8080/walrus_arctic.webp`), or from any other portal (e.g., `https://gallery.blob.store/walrus_arctic.webp`). Therefore, how can you link the resource in a _portal-independent way_? This is important for interoperability, availability, and respecting the user's choice of portal.
ar: تذكر أن "https://walrus.site" هو مجرد واحد من بين العديد من البوابات المحتملة. أي أن نفس المورد يمكن تصفحه من بوابة محلية (http://gallery.localhost:8080/walrus_arctic.webp)، أو من أي بوابة أخرى (على سبيل المثال، https://gallery.blob.store/walrus_arctic.webp). لذا، كيف يمكنك ربط المورد بطريقة مستقلة عن البوابة؟ هذا مهم للتوافق والتوافر واحترام اختيار المستخدم للبوابة.

source: The solution: Walrus Sites links
ar: الحل: روابط مواقع Walrus

source: We solve this problem by having the portals interpret special links that are normally invalid on the web and redirect to the corresponding Walrus Sites resource in the portal itself.
ar: نقوم بحل هذه المشكلة من خلال جعل البوابات تفسر الروابط الخاصة التي عادة ما تكون غير صالحة على الويب وإعادة توجيه إلى مورد مواقع Walrus المقابلة في البوابة نفسها.

source: Consider the example above, where the resource `/walrus_arctic.webp` is browsed from the Walrus Site with SuiNS name `gallery`, which points to the object ID `abcd123…` (in Base36 encoding). Then, the portal-independent link is: `https://gallery.suiobj/walrus_arctic.webp`. To fix the object ID instead of the SuiNS name, you can use `https://abcd123….suiobj/walrus_arctic.webp`.
ar: فكر في المثال أعلاه، حيث يتم تصفح المورد `/walrus_arctic.webp` من موقع Walrus باسم SuiNS `gallery`، والذي يشير إلى معرف الكتلة `abcd123…` (بترميز Base36). بعد ذلك، يكون الرابط المستقل عن البوابة هو: `https://gallery.suiobj/walrus_arctic.webp`. لإصلاح معرف الكتلة بدلاً من اسم SuiNS، يمكنك استخدام `https://abcd123….suiobj/walrus_arctic.webp`.

source: Another possibility is to directly point to the Walrus _blob ID_ of the resource, and have the browser "sniff" the content type. This works for images, for example, but not for script or stylesheets. For example to point to the blob ID (e.g., containing an image) `qwer5678…`, use the URL `https://blobid.walrus/qwer5678…`.
ar: هناك إمكانية أخرى تتمثل في الإشارة مباشرةً إلى معرف الكتلة _blob_ الخاص بـWalrus، وجعل المتصفح "يتعرف" على نوع المحتوى. وهذا ينطبق على الصور، على سبيل المثال، ولكن ليس على النصوص البرمجية أو أوراق الأنماط. على سبيل المثال، للإشارة إلى معرف الكتلة (على سبيل المثال، الذي يحتوي على صورة) `qwer5678…`، استخدم عنوان URL `https://blobid.walrus/qwer5678…`.

source: With such a link, the portal will extract the blob ID and redirect the request to the aggregator it is using to fetch blobs.
ar: باستخدام هذا الرابط ، ستستخرج البوابة معرف كتلة البيانات وإعادة توجيه الطلب إلى المجمع الذي يستخدمه لجلب الكتل.

source: We have seen in the [overview](./overview.md) how a Walrus Site object on Sui looks like. We will discuss now how you can create ensure that a _set of arbitrary objects_ can all be tied to a specific, and possibly unique, Walrus Site.
ar: لقد رأينا في [النظرة العامة](./overview.md) كيف يبدو كتلة البيانات موقع Walrus على Sui. سنناقش الآن كيف يمكنك إنشاء مجموعة من الكائنات العشوائية التي يمكن ربطها جميعًا بموقع Walrus محدد وربما فريد.

source: The goal
ar: الهدف

source: Consider a collection of NFTs, such as the one published by <https://flatland.walrus.site>. As we show there, each minted NFT has its own Walrus Site, which can be personalized based on the contents (e.g., the color) of the NFT itself. How can we achieve this?
ar: النظر في مجموعة من NFTS ، مثل تلك التي نشرتها <https://flatland.walrus.site>. كما نظهر هناك ، لكل NFT موقع NFT الخاص به ، والذي يمكن تخصيصه بناءً على المحتويات (على سبيل المثال ، لون) NFT نفسه. كيف يمكننا تحقيق هذا؟

source: Redirect links
ar: إعادة توجيه الروابط

source: The solution is simple: We add a "redirect" in the NFT's [`Display`](https://docs.sui.io/standards/display#sui-utility-objects) property. Each time an NFT's object ID is browsed through a portal, the portal will check the `Display` of the NFT and, if it encounters the `walrus site address` key, it will go fetch the Walrus Site that is at the corresponding object ID.
ar: الحل بسيط: نضيف "إعادة توجيه" في خاصية [`Display`](https://docs.sui.io/standards/display#sui-utility-objects) الخاصة بـ NFT. في كل مرة يتم فيها تصفح معرف كتلة البيانات NFT عبر بوابة، ستتحقق البوابة من `Display` الخاص بـ NFT، وإذا صادفت مفتاح `walrus site address`، فستذهب لجلب موقع Walrus الموجود عند معرف الكتلة المقابل.

source: Redirects in Move
ar: إعادة التوجية في لغة Move

source: Practically speaking, when creating the `Display` of the NFT, you can include the key-value pair that points to the Walrus Site that is to be used.
ar: من الناحية العملية ، عند إنشاء "العرض" لـ NFT ، يمكنك تضمين زوج القيمة الرئيسية التي تشير إلى موقع Walrus الذي سيتم استخدامه.

source: ```move ... const VISUALIZATION_SITE: address = @0x901fb0...; display.add(b"walrus site address".to_string(), VISUALIZATION_SITE.to_string()); ... ```
ar: تحرك ... const Visualization_site: address = @0x901fb0 ... ؛ Display.add (B "عنوان موقع Walrus" .to_string () ، visualization_site.to_string ()) ؛ ... `` `

source: How to change the site based on the NFT?
ar: كيفية تغيير الموقع بناءً على NFT؟

source: The code above will only open the specified Walrus Site when browsing the object ID of the NFT. How do we ensure that the properties of the NFT can be used to personalize the site?
ar: سوف يفتح الكود أعلاه فقط موقع Walrus المحدد عند تصفح معرف الكتلة من NFT. كيف يمكننا التأكد من استخدام خصائص NFT لتخصيص الموقع؟

source: This needs to be done in the `VISUALIZATION_SITE`: Since the subdomain is still pointing to the NFT's object ID, the Walrus Site that is loaded can check its `origin` in JavaScript, and use the subdomain to determine the NFT, fetch it from chain, and use its internal fields to modify the displayed site.
ar: يجب القيام بذلك في "التصور_site": نظرًا لأن النطاق الفرعي لا يزال يشير إلى معرف كتلة البيانات NFT ، يمكن لموقع Walrus الذي يتم تحميله التحقق سلسلة ، واستخدم حقولها الداخلية لتعديل الموقع المعروض.

source: For an end-to-end example, see the `flatland` [repo](https://github.com/MystenLabs/example-walrus-sites/tree/main/flatland).
ar: للحصول على مثال شامل ، راجع `flatland` [repo] (https://github.com/mystenlabs/example-walrus-sites/tree/main/flatland).

source: Technical Overview
ar: نظرة عامة تقنية

source: In the following sections, we delve deeper in the technical specification of Walrus Sites.
ar: في الأقسام التالية ، نتعمق في المواصفات الفنية لمواقع Walrus.

source: High-level picture
ar: صورة عالية المستوى

source: Walrus Sites are enabled by Sui and Walrus. The resources of the Walrus Site (`html`, `css`, `js`, images, etc.) are stored on Walrus, while the main entry point to it is an object stored on Sui, which contains the metadata for the site and point to the Walrus blob IDs.
ar: يتم تمكين مواقع Walrus بواسطة Sui وWalrus. يتم تخزين موارد موقع Walrus (`html`، `css`، `js`، الصور، إلخ.) على Walrus، بينما نقطة الدخول الرئيسية إليه هي كائن مخزن على Sui، والذي يحتوي على البيانات الوصفية للموقع ويشير إلى معرفات كتل بيانات Walrus.

source: The Walrus Sites objects on Sui
ar: مواقع Walrus تعترض على Sui

source: A Walrus `Site` is represented on Sui as a very simple object:
ar: يتم تمثيل Walrus "موقع" على Sui ككتلة بسيط للغاية:

source: The resources associated with this site are then added to this object as [dynamic fields](https://docs.sui.io/concepts/dynamic-fields/) of type `Resource`:
ar: ثم تتم إضافة الموارد المرتبطة بهذا الموقع إلى هذا الكتلة باسم [الحقول الديناميكية] (https://docs.sui.io/concepts/dynamic-fields/) من النوع `Resource`:

source: ```move struct Resource has store, drop { path: String, // The walrus blob id containing the bytes for this resource blob_id: u256, ⋮ } ```
ar: تحرك المورد الهيكل يحتوي على متجر ، إسقاط { المسار: سلسلة ، // معرف Walrus كتلة البيانات الذي يحتوي على بايت لهذا المورد كتلة البيانات_id: u256 ، ⋮ } `` `

source: Importantly, each resource contains:
ar: الأهم من ذلك ، كل مورد يحتوي على:

source: the `path` of the resource, for example `/index.html` (all the paths are always represented as starting from root `/`);
ar: "مسار" للموارد ، على سبيل المثال `/index.html` (يتم تمثيل جميع المسارات دائمًا على أنها تبدأ من الجذر`/`) ؛

source: the `blob_id`, which is the Walrus blob ID where the resource can be found; and
ar: "blob_id` ، وهو معرف Walrus كتلة البيانات حيث يمكن العثور على المورد ؛ و

source: additional fields, that will be explained later in the documentation.
ar: حقول إضافية ، سيتم شرحها لاحقًا في الوثائق.

source: These `Resource` dynamic fields are keyed with a struct of type `ResourcePath`
ar: يتم تحديد حقول "Resource" الديناميكية هذه باستخدام بنية من نوع "ResourcePath"

source: This struct just holds the string of the path (`/index.html`); having a separate type ensures that we will not have namespace collisions with other dynamic fields, possibly added by other packages.
ar: يحتفظ هذا الهيكل فقط بسلسلة المسار (`/index.html`)؛ حيث يضمن وجود نوع منفصل عدم حدوث تصادمات في المساحة الاسمية مع الحقول الديناميكية الأخرى، والتي ربما تمت إضافتها بواسطة حزم أخرى.

source: To see this in action, look at [a Walrus Site in the explorer](https://suiscan.xyz/testnet/object/0xd20b90149409ba5d005d4a2cd981db9494bc3cdb2f04c47ca1af98dd8f71610a), and check its dynamic fields.
ar: لمشاهدة هذا في العمل، انظر إلى [موقع Walrus في المستكشف](https://suiscan.xyz/testnet/object/0xd20b90149409ba5d005d4a2cd981db9494bc3cdb2f04c47ca1af98dd8f71610a)، وتحقق من حقوله الديناميكية.

source: The site rendering path
ar: مسار تقديم الموقع

source: Given the Sui object ID of a Walrus Site, it is easy to look up the resources that compose it by looking at the dynamic fields, and then fetch these resources from Walrus using the blob ID contained in the `Resource` struct.
ar: بالنظر إلى معرف كتلة البيانات SUI لموقع Walrus ، من السهل البحث عن الموارد التي تؤلفها من خلال النظر إلى الحقول الديناميكية ، ثم جلب هذه الموارد من Walrus باستخدام معرف كتلة البيانات الموجود في بنية `Resource`.

source: The only outstanding question is, therefore, how to perform these lookups on the client. A few approaches are possible:
ar: السؤال الوحيد المعقول هو كيفية إجراء عمليات البحث هذه على العميل. بعض الأساليب ممكنة:
