Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: `walrus daemon` offers the combined functionality of an aggregator and publisher on the same address and port.
ar: يوفر "Walrus Daemon" الوظائف المشتركة لمجمع وناشر على نفس العنوان والمنفذ.

source: The aggregator does not perform any on-chain actions, and only requires specifying the address on which it listens:
ar: لا يقوم المجمع بأي إجراءات على السلسلة ، ويتطلب فقط تحديد العنوان الذي يستمع إليه:

source: The publisher and daemon perform on-chain actions and thus require a Sui Testnet wallet with sufficient SUI and WAL balances. To enable handling many parallel requests without object conflicts, they create internal sub-wallets since version 1.4.0, which are funded from the main wallet. These sub-wallets are persisted in a directory specified with the `--sub-wallets-dir` argument; any existing directory can be used. If it already contains sub-wallets, they will be reused.
ar: يقوم الناشر والخفي بإجراءات على السلسلة ، وبالتالي يتطلب محفظة Sui للشبكة التجريبية مع أرصدة كافية Sui و Wal. لتمكين التعامل مع العديد من الطلبات المتوازية دون تعارضات كتلة البيانات ، فإنها تنشئ محافظ فرعية داخلية منذ الإصدار 1.4.0 ، والتي يتم تمويلها من المحفظة الرئيسية. تم استمرار هذه المحافظ الفرعية في دليل محدد مع حجة "المحافظات-الحوائط" ؛ يمكن استخدام أي دليل موجود. إذا كان يحتوي بالفعل على محافظ فرعية ، فسيتم إعادة استخدامها.

source: By default, 8 sub-wallets are created and funded. This can be changed with the `--n-clients` argument. For simple local testing, 1 or 2 sub-wallets are usually sufficient.
ar: بشكل افتراضي ، يتم إنشاء 8 محافظ فرعية وتمويلها. يمكن تغيير هذا مع حجة `-n-clients '. للاختبارات المحلية البسيطة ، عادة ما تكون محافظات فرعية واحدة أو 2 كافية.

source: For example, you can run a publisher with a single sub-wallet stored in the Walrus configuration directory with the following command:
ar: على سبيل المثال ، يمكنك تشغيل ناشر مع محفظة فرعية واحدة مخزنة في دليل تكوين Walrus مع الأمر التالي:

source: Replace `publisher` by `daemon` to run both an aggregator and publisher on the same address and port.
ar: استبدل "الناشر" بـ "Daemon" لتشغيل كل من مجمع وناشر على نفس العنوان والمنفذ.

source: Using a public aggregator or publisher
ar: باستخدام مجمع عام أو ناشر

source: For some use cases (e.g., a public website), or to just try out the HTTP API, a publicly accessible aggregator and/or publisher is required. Several entities run such aggregators and publishers, see the lists of public [aggregators](#public-aggregators) and [publishers](#public-publishers) below.
ar: بالنسبة لبعض حالات الاستخدام (على سبيل المثال، موقع ويب عام)، أو لتجربة واجهة برمجة تطبيقات HTTP، يلزم وجود مُجمِّع و/أو ناشر متاح للعامة. تدير العديد من الكيانات مثل هذه المُجمِّعات والناشرين، راجع قوائم [المُجمِّعين](#public-aggregators) و[الناشرين](#public-publishers) العامة أدناه.

source: Public publishers limit requests to 10 MiB by default. If you want to upload larger files, you need to [run your own publisher](#local-daemon) or use the [CLI](./client-cli.md).
ar: يحدد الناشرون العموميون الطلبات بـ 10 ميجا بايت افتراضيًا. إذا كنت تريد تحميل ملفات أكبر، فيتعين عليك [تشغيل الناشر الخاص بك](#local-daemon) أو استخدام [CLI](./client-cli.md).

source: Also, note that the publisher consumes (Testnet) SUI and WAL on the service side, and a Mainnet deployment would likely not be able to provide uncontrolled public access to publishing without requiring some authentication and compensation for the funds used.
ar: لاحظ أيضًا أن الناشر يستهلك (الشبكة التجريبية) SUI و WAL على جانب الخدمة ، ومن المحتمل ألا يتمكن نشر الشبكة الترئيسية من توفير وصول عام غير خاضع للرقابة إلى النشر دون الحاجة إلى بعض المصادقة والتعويض عن الأموال المستخدمة.

source: Public aggregators
ar: المجمعون العامون

source: The following is a list of know public aggregators; they are checked periodically, but each of them may still be temporarily unavailable:
ar: فيما يلي قائمة بالجمعين العامين المعروفين ؛ يتم فحصها بشكل دوري ، ولكن قد لا يزال كل منهم متاحًا مؤقتًا:

source: Public publishers
ar: الناشرون العامون

source: `https://walrus-testnet-publisher.nodeinfra.com`
ar: `https://testnet-publisher-walrus.kiliglab.io`

source: `http://walrus-testnet.stakingdefenseleague.com:9001`
ar: `http://walrus-publisher-testnet.latitude-sui.com:9001`

source: HTTP API Usage
ar: استخدام واجهة برمجة التطبيقات HTTP

source: For the following examples, we assume you set the `AGGREGATOR` and `PUBLISHER` environment variables to your desired aggregator and publisher, respectively. For example:
ar: بالنسبة للأمثلة التالية، نفترض أنك قمت بتعيين متغيرات البيئة `AGGREGATOR` و`PUBLISHER` إلى المجمِع والناشر المطلوبين على التوالي. على سبيل المثال:

source: Store
ar: تخزين

source: You can interact with the daemon through simple HTTP PUT requests. For example, with [cURL](https://curl.se), you can store blobs using a publisher or daemon as follows:
ar: يمكنك التفاعل مع الخادم من خلال طلبات HTTP PUT البسيطة. على سبيل المثال، باستخدام [cURL](https://curl.se)، يمكنك تخزين الكائنات باستخدام ناشر أو خادم على النحو التالي:

source: The store HTTP API end points return information about the blob stored in JSON format. When a blob is stored for the first time, a `newlyCreated` field contains information about the new blob:
ar: يقوم Store HTTP API End Points بإرجاع معلومات حول الكتلة المخزنة بتنسيق JSON. عندما يتم تخزين الكتلة لأول مرة ، يحتوي حقل "تم إنشاؤه حديثًا" على معلومات حول الكتلة الجديدة:

source: The information returned is the content of the [Sui blob object](../dev-guide/sui-struct.md).
ar: المعلومات التي تم إرجاعها هي محتوى [كتلة البيانات الخاصة بـ Sui](../dev-guide/sui-struct.md).

source: When the aggregator finds a certified blob with the same blob ID and a sufficient validity period, it returns a `alreadyCertified` JSON structure:
ar: عندما يجد المجمع كتلة بيانات معتمدة بنفس معرف كتلة البيانات وفترة صلاحيتها كافية، فإنه يعيد بنية JSON `alreadyCertified`:

source: The field `event` returns the [Sui event ID](../dev-guide/sui-struct.md) that can be used to find the transaction that created the Sui Blob object on the Sui explorer or using a Sui SDK.
ar: يقوم الحقل `event` بإرجاع معرف الحدث SUI] (../dev-guide/sui-truct.md) الذي يمكن استخدامه للعثور على المعاملة التي أنشأت كتلة البيانات Sui على مستكشف Sui أو باستخدام Sui SDK.

source: Read
ar: قراءة

source: Blobs may be read from an aggregator or daemon using HTTP GET. For example, the following cURL command reads a blob and writes it to an output file:
ar: يمكن قراءة النقط من مجمّع أو برنامج خفي باستخدام HTTP GET. على سبيل المثال، يقوم أمر cURL التالي بقراءة نقطة وكتابة ذلك إلى ملف الإخراج:

source: Alternatively you may print the contents of a blob in the terminal with the cURL command:
ar: أو يمكنك بدلاً من ذلك طباعة محتويات كتلة البيانات في المحطة الطرفية باستخدام الأمر cURL:

source: ```admonish tip title="Content sniffing" Modern browsers will attempt to sniff the content type for such resources, and will generally do a good job of inferring content types for media. However, the aggregator on purpose prevents such sniffing from inferring dangerous executable types such as JavaScript or style sheet types. ```
ar: `` `exmonish tip title =" Content Sniffing " ستحاول المتصفحات الحديثة استنشاق نوع المحتوى لمثل هذه الموارد ، وسوف تفعل عمومًا عمل جيد لاستنتاج أنواع المحتوى للوسائط. ومع ذلك ، فإن المجمع عن قصد يمنع مثل هذا استنشاق الأنواع القابلة للتنفيذ الخطرة مثل أنواع الألواح javaScript أو الأنماط. `` `

source: This guide introduces all the concepts needed to build applications that use Walrus as a storage or availability layer. The [overview](../design/overview.md) provides more background and explains in more detail how Walrus operates internally.
ar: يقدم هذا الدليل كل المفاهيم اللازمة لبناء التطبيقات التي تستخدم Walrus كطبقة تخزين أو طبقة توفر. يوفر [overview](../design/overview.md) المزيد من الخلفية ويشرح بمزيد من التفصيل كيفية عمل Walrus داخليًا.

source: This developer guide describes the following:
ar: يصف دليل المطور هذا ما يلي:

source: [Components](components.md) of Walrus of interest to developers that wish to use it for storage or availability.
ar: [مكونات] (مكونات.

source: [Operations](dev-operations.md) supported through client binaries, APIs, or Sui operations.
ar: [العمليات] (dev-operations.md) مدعومة من خلال ثنائيات العميل أو واجهات برمجة التطبيقات أو عمليات SUI.

source: [The Sui structures](sui-struct.md) Walrus uses to store metadata, and how they can be read from Sui smart contracts, or through the Sui SDK.
ar: [هياكل SUI] (Sui-truct.md) يستخدم Walrus لتخزين البيانات الوصفية ، وكيف يمكن قراءتها من عقود Sui Smart ، أو من خلال Sui SDK.

source: Refer again to the [glossary](../glossary.md) of terms as a reference.
ar: يرجى الرجوع مرة أخرى إلى [مصطلحات](../glossary.md) للمصطلحات كمرجع.

source: From a developer perspective, some Walrus components are objects and smart contracts on Sui, and some components are Walrus-specific binaries and services. As a rule, Sui is used to manage blob and storage node metadata, while Walrus-specific services are used to store and read blob contents, which can be very large.
ar: من منظور المطور ، بعض مكونات Walrus هي كتلةات وعقود ذكية على SUI ، وبعض المكونات هي ثنائيات وخدمات خاصة بWalrus. كقاعدة عامة ، يتم استخدام SUI لإدارة بيانات تعريف BLOB وعقدة التخزين ، في حين يتم استخدام الخدمات الخاصة بWalrus لتخزين محتويات كتلة البيانات وقراءةها ، والتي يمكن أن تكون كبيرة جدًا.

source: Walrus defines a number of objects and smart contracts on Sui:
ar: يحدد Walrus عددًا من الكائنات والعقود الذكية على Sui:

source: A shared _system object_ records and manages the current committee of storage nodes.
ar: يسجل كتلة البيانات _system المشترك ويدير اللجنة الحالية لعقد التخزين.

source: _Storage resources_ represent empty storage space that may be used to store blobs.
ar: _storage Resources_ تمثل مساحة تخزين فارغة يمكن استخدامها لتخزين الكتل.

source: _Blob resources_ represent blobs being registered and certified as stored.
ar: _كتلة البيانات Resources_ تمثل الكتل التي يتم تسجيلها واعتمادها على أنها مخزنة.

source: Changes to these objects emit _Walrus-related events_.
ar: التغييرات على هذه الكائنات تنبعث منها الأحداث المتعلقة بالـ WoLrus.

source: The Walrus system object ID can be found in the Walrus `client_config.yaml` file (see [Configuration](../usage/setup.md#configuration)). You may use any Sui explorer to look at its content, as well as explore the content of blob objects. There is more information about these in the [quick reference to the Walrus Sui structures](sui-struct.md).
ar: يمكن العثور على معرف كتلة البيانات نظام Walrus في ملف `client_config.yaml` الخاص بـ Walrus (انظر [Configuration](../usage/setup.md#configuration)). يمكنك استخدام أي مستكشف Sui للاطلاع على محتواه، بالإضافة إلى استكشاف محتوى كتلةات blob. هناك مزيد من المعلومات حول هذه الكائنات في [مرجع سريع لهياكل Walrus Sui](sui-struct.md).

source: Walrus is also composed of a number of Walrus-specific services and binaries:
ar: يتكون Walrus أيضًا من عدد من الخدمات والثنائيات الخاصة بWalrus:

source: A client (binary) can be executed locally and provides a [Command Line Interface (CLI)](../usage/client-cli.md), a [JSON API](../usage/json-api.md) and an [HTTP API](../usage/web-api.md) to perform Walrus operations.
ar: يمكن تنفيذ العميل (الثنائي) محليًا ويوفر [واجهة سطر الأوامر (CLI)](../usage/client-cli.md) و[واجهة برمجة تطبيقات JSON](../usage/json-api.md) و[واجهة برمجة تطبيقات HTTP](../usage/web-api.md) لإجراء عمليات Walrus.

source: Aggregator services allow reading blobs via HTTP requests.
ar: تسمح خدمات المجمع بقراءة الكتل عبر طلبات HTTP.

source: Publisher services are used to store blobs to Walrus.
ar: يتم استخدام خدمات الناشر لتخزين الكتل إلى Walrus.

source: A set of storage nodes store encoded blobs. These nodes form the decentralized storage infrastructure of Walrus.
ar: مجموعة من العقد التخزين المتجر المتجر المشفرة. تشكل هذه العقد البنية التحتية للتخزين اللامركزية في Walrus.

source: Aggregators, publishers, and other services use the client APIs to interact with Walrus. End users of services using Walrus interact with the store via custom services, aggregators, or publishers that expose HTTP APIs to avoid the need to run locally a binary client.
ar: يستخدم المجمعون والناشرين والخدمات الأخرى واجهات برمجة تطبيقات العميل للتفاعل مع Walrus. يتفاعل المستخدمون النهائيون للخدمات التي تستخدم Walrus مع المتجر عبر الخدمات المخصصة أو المجمعين أو الناشرين الذين يعرضون HTTP APIs لتجنب الحاجة إلى تشغيل عميل ثنائي محليًا.

source: Blob encoding and blob ID
ar: تشفير الكتلة المعرّفة ومعرف الكتلة

source: Walrus stores blobs across storage nodes in an [encoded form](../design/encoding.md), and refers to blobs by their _blob ID_. The blob ID is deterministically derived from the content of a blob and the Walrus configuration. The blob ID of two files with the same content will be the same.
ar: يخزن Walrus الكتل عبر عقد التخزين في [شكل مشفر](../design/التشفير.md)، ويشير إلى الكتل من خلال معرف الكتلة الخاص بها. يتم اشتقاق معرف الكتلة بشكل حتمي من محتوى الكتلة وتكوين Walrus. سيكون معرف الكتلة لملفين بنفس المحتوى هو نفسه.

source: You can derive the blob ID of a file locally using the command: `walrus blob-id <file path>`.
ar: يمكنك استخلاص معرف كتلة البيانات من ملف محليًا باستخدام الأمر: `Walrus كتلة البيانات-ID <path>`.

source: Walrus may be used to **store a blob**, via the native client APIs or a publisher.
ar: يمكن استخدام Walrus لتخزين كتلة البيانات ** ، عبر واجهات برمجة تطبيقات العميل الأصلية أو الناشر.

source: Under the hood a number of operations happen both on Sui as well as on storage nodes:
ar: تحت الغطاء ، يحدث عدد من العمليات على كل من SUI وكذلك على عقد التخزين:

source: The client or publisher encodes the blob and derives a _blob ID_ that identifies the blob. This is a `u256` often encoded as a URL-safe base64 string.
ar: يقوم العميل أو الناشر بتشفير الكتلة ويستمد _كتلة البيانات id_ الذي يحدد الكتلة. هذا هو "U256" غالبًا ما يتم ترميزه كسلسلة Base64 التي آمنت عناوين URL.

source: A transaction is executed on Sui to purchase some storage from the system object, and then to _register the blob ID_ occupying this storage. Client APIs return the _Sui blob object ID_. The transactions use SUI to purchase storage and pay for gas.
ar: يتم تنفيذ المعاملة على SUI لشراء بعض التخزين من كتلة البيانات النظام ، ثم لإعداد كتلة البيانات id_ احتلال هذا التخزين. APIs Client Return the _sui كتلة البيانات object id_. تستخدم المعاملات SUI لشراء التخزين والدفع مقابل الغاز.

source: Encoded slivers of the blob are distributed to all storage nodes. They each sign a receipt.
ar: يتم توزيع الشظايا المشفرة من الكتلة على جميع عقد التخزين. كل التوقيع على إيصال.

source: Signed receipts are aggregated and submitted to the Sui blob object to _certify the blob_. Certifying a blob emits a Sui event with the blob ID and the period of availability.
ar: يتم تجميع الإيصالات الموقعة وإرسالها إلى كتلة بيانات Sui لـ _certify the blob_. يؤدي تصديق كتلة البيانات إلى إصدار حدث Sui مع معرف كتلة البيانات وفترة التوفر.

source: A blob is considered available on Walrus once the corresponding Sui blob object has been certified in the final step. The steps involved in a store operation can be executed by the binary client, or a publisher that accepts and publishes blobs via HTTP.
ar: يعتبر كتلة البيانات متاحًا على Walrus بمجرد اعتماد كتلة البيانات Sui كتلة البيانات المقابل في الخطوة الأخيرة. يمكن تنفيذ الخطوات المتضمنة في عملية المتجر من قبل العميل الثنائي ، أو الناشر الذي يقبل وينشر الكتل عبر HTTP.

source: Walrus currently allows the storage of blobs up to a maximum size that may be determined through the [`walrus info`](../usage/client-cli.md#walrus-system-information) CLI command. The maximum blob size is currently 13.3 GiB. You may store larger blobs by splitting them into smaller chunks.
ar: يسمح Walrus حاليًا بتخزين كتل تصل إلى حجم أقصى يمكن تحديده من خلال أمر CLI [`walrus info`](../usage/client-cli.md#walrus-system-information). يبلغ الحد الأقصى لحجم الكتلة حاليًا 13.3 جيجابايت. يمكنك تخزين الكتل الكبيرة عن طريق تقسيمها إلى أجزاء أصغر.

source: Blobs are stored for a certain number of _epochs_, as specified at the time they were stored. Walrus storage nodes ensure that within these epochs a read succeeds. The current Testnet uses a short epoch duration of one day for testing purposes, but Mainnet epochs are likely to be longer such as many weeks each.
ar: يتم تخزين الكتل لعدد معين من العصور، كما هو محدد في وقت تخزينها. تضمن عقد تخزين Walrus نجاح عملية القراءة خلال هذه العصور. تستخدم شبكة الاختبار الحالية مدة قصيرة من العصر تبلغ يومًا واحدًا لأغراض الاختبار، ولكن من المرجح أن تكون عصور الشبكة الرئيسية أطول مثل عدة أسابيع لكل منها.

source: Walrus can also be used to **read a blob** after it is stored by providing its blob ID. A read is executed by performing the following steps:
ar: يمكن أيضًا استخدام Walrus لـ ** قراءة كتلة البيانات ** بعد تخزينه من خلال توفير معرف كتلة البيانات الخاص به. يتم تنفيذ قراءة من خلال تنفيذ الخطوات التالية:

source: The system object on Sui is read to determine the Walrus storage node committee.
ar: تتم قراءة كتلة البيانات النظام على SUI لتحديد لجنة عقدة تخزين Walrus.

source: A number of storage nodes are queried for blob metadata and the slivers they store.
ar: يتم الاستعلام عن عدد من عقد التخزين لبيانات تعريف كتلة البيانات و Slivers التي يخزنونها.

source: The blob is reconstructed from the recovered slivers and checked against the blob ID.
ar: يتم إعادة بناء الكتلة من الشظايا المستردة ويتم فحصها مقابل معرف كتلة البيانات.

source: The steps involved in the read operation are performed by the binary client, or the aggregator service that exposes an HTTP interface to read blobs. Reads are extremely resilient and will succeed in recovering the blob in all cases even if up to one-third of storage nodes are unavailable. In most cases, after synchronization is complete, blob can be read even if two-thirds of storage nodes are down.
ar: يتم تنفيذ الخطوات التي ينطوي عليها عملية القراءة من قبل العميل الثنائي ، أو خدمة المجمع التي تكشف واجهة HTTP لقراءة الكتل. القراءات مرنة للغاية وستنجح في استرداد الكتلة في جميع الحالات حتى لو لم يكن ثلث عقد التخزين متوفرة. في معظم الحالات ، بعد اكتمال التزامن ، يمكن قراءة BLOB حتى إذا انخفض ثلثي عقد التخزين.

source: Certify Availability
ar: التصديق على التوافر

source: Walrus can be used to **certify the availability of a blob** using Sui. Checking that this happened may currently be done in 3 different ways:
ar: يمكن استخدام Walrus لـ **التحقق من توفر كائن** باستخدام Sui. يمكن حاليًا التحقق من حدوث ذلك بثلاث طرق مختلفة:

source: A Sui SDK read can be used to authenticate the certified blob event emitted when the blob ID was certified on Sui. The client `walrus blob-status` command may be used to identify the event ID that needs to be checked.
ar: يمكن استخدام قراءة SDK الخاصة بـ Sui للتحقق من صحة حدث كتلة البيانات المصدقة الذي تم إصداره عند التحقق من معرف كتلة البيانات المصدقة على Sui. يمكن استخدام أمر العميل `walrus blob-status` لتحديد معرف الحدث الذي يحتاج إلى التحقق.

source: A Sui SDK read may be used to authenticate the Sui blob object corresponding to the blob ID, and check it is certified, before the expiry epoch, and not deletable.
ar: يمكن استخدام قراءة SDK Sui للتحقق من صحة كائن كتلة بيانات Sui المقابل لمعرف بيانات الكتلة، والتحقق من اعتماده، قبل انتهاء الصلاحية، وعدم إمكانية حذفه.

source: A Sui smart contract can read the blob object on Sui (or a reference to it) to check it is certified, before the expiry epoch, and not deletable.
ar: يمكن لعقد Sui الذكي قراءة كتلة بيانات على Sui (أو مرجع إليه) للتحقق من أنه معتمد، قبل انتهاء الصلاحية، وغير قابل للحذف.

source: The underlying protocol of the [Sui light client](https://github.com/MystenLabs/sui/tree/main/crates/sui-light-client) returns digitally signed evidence for emitted events or objects, and can be used by off-line or non-interactive applications as a proof of availability for the blob ID for a certain number of epochs.
ar: يعيد البروتوكول الأساسي لعميل [Sui light](https://github.com/MystenLabs/sui/tree/main/crates/sui-light-client) أدلة موقعة رقميًا للأحداث أو الكائنات المنبعثة، ويمكن استخدامه بواسطة التطبيقات غير المتصلة بالإنترنت أو غير التفاعلية كدليل على توفر معرف الكائن لعدد معين من العصور.

source: Once a blob is certified, Walrus will ensure that sufficient slivers will always be available on storage nodes to recover it within the specified epochs.
ar: بمجرد اعتماد الكتلة ، ستضمن Walrus أن يتم توفير الشظايا الكافية دائمًا على عقد التخزين لاستعادتها داخل الحقبة المحددة.

source: Delete
ar: مسح

source: Stored blobs can be optionally set as deletable by the user that creates them. This metadata is stored in the Sui blob object, and whether a blob is deletable or not is included in certified blob events. A deletable blob may be deleted by the owner of the blob object, to reclaim and re-use the storage resource associated with it.
ar: يمكن تعيين الكتل المخزنة اختياريًا على أنها حذف من قبل المستخدم الذي ينشئها. يتم تخزين هذا البيانات الوصفية في كتلة البيانات Sui كتلة البيانات ، وما إذا كانت الكتلة قابلة للحذف أم لا يتم تضمينها في أحداث كتلة البيانات معتمدة. قد يتم حذف كتلة البيانات حذف من قبل مالك كتلة البيانات كتلة البيانات ، لاستعادة وإعادة استخدام مورد التخزين المرتبط به.

source: If no other copies of the blob exist in Walrus, deleting a blob will eventually make it unrecoverable using read commands. However, if other copies of the blob exist on Walrus, a delete command will reclaim storage space for the user that invoked it, but will not make the blob unavailable until all other copies have been deleted or expire.
ar: إذا لم تكن هناك نسخ أخرى من الكتلة في Walrus ، فإن حذف الكتلة سيجعلها في النهاية غير قابلة للاسترداد باستخدام أوامر القراءة. ومع ذلك ، إذا كانت هناك نسخ أخرى من الكتلة على Walrus ، فسيقوم أمر الحذف باستعادة مساحة التخزين للمستخدم الذي استدعىها ، ولكن لن تجعل الكتلة غير متوفرة حتى يتم حذف جميع النسخ الأخرى أو انتهاء صلاحيتها.

source: Sui Structures
ar: هياكل Sui

source: This section is optional and enables advanced use cases.
ar: هذا القسم اختياري ويمكن حالات الاستخدام المتقدمة.

source: You can interact with Walrus purely through the client CLI, and JSON or HTTP APIs provided, without querying or executing transactions on Sui directly. However, Walrus uses Sui to manage its metadata and smart contract developers can read information about the Walrus system, as well as stored blobs, on Sui.
ar: يمكنك التفاعل مع Walrus من خلال واجهة سطر الأوامر الخاصة بالعميل وواجهات برمجة التطبيقات JSON أو HTTP المقدمة، دون الاستعلام عن المعاملات أو تنفيذها على Sui بشكل مباشر. ومع ذلك، يستخدم Walrus Sui لإدارة بياناته الوصفية ويمكن لمطوري العقود الذكية قراءة المعلومات حول نظام Walrus، بالإضافة إلى الكائنات المخزنة، على Sui.

source: The Move code of the Walrus Testnet contracts is available at <https://github.com/MystenLabs/walrus-docs/blob/main/contracts>. An example package using the Walrus contracts is available at <https://github.com/MystenLabs/walrus-docs/blob/main/examples/move>.
ar: يتوفر كود Move الخاص بعقود شبكة Walrus التجريبية على <https://github.com/MystenLabs/walrus-docs/blob/main/contracts>. يتوفر نموذج حزمة يستخدم عقود Walrus على <https://github.com/MystenLabs/walrus-docs/blob/main/examples/move>.

source: The following sections provide further insights into the contract and an overview of how you may use Walrus objects in your own Sui smart contracts.
ar: توفر الأقسام التالية المزيد من الأفكار حول العقد ونظرة عامة على كيفية استخدام كتلةات Walrus في عقود Sui Smart الخاصة بك.

source: ```admonish danger title="A word of caution" Walrus Mainnet will use new Move packages with `struct` layouts and function signatures that may not be compatible with this package. Move code that builds against this package will need to be rewritten. ```
ar: `` `` interains danger title = "a word of the trea" سوف تستخدم شبكة Walrus الرئيسية حزم Move جديدة مع تخطيطات `struct` وتوقيعات الوظائف التي قد لا تكون تكون متوافقة مع هذه الحزمة. يجب إعادة كتابة كود Move الذي يُبنى مقابل هذه الحزمة. `` `
