Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: Once this is done, you should be able to simply type `walrus` in your terminal. For example you can get usage instructions (see [the next chapter](./interacting.md) for further details):
ar: بمجرد الانتهاء من ذلك ، يجب أن تكون قادرًا على كتابة "Walrus" في محطةك. على سبيل المثال ، يمكنك الحصول على تعليمات الاستخدام (انظر [الفصل التالي] (./ Interacting.md) لمزيد من التفاصيل):

source: ```admonish tip Our latest Testnet Walrus binaries are also available on Walrus itself, namely on <https://bin.blob.store>, for example, <https://bin.blob.store/walrus-testnet-latest-ubuntu-x86_64>. ```
ar: ```نصيحة تحذيرية تتوفر أيضًا ملفاتنا الثنائية الأحدث من شبكة Walrus التجريبية على Walrus نفسها، أي على <https://bin.blob.store>، على سبيل المثال، <https://bin.blob.store/walrus-testnet-latest-ubuntu-x86_64>. ```

source: Previous versions (optional)
ar: الإصدارات السابقة (اختيارية)

source: In addition to the latest version of the `walrus` binary, the GCS bucket also contains previous versions. An overview in XML format is available at <https://storage.googleapis.com/mysten-walrus-binaries/>.
ar: بالإضافة إلى أحدث إصدار من ثنائي "Walrus" ، يحتوي دلو GCS أيضًا على إصدارات سابقة. يتوفر نظرة عامة بتنسيق XML على <https://storage.googleapis.com/mysten-walrus-binaries/>.

source: Configuration
ar: إعدادات

source: The Walrus client needs to know about the Sui objects that store the Walrus system and staking information, see the [developer guide](../dev-guide/sui-struct.md#system-and-staking-information). These need to be configured in a file `~/.config/walrus/client_config.yaml`.
ar: يحتاج عميل Walrus إلى معرفة كائنات Sui التي تخزن معلومات نظام Walrus ومعلومات الحصة، راجع [دليل المطور](../dev-guide/sui-struct.md#system-and-staking-information). يجب تكوين هذه الكائنات في ملف `~/.config/walrus/client_config.yaml`.

source: The current Testnet deployment uses the following objects:
ar: يستخدم نشر الشبكة التجريبية الحالي الكائنات التالية:

source: Note that configuring multiple exchange objects are only supported with the CLI version 1.2.0 or higher.
ar: لاحظ أن تكوين كتلةات تبادل متعددة مدعومة فقط مع الإصدار CLI 1.2.0 أو أعلى.

source: ````admonish tip The easiest way to obtain the latest configuration is by downloading it from <https://docs.blob.store/client_config.yaml>: ```sh curl https://docs.blob.store/client_config.yaml -o ~/.config/walrus/client_config.yaml ``` ````
ar: "نصيحة" أسهل طريقة للحصول على أحدث التكوين هي تنزيله من <https://docs.كتلة البيانات.store/client_config.yaml>: `` sh curl https://docs.كتلة البيانات.store/client_config.yaml -o ~/.config/walrus/client_config.yaml `` ` `` ``

source: Custom path (optional)
ar: مسار مخصص (اختياري)

source: By default, the Walrus client will look for the `client_config.yaml` (or `client_config.yml`) configuration file in the current directory, `$XDG_CONFIG_HOME/walrus/`, `~/.config/walrus/`, or `~/.walrus/`. However, you can place the file anywhere and name it anything you like; in this case you need to use the `--config` option when running the `walrus` binary.
ar: بشكل افتراضي ، سيبحث عميل Walrus عن ملف تكوين `client_config.yaml` (أو` client_config.yml`) في الدليل الحالي ، `$ xdg_config_home/walrus/` ، `~/.config/walrus/` ، أو `، أو` ~/.walrus/`. ومع ذلك ، يمكنك وضع الملف في أي مكان وتسمية أي شيء تريده ؛ في هذه الحالة ، تحتاج إلى استخدام خيار `-config` عند تشغيل" Walrus` الثنائية ".

source: Advanced configuration (optional)
ar: التكوين المتقدم (اختياري)

source: The configuration file currently supports the following parameters:
ar: يدعم ملف التكوين حاليًا المعلمات التالية:

source: # These are the only mandatory fields. These objects are specific for a particular Walrus # deployment but then do not change over time. system_object
ar: # هذه هي الحقول الإلزامية الوحيدة. هذه الكائنات خاصة بWalrus معين # النشر ولكن بعد ذلك لا تتغير بمرور الوقت. System_object

source: # The exchange objects are used to swap SUI for WAL. If multiple ones are defined (as below), a # random one is chosen for the exchange. exchange_object
ar: # يتم استخدام كتلةات التبادل لمبادلة SUI لـ WAL. إذا تم تعريف عدة منها (على النحو التالي) ، أ # يتم اختيار واحد عشوائي للتبادل. Exchange_object

source: # You can define a custom path to your Sui wallet configuration here. If this is unset or `null`, # the wallet is configured from `./sui_config.yaml` (relative to your current working directory), or # the system-wide wallet at `~/.sui/sui_config/client.yaml` in this order. wallet_config
ar: # يمكنك تحديد مسار مخصص لتكوين محفظة SUI هنا. إذا كان هذا غير محدد أو "فارغ" ، # تم تكوين المحفظة من `./sui_config.yaml` (نسبة إلى دليل العمل الحالي) ، أو # محفظة على مستوى النظام في `~/.sui/sui_config/client.yaml` في هذا الترتيب. wallet_config

source: # The following parameters can be used to tune the networking behavior of the client. There is no # risk in playing around with these values. In the worst case, you may not be able to store/read # blob due to timeouts or other networking errors. communication_config
ar: # يمكن استخدام المعلمات التالية لضبط سلوك الشبكات للعميل. لا يوجد # المخاطر في اللعب مع هذه القيم. في أسوأ الحالات ، قد لا تتمكن من التخزين/القراءة # كتلة البيانات بسبب المهلة أو أخطاء الشبكات الأخرى. communication_config

source: nanos
ar: طلب

source: factor
ar: عامل

source: base
ar: قاعدة

source: ```admonish warning title="Important" If you specify a wallet path, make sure your wallet is set up for Sui **Testnet**. ```
ar: `` `` andern endling title = "Target" إذا قمت بتحديد مسار محفظة ، فتأكد من إعداد محفظتك على **لشبكة Sui التجريبية **. `` `

source: Testnet WAL faucet
ar: صنبور WAL على الشبكة التجريبية

source: The Walrus Testnet uses Testnet WAL tokens to buy storage and stake. Testnet WAL tokens have no value and can be exchanged (at a 1:1 rate) for some Testnet SUI tokens, which also have no value, through the following command:
ar: تستخدم شبكة Walrus التجريبة عملات WAL الخاصة بالشبكة التجرييبة لشراء التخزين والحصة. لا تحمل عملات WAL الخاصة بالشبكة التجريبية أي قيمة ويمكن استبدالها (بمعدل 1:1) ببعض عملات SUI الخاصة بالشبكة التجريبية، والتي لا تحمل أي قيمة أيضًا، من خلال الأمر التالي:

source: You can check that you have received Testnet WAL by checking the Sui balances:
ar: يمكنك التحقق من أنك تلقيت عملات Wal على الشبكة التجريبية من خلال التحقق من أرصدة SUI:

source: By default, 0.5 SUI are exchanged for 0.5 WAL, but a different amount of SUI may be exchanged using the `--amount` option (the value is in MIST/FROST), and a specific SUI/WAL exchange object may be used through the `--exchange-id` option. The `walrus get-wal --help` command provides more information about those.
ar: افتراضيًا، يتم استبدال 0.5 SUI بـ 0.5 WAL، ولكن يمكن استبدال كمية مختلفة من SUI باستخدام الخيار `--amount` (القيمة موجودة في MIST/FROST)، ويمكن استخدام كتلة البيانات تبادل SUI/WAL محدد من خلال الخيار `--exchange-id`. يوفر الأمر `walrus get-wal --help` مزيدًا من المعلومات حول هذه الكائنات.

source: We provide 3 ways to interact directly with the Walrus storage system:
ar: نحن نقدم 3 طرق للتفاعل مباشرة مع نظام تخزين Walrus:

source: Through the Walrus [client command line interface (CLI)](./client-cli.md).
ar: من خلال واجهة سطر أوامر العميل (CLI) لـWalrus[./client-cli.md).

source: Through a [JSON API](./json-api.md) of the Walrus CLI.
ar: من خلال [JSON API](./json-api.md) من Walrus CLI.

source: Through an [HTTP API](./web-api.md) exposed by a public or local Walrus client daemon.
ar: من خلال [واجهة برمجة تطبيقات HTTP](./web-api.md) المعروضة بواسطة عميل Walrus عام أو محلي.

source: Furthermore, users can [stake and unstake](./stake.md) through the staking dApp or Sui smart contracts.
ar: علاوة على ذلك، يمكن للمستخدمين [المشاركة وإلغاء المشاركة](./stake.md) من خلال تطبيق الحصة اللامركزي أو عقود Sui الذكية.

source: Using the Walrus client
ar: باستخدام عميل Walrus

source: The `walrus` binary can be used to interact with Walrus as a client. See the [setup chapter](./setup.md) for prerequisites, installation, and configuration.
ar: يمكن استخدام الملف الثنائي `walrus` للتفاعل مع Walrus كعميل. راجع [فصل الإعداد](./setup.md) للتعرف على المتطلبات الأساسية والتثبيت والتكوين.

source: Detailed usage information is available through
ar: معلومات الاستخدام التفصيلية متوفرة من خلال

source: Each sub-command of `walrus` can also be called with `--help` to print its specific arguments and their meaning.
ar: يمكن أيضًا استدعاء كل موظف فرعي من "Walrus" مع "-help` لطباعة حججه المحددة ومعناها.

source: Walrus system information
ar: معلومات نظام Walrus

source: Information about the Walrus system is available through the `walrus info` command. For example, `walrus info` gives an overview of current system parameters such as the current epoch, the number of storage nodes and shards in the system, the maximum blob size, and the current cost in (Testnet) WAL for storing blobs:
ar: تتوفر معلومات حول نظام Walrus من خلال أمر `Walrus Info`. على سبيل المثال ، يقدم "Walrus Info` نظرة عامة على معلمات النظام الحالية مثل الحقبة الحالية ، وعدد عقد التخزين والشقطات في النظام ، والحجم القصوى لقطات ، والتكلفة الحالية في (الشبكة التجريبية) Wal لتخزين الكتل:

source: ```admonish tip title="FROST and WAL" FROST is the smaller unit of WAL, similar to MIST for SUI. The conversion is also the same as for SUI: `1 WAL = 1 000 000 000 FROST`. ```
ar: `` `exmonish tip title =" Frost and Wal " Frost هي الوحدة الأصغر من Wal ، على غرار Mist for Sui. التحويل هو نفسه كما ل SUI: `1 WAL = 1 000 000 000 Frost`. `` `

source: Additional information such as encoding parameters and sizes, BFT system information, and information on the storage nodes in the current and (if already selected) the next committee, including their node IDs and stake and shard distribution can be viewed with the `--dev` argument: `walrus info --dev`.
ar: يمكن عرض معلومات إضافية مثل معلمات التشفير والأحجام، ومعلومات نظام BFT، ومعلومات حول عقد التخزين في اللجنة الحالية و(إذا تم تحديدها بالفعل) اللجنة التالية، بما في ذلك معرفات العقد وتوزيع الحصة والشظايا، باستخدام `--dev`: `walrus info --dev`.

source: Storing, querying status, and reading blobs
ar: تخزين ، حالة الاستعلام ، وقراءة الكتل

source: ```admonish tip title="Obtaining Testnet WAL" You can exchange Testnet SUI for Testnet WAL by running `walrus get-wal`. See the [setup page](./setup.md#testnet-wal-faucet) for further details. ```
ar: ```admonish tip title="الحصول على عملات الشبكة التجريبية WAL" يمكنك استبدال عملات الشبكة التجريبية SUI بـ عملات الشبكة التجريبية WAL من خلال تشغيل `walrus get-wal`. راجع [setup page](./setup.md#الشبكة التجريبية-wal-faucet) لمزيد من التفاصيل. ```

source: Storing blobs on Walrus can be achieved through the following command:
ar: يمكن تحقيق تخزين الكتل على Walrus من خلال الأمر التالي:

source: The CLI argument `--epochs <EPOCHS>` (or `-e`) indicates the number of epochs the blob should be stored for. There is an upper limit on the number of epochs a blob can be stored for, which is 200 for the current Testnet deployment.
ar: تشير حجة CLI `-حقبةs <حقبةs>` (أو `-e`) إلى عدد الأحداث التي يجب تخزينها. هناك حد أعلى لعدد الأحداث التي يمكن تخزينها ، والتي هي 200 لنشر الشبكة التجريبية الحالي.

source: ```admonish tip title="Automatic optimizations" When storing a blob, the client performs a number of automatic optimizations, including the following: - If the blob is already stored as a *permanent blob* on Walrus for a sufficient number of epochs the command does not store it again. This behavior can be overwritten with the `--force` (or `-f`) CLI option, which stores the blob again and creates a fresh blob object on Sui belonging to the wallet address. - If the user's wallet has a compatible storage resource, this one is (re-)used instead of buying a new one. - If the blob is already certified on Walrus but as a *deletable* blob or not for a sufficient number of epochs, the command skips sending data to the storage nodes and just collects the availability certificate ```
ar: `` `` tip title title = "التحسينات التلقائية" عند تخزين الكتلة ، يقوم العميل بإجراء عدد من التحسينات التلقائية ، بما في ذلك التالي: - إذا تم تخزين الكتلة بالفعل كقطعة دائمة * على Walrus لعدد كاف من الحقبة لا يخزن الأمر مرة أخرى. يمكن كتابة هذا السلوك مع "-القوة" (أو "-f`) خيار CLI ، الذي يخزن الكتلة مرة أخرى وإنشاء كتلة البيانات كتلة البيانات جديد على SUI ينتمي إلى عنوان محفظة. - إذا كانت محفظة المستخدم تحتوي على شركات مورد تخزين قابل للتخزين ، يتم استخدام هذا (إعادة) بدلاً من شراء أ جديد. - إذا كانت الكتلة معتمدة بالفعل على Walrus ولكن كحذف * كتلة البيانات أو لا يكفي عدد الأحداث ، يتخطى الأمر إرسال البيانات إلى عقد التخزين ويجمع فقط شهادة التوافر `` `

source: The status of a blob can be queried through one of the following commands:
ar: يمكن الاستعلام عن حالة الكتلة من خلال أحد الأوامر التالية:

source: This returns whether the blob is stored and its availability period. If you specify a file with the `--file` option,the CLI re-encodes the content of the file and derives the blob ID before checking the status.
ar: هذا يعود ما إذا كان يتم تخزين الكتلة وفترة توافرها. إذا قمت بتحديد ملف مع خيار `-file` ، فإن CLI يعيد ترميز محتوى الملف ويستمد معرف كتلة البيانات قبل التحقق من الحالة.

source: When the blob is available, the `blob-status` command also returns the `BlobCertified` Sui event ID, which consists of a transaction ID and a sequence number in the events emitted by the transaction. The existence of this event certifies the availability of the blob.
ar: عندما تتوفر كتلة البيانات ، يقوم أمر "STATUS" أيضًا بإرجاع معرف حدث "BlobCertified" SUI ، والذي يتكون من معرف المعاملة ورقم تسلسل في الأحداث المنبعثة من المعاملة. إن وجود هذا الحدث يشهد على توفر الكتلة.

source: Reading blobs from Walrus can be achieved through the following command:
ar: يمكن تحقيق قراءة الكتل من Walrus من خلال الأمر التالي:

source: By default the blob data is written to the standard output. The `--out <OUT>` CLI option (or `-o`) can be used to specify an output file name. The `--rpc-url <URL>` (or `-r`) may be used to specify a Sui RPC node to use instead of the one set in the wallet configuration or the default one.
ar: بشكل افتراضي ، تتم كتابة بيانات كتلة البيانات إلى الإخراج القياسي. يمكن استخدام خيار `-out <out>` cli (أو `-o`) لتحديد اسم ملف الإخراج. يمكن استخدام `-rpc-url <Url>` (أو "-r`) لتحديد عقدة Sui RPC لاستخدامها بدلاً من المجموعة في تكوين المحفظة أو العقد الافتراضي.

source: Reclaiming space via deletable blobs
ar: استعادة مساحة عبر الكتلية الحذف

source: By default `walrus store` uploads a blob and Walrus will keep it available until after its expiry epoch. Not even the uploader may delete it beforehand. However, optionally, the store command may be invoked with the `--deletable` flag, to indicate the blob may be deleted before its expiry by the owner of the Sui blob object representing the blob. Deletable blobs are indicated as such in the Sui events that certify them, and should not be relied upon for availability by others.
ar: بشكل افتراضي ، يقوم "متجر Walrus" بتحميل كتلة البيانات وسيبقيه Walrus متاحًا حتى بعد فترة انتهاء الصلاحية. لا يجوز حتى لعلم التحميل حذفه مسبقًا. ومع ذلك ، اختياريًا ، قد يتم استدعاء أمر المتجر بعلم "-حذف" ، للإشارة إلى أنه قد يتم حذف الكتلة قبل انتهاء صلاحيتها من قبل مالك كتلة البيانات Sui كتلة البيانات الذي يمثل كتلة البيانات. يشار إلى الكتل القابلة للحساب على هذا النحو في أحداث SUI التي تصادقها ، ويجب عدم الاعتماد عليها لتوافر الآخرين.

source: A deletable blob may be deleted with the command:
ar: قد يتم حذف كتلة البيانات حذف مع الأمر:

source: Optionally the delete command can be invoked by specifying a `--file <PATH>` option, to derive the blob ID from a file, or `--object-id <SUI_ID>` to delete the blob in the Sui blob object specified.
ar: اختياريا يمكن استدعاء الأمر الحذف عن طريق تحديد خيار `-file <path>` ، لاستخلاص معرف كتلة البيانات من ملف ، أو `-objected <sui_id>` لحذف كتلة البيانات في كتلة البيانات sui كتلة البيانات المحدد .

source: Before deleting a blob, the `walrus delete` command will ask for confirmation unless the `--yes` (or `-y`) option is specified.
ar: قبل حذف الكتلة ، سيطلب الأمر "Win Walte Delete` التأكيد ما لم يتم تحديد خيار"-yes` (أو `-y`).

source: The `delete` command reclaims the storage object associated with the deleted blob, which is re-used to store new blobs. The delete operation provides flexibility around managing storage costs and re-using storage.
ar: يسترجع أمر `delete` كتلة البيانات التخزين المرتبط بالكتلة المحذوفة ، والتي تتم إعادة استخدامها لتخزين الكتل الجديدة. توفر عملية الحذف مرونة حول إدارة تكاليف التخزين وإعادة استخدام التخزين.

source: The delete operation has limited utility for privacy: It only deletes slivers from the current epoch storage nodes, and subsequent epoch storage nodes, if no other user has uploaded a copy of the same blob. If another copy of the same blob exists in Walrus, the delete operation will not make the blob unavailable for download, and `walrus read` invocations will download it. After the deletion is finished, the CLI checks the updated status of the blob to see if it is still accessible in Walrus (unless the `--no-status-check` option is specified). However, even if it isn't, copies of the public blob may be cached or downloaded by users, and these copies are not deleted.
ar: تحتوي عملية الحذف على فائدة محدودة للخصوصية: إنها تحذف فقط الشظايا من عقد تخزين الحقبة الحالية ، وعقد تخزين الحقبة اللاحقة ، إذا لم يكن هناك مستخدم آخر قد قام بتحميل نسخة من نفس الكتلة. إذا كانت هناك نسخة أخرى من نفس الكتلة في Walrus ، فلن تجعل عملية Delete كتلة البيانات غير متوفرة للتنزيل ، وستقوم بدعوات Wal Walrus Read` بتنزيله. بعد الانتهاء من الحذف ، يتحقق CLI من الحالة المحدثة للكتلة لمعرفة ما إذا كان لا يزال متاحًا في Walrus (الأمم المتحدة أقل تم تحديد خيار `-no-status-check`). ومع ذلك ، حتى لو لم يكن الأمر كذلك ، فقد يتم تخزين نسخ من الكتلة العامة مؤقتًا أو تنزيلها من قبل المستخدمين ، ولا يتم حذف هذه النسخ.

source: ```admonish danger title="Delete reclaims space only" **All blobs stored in Walrus are public and discoverable by all.** The `delete` command will not delete slivers if other copies of the blob are stored on Walrus possibly by other users. It does not delete blobs from caches, slivers from past storage nodes, or copies that could have been made by users before the blob was deleted. ```
ar: `` `` intermonish danger title = "حذف المساحة فقط ** جميع الكتل المخزنة في Walrus هي عامة ويمكن اكتشافها من قبل الجميع. لا تحذف الشظايا إذا تم تخزين نسخ أخرى من الكتلة على Walrus ربما من قبل مستخدمين آخرين. لا يحذف الكتل من ذاكرة التخزين المؤقت أو الشظايا من عقد التخزين السابقة أو النسخ كان يمكن أن يكون ذلك من قبل المستخدمين قبل حذف الكتلة. `` `

source: Blob ID utilities
ar: أدوات معرف كتلة البيانات

source: The `walrus blob-id <FILE>` may be used to derive the blob ID of any file. The blob ID is a commitment to the file, and any blob with the same ID will decode to the same content. The blob ID is a 256 bit number and represented on some Sui explorer as a decimal large number. The command `walrus convert-blob-id <BLOB_ID_DECIMAL>` may be used to convert it to a base64 URL safe encoding used by the command line tools and other APIs.
ar: يمكن استخدام `walrus كتلة البيانات-id <ilem>` لاستخلاص معرف كتلة البيانات لأي ملف. يعد معرف كتلة البيانات التزامًا بالملف ، وأي مجموعة مع نفس المعرف سوف يفكان نفس المحتوى. معرف كتلة البيانات هو رقم 256 بت ويمثل في بعض Sui Explorer كعدد كبير عشري. يمكن استخدام الأمر `walrus convert-كتلة البيانات-id <كتلة البيانات_id_decimal>` لتحويله إلى عنوان URL BASE64 الذي يستخدمه أدوات سطر الأوامر وغيرها من واجهات برمجة التطبيقات.

source: The `walrus list-blobs` command lists all the non expired Sui blob object that the current account owns, including their blob ID, object ID, and metadata about expiry and deletable status. The option `--include-expired` also lists expired blob objects.
ar: يسرد أمر "قائمة Walrus List-كائنات" جميع كتلة البيانات Sui كتلة البيانات غير المصمم الذي يملكه الحساب الجاري ، بما في ذلك معرف كتلة البيانات ومعرف الكتلة والبيانات الوصفية حول انتهاء الصلاحية وحالة الحذف. يسرد الخيار `--in-expired" أيضًا كتلةات كتلة البيانات المنتهية الصلاحية.

source: Changing the default configuration
ar: تغيير التكوين الافتراضي

source: Use the `--config` option to specify a custom path to the [configuration location](../usage/setup.md#configuration).
ar: استخدم الخيار `--config` لتحديد مسار مخصص إلى [موقع التكوين](../usage/setup.md#configuration).

source: The `--wallet <WALLET>` argument may be used to specify a non-standard Sui wallet configuration file. And a `--gas-budget <GAS_BUDGET>` argument may be used to change the maximum amount of Sui (in MIST) that the command is allowed to use.
ar: يمكن استخدام وسيطة `-wallet <Wallet>` لتحديد ملف تكوين محفظة SUI غير القياسي. ويمكن استخدام وسيطة `-gas budget <as_budget> لتغيير الحد الأقصى لمقدار SUI (في الضباب) الذي يُسمح بالاستخدام.

source: JSON mode
ar: وضع JSON

source: All Walrus client commands are also available in JSON mode. In this mode, all the command-line flags of the original CLI command can be specified in JSON format. The JSON mode therefore simplifies programmatic access to the CLI.
ar: جميع أوامر عميل Walrus متوفرة أيضًا في وضع JSON. في هذا الوضع ، يمكن تحديد جميع أعلام سطر الأوامر لأمر CLI الأصلي بتنسيق JSON. وبالتالي فإن وضع JSON يبسط الوصول البرنامجي إلى CLI.

source: For example, to store a blob, run:
ar: على سبيل المثال ، لتخزين الكتلة ، قم بتشغيل:

source: '{ "config": "path/to/client_config.yaml", "command": { "store": { "file": "README.md" } } }'
ar: '{ "config": "path/to/client_config.yaml" ، "يأمر": { "محل": { "ملف": "readme.md" } } } '

source: Or, to read a blob knowing the blob ID:
ar: أو لقراءة كتلة البيانات معرف معرف الكتلة:

source: '{ "config": "path/to/client_config.yaml", "command": { "read": { "blobId": "4BKcDC0Ih5RJ8R0tFMz3MZVNZV8b2goT6_JiEEwNHQo" } } }'
ar: '{ "config": "path/to/client_config.yaml" ، "يأمر": { "يقرأ": { "Blobid": "4BKCDC0IH5RJ8R0TFMZ3MZVNZV8B2GOT6_JIEEWNHQO" } } } '

source: All options, default values, and commands are equal to those of the "standard" CLI mode, except that they are written in "camelCase" instead of "kebab-case".
ar: جميع الخيارات والقيم الافتراضية والأوامر تساوي تلك الموجودة في وضع "CLI القياسي" ، باستثناء أنها مكتوبة في "Camelcase" بدلاً من "Kebab-Case".

source: The `json` command also accepts input from `stdin`.
ar: يقبل الأمر `json` أيضًا المدخلات من` stdin `.

source: The output of a `json` command will itself be JSON-formatted, again to simplify parsing the results in a programmatic way. For example, the JSON output can be piped to the `jq` command for parsing and manually extracting relevant fields.
ar: سيتم تنسيق إخراج أمر `json` نفسه ، مرة أخرى لتبسيط تحليل النتائج بطريقة برمجية. على سبيل المثال ، يمكن أن يتم إخراج JSON إلى أمر "JQ` لتحليل الحقول ذات الصلة واستخراجها يدويًا.

source: Client Daemon mode & HTTP API
ar: وضع عميل Daemon وواجهة برمجة التطبيقات HTTP

source: In addition to the CLI and JSON modes, the Walrus client offers a _daemon mode_. In this mode, it runs a simple web server offering HTTP interfaces to store and read blobs in an _aggregator_ and _publisher_ role respectively. We also offer [public aggregator and publisher services](#public-services) to try the Walrus HTTP APIs without the need to run a local client.
ar: بالإضافة إلى وضعي CLI وJSON، يقدم عميل Walrus وضع _daemon_. في هذا الوضع، يقوم بتشغيل خادم ويب بسيط يوفر واجهات HTTP لتخزين وقراءة الكائنات في دور _aggregator_ و_publisher_ على التوالي. كما نقدم [خدمات التجميع والنشر العامة](#public-services) لتجربة واجهات برمجة تطبيقات Walrus HTTP دون الحاجة إلى تشغيل عميل محلي.

source: Starting the daemon locally
ar: بدء برنامج daemon محليًا

source: You can run a local Walrus daemon through the `walrus` binary. There are three different commands:
ar: يمكنك تشغيل برنامج Walrus محلي من خلال الملف الثنائي `walrus`. هناك ثلاثة أوامر مختلفة:

source: `walrus aggregator` starts an \
ar: `` walrus ascregator `يبدأ \

source: `walrus publisher` starts a \
ar: يبدأ "Walrus Publisher" A \
