Repository: Cryptoblarabi/walrus-docs
Catalog: po/*.po
Languages: ar

source: Having a server that accepts requests for a Sui object ID and possibly a path, and performs this resolution on behalf of the client, serving back the resource as a standard HTML Response.
ar: وجود خادم يقبل طلبات معرف كتلة البيانات SUI وربما مسار ، ويؤدي هذا الدقة نيابة عن العميل ، ويخدم المورد كاستجابة HTML قياسية.

source: Using a custom application on the client that has both a web browser and knowledge of how Walrus Sites work, and can locally perform this resolution.
ar: باستخدام تطبيق مخصص على العميل الذي يحتوي على متصفح ويب ومعرفة بكيفية عمل مواقع Walrus ، ويمكنه أداء هذا الدقة محليًا.

source: A hybrid approach based on service workers, where a service worker that is able to perform the resolution is installed in the browser from a portal.
ar: نهج هجين يستند إلى عمال الخدمة ، حيث يتم تثبيت عامل خدمة قادر على أداء القرار في المتصفح من بوابة.

source: All of these approaches are viable (the first has been used for similar applications in IPFS gateways, for example), and have trade-offs.
ar: كل هذه الأساليب قابلة للحياة (تم استخدام الأول لتطبيقات مماثلة في بوابات IPFS ، على سبيل المثال) ، ولها مقايضات.

source: Currently, we provide the server-side and the service-worker based approaches.
ar: حاليا ، نحن نقدم جانب الخادم والمناهج القائمة على عمال الخدمة.

source: Browsing and domain isolation
ar: التصفح وعزل المجال

source: We must ensure that, when browsing multiple sites through a portal, for example the one hosted at <https://walrus.site>, these sites are isolated. Isolation is necessary for security, and to ensure that the wallet connection in the browser works as expected.
ar: يجب أن نضمن أنه عند تصفح مواقع متعددة عبر بوابة ، على سبيل المثال ، المواقع المستضافة في <https://walrus.site> ، يتم عزل هذه المواقع. العزلة ضرورية للأمان ، ولضمان أن اتصال المحفظة في المتصفح يعمل كما هو متوقع.

source: To do so, we give each Walrus Site a specific _subdomain_ of the portal's domain. For example, the Flatland mint dApp is hosted at <https://flatland.walrus.site>, where the subdomain `flatland` is uniquely associated to the object ID of the Walrus Site through SuiNS.
ar: للقيام بذلك ، نمنح كل موقع Walrus _subdomain_ من مجال البوابة. على سبيل المثال ، يتم استضافة Dapp Flatland Mint DAPP على <https://flatland.walrus.site> ، حيث ترتبط النطاق الفرعي `flatland" بشكل فريد بمعرف الكتلة لموقع Walrus من خلال suins.

source: Walrus Sites also work without SuiNS: a site can _always_ be browsed by using as subdomain the Base36 encoding of the Sui object ID of the site. For the Flatland dApp, this URL is: <https://58gr4pinoayuijgdixud23441t55jd94ugep68fsm72b8mwmq2.walrus.site>.
ar: تعمل مواقع Walrus أيضًا بدون Suins: يمكن تصفح موقع _always_ باستخدام نطاق فرعي لـ BASE36 ترميز معرف كتلة البيانات SUI للموقع. بالنسبة إلى Flatland DAPP ، يكون عنوان URL هذا: <https://58gr4pinoayuijgdixud23441t55jd94uguep68fsm72b8mwmq2.walrus.site>.

source: Base36 was chosen for two reasons, forced by the subdomain standards:
ar: تم اختيار BASE36 لسببين ، فرضته معايير النطاق الفرعي:

source: A subdomain can have at most 63 characters, while a Hex-encoded Sui object ID requires 64.
ar: يمكن أن يكون لدى النطاق الفرعي 63 حرفًا على الأكثر ، في حين يتطلب معرف كتلة البيانات SUI المشفر HEX 64.

source: A subdomain is case _insensitive_, ruling out other popular encodings, e.g., Base64 or Base58.
ar: النطاق الفرعي هو حالة _insensitive_ ، استبعاد الترميزات الشائعة الأخرى ، على سبيل المثال ، BASE64 أو BASE58.

source: Walrus Site portals
ar: بوابات موقع Walrus

source: Portal types
ar: أنواع البوابة

source: As mentioned before, we provide two types of portals to browse Walrus Sites:
ar: كما ذكرنا من قبل ، نقدم نوعين من البوابات لتصفح مواقع Walrus:

source: The server-side portal, which is a server that resolves a Walrus Site, returning it to the browser. The server-side portal is hosted at <https://blob.store>.
ar: بوابة جانب الخادم ، وهو خادم يحل موقع Walrus ، وإعادته إلى المتصفح. يتم استضافة بوابة جانب الخادم على <https://كتلة البيانات.store>.

source: The service-worker portal, which is a service worker that is installed in the browser and resolves a Walrus Site. The service-worker portal is hosted at <https://walrus.site>.
ar: بوابة زميل في الخدمة ، وهي عامل خدمة مثبت في المتصفح ويحل موقع Walrus. يتم استضافة بوابة زميل الخدمة في <https://walrus.site>.

source: We now describe the resolution process of a Walrus Site in the browser using the service-worker portal as an example.
ar: نصف الآن عملية دقة موقع Walrus في المتصفح باستخدام بوابة عمال الخدمة كمثال.

source: The end-to-end resolution of a Walrus Site
ar: الحل الشامل لموقع Walrus

source: We now show in greater detail how a Walrus Site is rendered in a client's browser with the service worker approach. The steps below all reference the following figure:
ar: نعرض الآن بمزيد من التفصيل كيف يتم تقديم موقع Walrus في متصفح العميل مع نهج عامل الخدمة. الخطوات الموجودة أدناه جميعها تشير إلى الشكل التالي:

source: ![Walrus Site resolution](../assets/walrus-site-diagram.svg)
ar: ![حل موقع Walrus](../assets/walrus-site-diagram.svg)

source: **Site publishing** (step 0): The site developer publishes the Walrus Site using the [`site-builder`](#the-site-builder), or making use of a publisher. Assume the developer uses the SuiNS name `dapp.sui` to point to the object ID of the created Walrus Site.
ar: **نشر الموقع** (الخطوة 0): ينشر مطور الموقع موقع Walrus باستخدام [`site-builder`](#the-site-builder)، أو باستخدام ناشر. افترض أن المطور يستخدم اسم SuiNS `dapp.sui` للإشارة إلى معرف الكتلة لموقع Walrus الذي تم إنشاؤه.

source: **Browsing starts** (step 1): A client browses `dapp.walrus.site/index.html` in their browser.
ar: ** يبدأ التصفح ** (الخطوة 1): عميل يتصفح `dapp.walrus.site/index.html` في متصفحه.

source: **Service worker installation** (steps 2-6): The browser connects to the portal hosted at `walrus.site`, which responds with a page that installs the service worker for `dapp.walrus.site`. The page is refreshed to activate the service worker.
ar: ** تثبيت عامل الخدمة ** (الخطوات 2-6): يتصل المتصفح بالبوابة المستضافة في `walrus.site` ، والتي تستجيب بصفحة تقوم بتثبيت عامل الخدمة لـ` dapp.walrus.site`. تم تحديث الصفحة لتنشيط عامل الخدمة.

source: **Site resolution** (steps 7-10): The service worker, which is now installed, interprets its _origin_ `dapp.walrus.site`, and makes a SuiNS resolution for `dapp.sui`, obtaining the related object ID. Using the object ID, it then fetches the dynamic fields of the object (also checking [redirects](./portal.md)). From the dynamic fields, it selects the one for `/index.html`, and extracts its Walrus blob ID and headers (see the [advanced section on headers](./routing.md)).
ar: **حل الموقع** (الخطوات من 7 إلى 10): يقوم عامل الخدمة، الذي تم تثبيته الآن، بتفسير أصله `dapp.walrus.site`، ويقوم بإجراء حل SuiNS لـ `dapp.sui`، والحصول على معرف الكتلة ذي الصلة. باستخدام معرف الكتلة، يقوم بعد ذلك بجلب الحقول الديناميكية للكتلة (ويتحقق أيضًا من [redirects](./portal.md)). من الحقول الديناميكية، يقوم بتحديد الحقل الخاص بـ `/index.html`، ويستخرج معرف كتلة البيانات Walrus ورؤوسه (انظر [القسم المتقدم حول الرؤوس](./routing.md)).

source: **Blob fetch** (steps 11-14): Given the blob ID, the service worker queries a Walrus aggregator for the blob.
ar: ** كتلة البيانات fetch ** (الخطوات 11-14): بالنظر إلى معرف كتلة البيانات ، يستفسر عامل الخدمة وهو مجمع Walrus لـ كتلة البيانات.

source: **Returning the response** (steps 15-16): Now that the service worker has the bytes for `/index.html`, and its headers, it can craft a response that is then rendered by the browser.
ar: ** إرجاع الاستجابة ** (الخطوات 15-16): الآن بعد أن حصل عامل الخدمة على بايت لـ `/index.html` ، ورؤوسه ، يمكن أن يصنع الرد الذي يتم تقديمه بعد ذلك بواسطة المتصفح.

source: These steps are executed for all resources the browser may query thereafter (for example, if `/index.html` points to `assets/cat.png`).
ar: يتم تنفيذ هذه الخطوات لجميع الموارد التي يجوز للمستعرض الاستعلام عنها بعد ذلك (على سبيل المثال ، إذا كان `/index.html` يشير إلى` assets/cat.png`).

source: The site builder
ar: منشئ الموقع

source: To facilitate the creation of Walrus Sites, we provide the "site builder" tool. The site builder takes care of creating Walrus Sites object on Sui, with the correct structure, and stores the site resources to Walrus. Refer to the [tutorial](./tutorial.md) for setup and usage instructions.
ar: لتسهيل إنشاء مواقع Walrus، نوفر أداة "إنشاء المواقع". تتولى أداة إنشاء المواقع إنشاء كتلةات مواقع Walrus على Sui، بالهيكل الصحيح، وتخزين موارد الموقع في Walrus. راجع [البرنامج التعليمي](./tutorial.md) للحصول على تعليمات الإعداد والاستخدام.

source: We use the term "portal" to indicate any technology that is used to access and browse Walrus Sites. As mentioned in the [overview](./overview.md#the-site-rendering-path), we foresee three kinds of portals:
ar: نستخدم مصطلح "بوابة" للإشارة إلى أي تقنية تُستخدم للوصول إلى مواقع Walrus وتصفحها. وكما ذكرنا في [overview](./overview.md#the-site-rendering-path)، فإننا نتوقع ثلاثة أنواع من البوابات:

source: server-side portals;
ar: بوابات من جانب الخادم ؛

source: custom local apps; and
ar: تطبيقات محلية مخصصة ؛ و

source: service-worker based portals in the browser.
ar: البوابات القائمة على عمال الخدمة في المتصفح.

source: Currently, the server-side and service-workers portals are available at <https://blob.store> and <https://walrus.site>, respectively.
ar: حاليًا ، تتوفر بوابات جانب الخادم وزملاء الخدمة على <https://كتلة البيانات.store> و <https://walrus.site> ، على التوالي.

source: Running the portal locally
ar: تشغيل البوابة محليا

source: You can run a service-worker portal locally if you want to browse Walrus Sites without accessing external portals or for development purposes.
ar: يمكنك تشغيل بوابة زميل في الخدمة محليًا إذا كنت ترغب في تصفح مواقع Walrus دون الوصول إلى بوابات خارجية أو لأغراض التطوير.

source: This requires having the [`pnpm`](https://pnpm.io/) tool installed. To start, clone the `walrus-sites` repo and enter the `portal` directory. Here, run
ar: هذا يتطلب وجود أداة [pnpm`] (https://pnpm.io/) المثبتة. للبدء ، استنساخ repo `walrus sites` وأدخل دليل" البوابة ". هنا ، ركض

source: # Build the portal you want to use, or both
ar: # قم ببناء البوابة التي تريد استخدامها، أو كليهما /n

source: to install the dependencies, and then either one of the following commands:
ar: لتثبيت التبعيات ، ثم أحد الأوامر التالية:

source: # Serve the server-side portal
ar: # تخدم بوابة جانب الخادم

source: # Serve the service-worker portal
ar: # تخدم بوابة عامل الخدمة

source: to serve one of the portals. Typically, you will find it served at `localhost:8080` (but check the output of the serve command).
ar: لخدمة إحدى البوابات. عادةً، ستجدها تُقدم في `localhost:8080` (لكن تحقق من إخراج أمر الخدمة).

source: For the production versions, use the `prod` commands: `serve:prod:server` and `serve:prod:worker`.
ar: بالنسبة لإصدارات الإنتاج ، استخدم أوامر "Prod`:" الخدمة: Prod: Server` و "الخدمة: Prod: Worker`.

source: Configuring the portal
ar: تكوين البوابة

source: The most important configuration parameters for the portal are in `portal/common/lib/constants.ts`:
ar: أهم معلمات التكوين للبوابة هي في "بوابة/مشتركة/lib/constants.ts`:

source: `NETWORK`: The Sui network to be used for fetching the Walrus Sites objects. Currently, we use Sui `testnet`.
ar: `network`: شبكة SUI لاستخدامها لجلب كتلةات مواقع Walrus. حاليا ، نستخدم sui `الشبكة التجريبية`.

source: `AGGREGATOR`: The URL of the [aggregator](../usage/web-api.md) from which the service worker will fetch the Walrus blobs.
ar: `المجمع`: عنوان URL لـ [aggregator](../usage/web-api.md) الذي سيعمل عامل الخدمة من خلاله على جلب كتلةات Walrus.

source: `SITE_PACKAGE`: The Sui object ID of the Walrus Sites package.
ar: `site_package`: معرف كتلة البيانات SUI لحزمة مواقع Walrus.

source: `MAX_REDIRECT_DEPTH`: The number of [redirects](./redirects.md) the service worker will follow before stopping.
ar: `MAX_REDIRECT_DEPTH`: عدد عمليات إعادة التوجيه (./redirects.md) التي سيتبعها عامل الخدمة قبل التوقف.

source: `SITE_NAMES`: Hard coded `name: objectID` mappings, to override the SuiNS names. For development only.
ar: `site_names`: mappings hard مشفرة` `` ObjectId` ، لتجاوز أسماء suins. للتنمية فقط.

source: Walrus Sites offer a simple mechanism to authenticate the data that is served from the Walrus storage on the client side. Thus, Walrus Sites can guarantee (with various degrees of confidence, depending on the setup) that the site data is authentic and has not been tampered with by a malicious aggregator.
ar: توفر مواقع Walrus آلية بسيطة لمصادقة البيانات التي يتم تقديمها من تخزين Walrus على جانب العميل. وبالتالي ، يمكن أن تضمن مواقع Walrus (بدرجات مختلفة من الثقة ، اعتمادًا على الإعداد) أن بيانات الموقع أصلية ولم يتم العبث بها من قبل مجمع ضار.

source: Authentication mechanism
ar: آلية المصادقة

source: The Walrus Sites resource object on Sui stores, alongside the resource information, a SHA-256 hash of the resource's content.
ar: كتلة البيانات موارد مواقع Walrus على متاجر Sui ، إلى جانب معلومات الموارد ، تجزئة SHA-256 لمحتوى المورد.

source: When the client requests a resource, the portal will check that the hash of the data received from the Walrus storage (and the Walrus aggregator in particular) matches the hash stored on Sui.
ar: عندما يطلب العميل موردًا ، ستتحقق البوابة من أن تجزئة البيانات المستلمة من تخزين Walrus (ومجمع Walrus على وجه الخصوص) يتطابق مع التجزئة المخزنة على Sui.

source: If the hashes do not match, the portal will return the following warning page:
ar: إذا لم تتطابق التجزئة ، فستقوم البوابة بإرجاع صفحة التحذير التالية:

source: ![Hash mismatch warning page](../assets/walrus-sites-hash-mismatch.png)
ar: ![صفحة تحذير عدم تطابق التجزئة](../assets/walrus-sites-hash-mismatch.png)

source: Authentication Guarantees
ar: ضمانات المصادقة

source: Depending on the type of deployment, this technique gives increasing levels of confidence that the site data is authentic. We list them here in increasing order of assurance.
ar: اعتمادًا على نوع النشر ، تعطي هذه التقنية مستويات متزايدة من الثقة بأن بيانات الموقع أصلية. ندرجها هنا بترتيب متزايد للتأكيد.

source: Remote server-side portal deployment
ar: نشر بوابة جانب الخادم عن بعد

source: In this case, the user must fully trust the portal provider to authenticate the data. With a trusted portal, the authentication mechanism guarantees that the aggregator or cache (from which the blob has been fetched) did not tamper with the contents of the blob.
ar: في هذه الحالة ، يجب على المستخدم الوثوق بالكامل بمزود البوابة لمصادقة البيانات. مع بوابة موثوقة ، تضمن آلية المصادقة أن المجمع أو ذاكرة التخزين المؤقت (التي تم جلب الكتلة منها) لم يعبث بمحتويات الكتلة.

source: Remote service-worker portal deployment
ar: نشر بوابة خدمة العاملين عن بعد

source: Here, the portal provider is only trusted to provide the correct service worker code to the user. The user's browser will then perform the fetching and authentication. The guarantees are therefore the same as with the remote server-site portal, with the addition that the user can inspect the code returned by the portal provider and verify its integrity (e.g., by comparing it the hash of the service worker code to one that is known to be correct).
ar: هنا، لا يُعتمد إلا على مزود البوابة في توفير رمز عامل الخدمة الصحيح للمستخدم. ثم يقوم متصفح المستخدم بإجراء عملية جلب البيانات والمصادقة. وبالتالي فإن الضمانات هي نفسها كما هو الحال مع بوابة موقع الخادم البعيد، مع إضافة أنه يمكن للمستخدم فحص الرمز الذي أعاده مزود البوابة والتحقق من سلامته (على سبيل المثال، من خلال مقارنة تجزئة رمز عامل الخدمة برمز معروف أنه صحيح).

source: Local portal deployment
ar: نشر البوابة المحلية

source: Finally, a user can clone the Walrus Sites repository and deploy a portal locally, browsing Walrus Sites through `localhost`. In this case, the user has full control over the portal code and can verify its operation. Therefore, they can fully authenticate that the data served by Walrus and Walrus Sites is what the original developer intended.
ar: أخيرًا، يمكن للمستخدم استنساخ مستودع مواقع Walrus ونشر بوابة محليًا، وتصفح مواقع Walrus من خلال `localhost`. في هذه الحالة، يتمتع المستخدم بالتحكم الكامل في كود البوابة ويمكنه التحقق من تشغيلها. وبالتالي، يمكنه التحقق بشكل كامل من أن البيانات التي يقدمها Walrus ومواقع Walrus هي ما قصده المطور الأصلي.

source: Walrus Sites can be used to deploy almost any form of traditional static web2 website build for modern browsers. There are, however, a number of restrictions that a developer should keep in mind when creating or porting a website to Walrus Sites.
ar: يمكن استخدام مواقع Walrus لنشر أي شكل من أشكال تقريبًا من شكل Web2 Static Web2 للمتصفحات الحديثة. ومع ذلك ، هناك عدد من القيود التي يجب على المطور أن يضعها في الاعتبار عند إنشاء أو نقل موقع ويب إلى مواقع Walrus.

source: No secret values
ar: لا توجد قيم سرية

source: Walrus Sites are fully publicly accessible, as the metadata is stored on Sui, and the site content is stored on Walrus. Therefore, developers _must not_ store secret values within the sites.
ar: يمكن الوصول إلى مواقع Walrus بشكل كامل ، حيث يتم تخزين البيانات الوصفية على SUI ، ويتم تخزين محتوى الموقع على Walrus. لذلك ، فإن المطورين _must not_ تخزين القيم السرية داخل المواقع.

source: We emphasize again that any such backend-specific operations (storing secret values, authentication, etc.) are achievable by leveraging the integration with the Sui blockchain and a Sui-compatible wallet.
ar: نؤكد مرة أخرى على أن أي عمليات خاصة بالواجهة الخلفية (تخزين القيم السرية ، والمصادقة ، وما إلى ذلك) يمكن تحقيقها من خلال الاستفادة من التكامل مع sui بلوكتشين ومحفظة متوافقة مع SUI.

source: There is a maximum redirect depth
ar: هناك أقصى عمق إعادة توجيه

source: The number of consecutive redirects a Walrus Site can perform is capped by the portal (see [Portal configuration](./portal.md)). This measure ensures that loading a Walrus Site does not result in an infinite loading loop.
ar: يتم تحديد عدد عمليات إعادة التوجيه المتتالية التي يمكن لموقع Walrus إجراؤها بواسطة البوابة (انظر [تكوين البوابة](./portal.md)). يضمن هذا الإجراء أن تحميل موقع Walrus لا يؤدي إلى حلقة تحميل لا نهائية.

source: Different portals can set this limit as they desire. The limit for the portal hosted at <https://walrus.site> has a maximum redirect depth of 3.
ar: يمكن للوابات المختلفة ضبط هذا الحد كما يرغبون. الحد الأقصى للبوابة المستضافة في <https://walrus.site> لديه أقصى عمق إعادة توجيه 3.

source: Service workers are not available
ar: عمال الخدمة غير متاحين

source: Walrus Sites leverage service workers in the clients' browsers to perform essential operations:
ar: مواقع Walrus تستفيد من العاملين في متصفحات العملاء لأداء العمليات الأساسية:

source: reading the site metadata from Sui;
ar: قراءة بيانات تعريف الموقع من SUI ؛

source: fetching the page content from Walrus; and
ar: جلب محتوى الصفحة من Walrus ؛ و

source: serving the content to the browser.
ar: خدمة المحتوى للمتصفح.

source: Therefore, a site deployed on Walrus Sites cannot use service workers itself. Installing a service worker from within a Walrus Site will result in a dysfunctional site and a poor experience for the user.
ar: لذلك ، لا يمكن لموقع تم نشره على مواقع Walrus استخدام عمال الخدمة نفسه. سيؤدي تثبيت عامل خدمة من داخل موقع Walrus إلى موقع مختل وظيفي وخبرة سيئة للمستخدم.

source: iOS Sui mobile wallets do not work with the service-worker portal
ar: محافظ iOS Sui Mobile لا تعمل مع بوابة زميل في الخدمة

source: Service workers cannot be loaded inside an in-app browser on iOS, because of a limitation of the WebKit engine. As a consequence, Walrus Sites cannot be used within Sui-compatible wallet apps on iOS. Therefore, Sui wallets cannot currently be used on a service-worker portal on iOS. Note, however, that _browsing_ a Walrus Site is still possible on iOS through any browser.
ar: لا يمكن تحميل عمال الخدمة داخل متصفح التطبيق على iOS ، بسبب قيود محرك WebKit. نتيجة لذلك ، لا يمكن استخدام مواقع Walrus ضمن تطبيقات محفظة متوافقة مع SUI على iOS. لذلك ، لا يمكن حاليًا استخدام محافظ SUI على بوابة زميل في الخدمة على iOS. لاحظ ، مع ذلك ، أن موقع _browsing_ لا يزال موقع Walrus ممكنًا على iOS من خلال أي متصفح.

source: To provide a seamless experience for iOS users (and other users on browsers that do not support service workers), we implemented a redirect to a server-side portal (<https://blob.store>). Whenever a user on an iOS wallet browses a Walrus Site, the redirect will automatically take them to the `<site_name>.blob.store` server-side portal. This way, the user can still use the wallet.
ar: لتوفير تجربة سلسة لمستخدمي iOS (وغيرهم من المستخدمين على المتصفحات التي لا تدعم عمال الخدمة) ، قمنا بتنفيذ إعادة توجيه إلى بوابة من جانب الخادم (<https://كتلة البيانات.store>). عندما يتصفح مستخدم على محفظة iOS موقعًا من Walrus ، فإن إعادة التوجيه ستأخذها تلقائيًا إلى بوابة "Site_Name> .كتلة البيانات.store` جانب الخادم. بهذه الطريقة ، لا يزال بإمكان المستخدم استخدام المحفظة.

source: No support for progressive web apps (PWAs)
ar: لا يوجد دعم لتطبيقات الويب التقدمية (PWAS)

source: With the current design, Walrus Sites cannot be used for progressive web apps (PWAs).
ar: مع التصميم الحالي ، لا يمكن استخدام مواقع Walrus لتطبيقات الويب التقدمية (PWAs).

source: Two characteristics of the service-worker portal prevent support for PWAs:
ar: تمنع خصائص بوابة زميل في الخدمة دعم PWAS:

source: Since the service worker needs to be registered for the page to work, the PWA's manifest file cannot be loaded by the browser directly.
ar: نظرًا لأن عامل الخدمة يجب أن يتم تسجيله في الصفحة للعمل ، فلا يمكن تحميل ملف PWA الخاص بـ PWA بواسطة المتصفح مباشرة.

source: There can only be one service worker registered per origin. Therefore, registering a PWA's service worker would remove the Walrus Sites service worker, breaking Walrus Sites' functionality.
ar: لا يمكن أن يكون هناك سوى عامل خدمة واحد مسجل لكل أصل. لذلك ، فإن تسجيل عامل خدمة PWA سيؤدي إلى إزالة عامل خدمة مواقع Walrus ، وخرق وظائف مواقع Walrus.

source: Note that the server-side portal does not share these limitations. However, for the moment, we support both technologies: Walrus Sites must be able to load from both a service-worker portal and a server-side portal, and therefore have to be built with the more restrictive feature set. For more details, see the [installation requirements for PWAs](https://en.wikipedia.org/wiki/Progressive_web_app#Installation_criteria).
ar: لاحظ أن البوابة من جانب الخادم لا تشترك في هذه القيود. ومع ذلك، في الوقت الحالي، ندعم كلتا التقنيتين: يجب أن تكون مواقع Walrus قادرة على التحميل من كل من بوابة عامل الخدمة وبوابة جانب الخادم، وبالتالي يجب بناؤها بمجموعة الميزات الأكثر تقييدًا. لمزيد من التفاصيل، راجع [متطلبات التثبيت لتطبيقات الويب التقدمية](https://en.wikipedia.org/wiki/Progressive_web_app#Installation_criteria).

source: Walrus Sites - TERMS of SERVICE
ar: مواقع Walrus - شروط الخدمة

source: Last Updated: June 18, 2024
ar: آخر تحديث: 18 يونيو 2024

source: These Terms of Service (“**Terms**”) govern your use of certain software services, including Walrus Sites provided by Mysten Labs, Inc. (“**Mysten Labs**”) (collectively the "**Services**"). By accessing the Services, you agree to and accept these terms and conditions. If you don’t agree to be bound by these Terms, do not use the Services.
ar: تحكم شروط الخدمة هذه ("** الشروط **") استخدامك لبعض خدمات البرمجيات ، بما في ذلك مواقع Walrus التي توفرها Mysten Labs ، Inc. ("** Mysten Labs **") (مجتمعة "الخدمات ** ** "). من خلال الوصول إلى الخدمات ، فإنك توافق على هذه الشروط والأحكام وقبولها. إذا كنت لا توافق على الالتزام بهذه الشروط ، فلا تستخدم الخدمات.
